[
        {
              "Artist": "Against Me!",
              "Album": "Stabitha Christie",
              "Format": "7\" Picture Disc",
              "Label": "Total Treble",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060074:284",
              "More Info": "Limited edition 7\" picture disc featuring two brand new tracks from Against Me!. \"Stabitha Christie\"/\"First High Of The Morning"
              },
              {
              "Artist": "Air",
              "Album": "Le Soleil Est Pres de Moi",
              "Format": "12\" Vinyl",
              "Label": "Parlophone/Rhino",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059860:284",
              "More Info": "After their first two incredible debut singles (\"Modulator Mix\" and \"Casanova 70\") were revealed to the world in 1995 and 96, Air released two follow up classics in 1997: \"Le soleil est pres de moi\" and \"J'ai dormi sous l'eau\". This RSD release includes both original versions and a remixed version of 'J'ai dormi sous l'eau\" by the famous French electronic music duo l :cube & DJ Gilb'R .A.K.A Chateau flight and a Dan The Automator remix of \"Le soleil est pres de moi\". (Limited worldwide release of 4500.) SIDE A: 01 Le Soleil est pres de moi 02 J'ai dormi sous l'eau SIDE B: 01 Le soleil est pres de moi (Automator remix) 02 J'ai dormi sous l'eau"
              },
              {
              "Artist": "AJJ",
              "Album": "Decade of Regression: Live At SideOneDummy",
              "Format": "LP",
              "Label": "SideOneDummy",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060075:284",
              "More Info": "Decade of Regression: Live at SideOneDummy captures an intimate live session recorded at SideOneDummy's headquarters in Summer 2016 1. Goodbye, Oh Goodbye 2. Brave As A Noun 3. Survival Song 4. Linda Rondstadt 5. My Brain Is A Human Body 6. Rejoice 7. Junkie Church 8. Love in the Time of Human Papilomavirus 9. Growing Up 10. Coffin Dance 11. Bells and Whistles 12. Free Bird 13. Small Red Boy"
              },
              {
              "Artist": "Alice In Chains",
              "Album": "Get Born",
              "Format": "2 x 7\"",
              "Label": "Sony Legacy",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060053:284",
              "More Info": "This special Alice in Chains 45 RPM double 7\" single collects four hard-hitting tracks remastered and available on vinyl for the first time. \"What the Hell Have I\" and \"A Little Bitter,\" released on the soundtrack to the Arnold Schwarzenegger film Last Action Hero in 1993, were the first to feature new bassist Mike Inez, who\"d played with Ozzy Osbourne for five years. \"Get Born Again\" and \"Died,\" released on the box set Music Bank in 1999, were the band\"s final recordings with original vocalist Layne Staley."
              },
              {
              "Artist": "All Time Low",
              "Album": "MTV Unplugged (Live) - EP",
              "Format": "LP",
              "Label": "Hopeless Records",
              "Quantity": 1300,
              "PhotoURL": "https://s3.amazonaws.com/broadtime_thumbnails/979/418458059979/418458059979%3A284.jpg",
              "More Info": "For the first time ever, All Time Low's intimate MTV Unplugged album is available on warm and cozy vinyl. Available on limited edition white and black smashl Record Store Day Exclusive vinyl. 01 Damned If I Do Ya (Damned If I Don't) 02 Coffee Shop Soundtrack 03 Remembering Sunday 04 Jasey Rae 05 Weightless 06 Dear Maria, Count Me In"
              },
              {
              "Artist": "André 3000",
              "Album": "All Together Now - Single",
              "Format": "7\" Vinyl",
              "Label": "Sony Legacy",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060042:284",
              "More Info": "For the first time on vinyl, Andre 3000's eclectic interpretation of The Beatles' \"All Together Now\" first heard in a Nike commercial that aired during the NBA Finals in 2010. This 45 RPM 7\" single is backed with a previously unreleased instrumental version of the track."
              },
              {
              "Artist": "Atomic Bomb Band",
              "Album": "The Atomic Bomb Band (Performing the Music of William Onyeabor",
              "Format": "12\" Vinyl",
              "Label": "Luaka Bop",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061074:284",
              "More Info": "We never knew when we put out an album of the music of the late William Onyeabor that William had never performed live - though we did know he had no interest in doing it now. So we thought we should put together a band to play his music live. What an amazing time it's been. It's been so enjoayable that we thought we should document the group playing Williams music live in a studio. This document is not in anyway trying to compete with the amazing work that William Onyeabor did originally. This is a limited LP only edition which we hope you enjoy. Please welcome - The Atomic Bomb Band. Featured on this album: Jamie Lidell, Alexis Taylor (Hot Chip), Luke Jenner (The Rapture), Charles Lloyd, Money Mark (Beastie Boys), Pat Mahoney (LCD Soundsystem), Ahmed Gallab (Sinkane), Jason Trammell, Ish Montgomery, Johnny Lamm, Jas Walton & Jordan McLean (Antibalas), Lekan Babaloa, Kofo the Wonderman, Felicia Douglas, & Ananda Kihiri."
              },
              {
              "Artist": "Avenged Sevenfold",
              "Album": "Waking The Fallen",
              "Format": "2 x LP Picture Disc",
              "Label": "Hopeless Records",
              "Quantity": 1300,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059980:284",
              "More Info": "For the first time ever, Avenged Sevenfold's groundbreaking album, Waking The Fallen, is available on a double LP collector's edition picture disc. Extremely limited to a one-time only pressing for Record Store Day."
              },
              {
              "Artist": "Banks and Steelz",
              "Album": "Wild Season (featuring Florence Welch)",
              "Format": "7\" Vinyl",
              "Label": "Warner Bros.",
              "Quantity": 2800,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059846:284",
              "More Info": "A musical collaboration between Wu Tang Clan's RZA and Interpol's Paul Banks, featuring Florence Welch (of Florence and the Machine) on the A-side."
              },
              {
              "Artist": "The Beatles",
              "Album": "Strawberry Fields Forever",
              "Format": "7\" Vinyl",
              "Label": "Apple Corp./Capital Records",
              "Quantity": 7000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458080708:284",
              "More Info": "For Record Store Day 2017, an exclusive, limited edition 7\" single of The Beatles' \"Strawberry Fields Forever\" and \"Penny Lane\", among the first songs recorded during the Sgt. Pepper sessions, which begin in November 1966. Rather than being held for inclusion on the album, the two songs were released as a double A-sided single in February 1967. Amidst intense media speculation about the band's next move, the single bridged what was then considered a long gap between the Revolver album, released in August 1966, and Sgt. Pepper, which followed ten months later."
              },
              {
              "Artist": "Big L",
              "Album": "Devil's Son EP (From The Vaults)",
              "Format": "LP",
              "Label": "Sony Legacy",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060045:284",
              "More Info": "Harlem rapper Big L (1974-1999) helped pioneer the horrorcore subgenre of hiphop in his short but notable career with his underground track \"Devil's Son,\" a song recorded but deemed too controversial for 1995's Lifestyles Ov Da Poor & Dangerous. \"Devil's Son\" is released on 12\" vinyl alongside an instrumental version plus four legendary and long-bootlegged unreleased tracks from the Lifestyles Ov Da Poor & Dangerous sessions."
              },
              {
              "Artist": "Big Star",
              "Album": "Complete Third",
              "Format": "2 x LP",
              "Label": "Omnivore Recordings",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059889:284",
              "More Info": "Complete Third was years in the making, and its eventual CD release saw it appear on countless \"Best of 2016\" lists. The vinyl volumes of Complete Third began rolling out at the end of last year with Vol. 1: Demoes to Sessions To Roughs arriving in November and Vol. 2: Roughs To Mixes in February 2017. Now, Vol. 3: Final Masters is here to complete the trilogy. The double LP contains every released master recording from every officially released version of Third on 3 sides of vinyl. As an added bonus, the CD version's hidden track ( a previously issued strings and vocals only mix of \"Thank You Friends\") takes its place on a specially etched Side Four. A download card is included containing the audio for Vol. 3 and the complete liner notes and booklet as a PDF. To make Vol. 3 even more special, it is available in a limited edition slipcase with room for VOls 1 and 2 (which are sold separately) for Record Store Day 2017. Plus, it contains a 20 page, full color, LP sized booklet with all of the notes, photos and commentary from the CD set. This is a unique and beautiful way to house and display the three vinyl components. The third time is the charm to complete Complete Third on vinyl."
              },
              {
              "Artist": "Blind Mr. Jones",
              "Album": "Stereo Musicale",
              "Format": "2 x LP + 7\"",
              "Label": "Graveface Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059978:284",
              "More Info": "2XLP + 7\" featuring every single song this seminal shoegaze band recorded surrounding their masterpiece, Stereo Musicale, including said record itself. Featuring several tracks that have never been available on vinyl before. Every track has been remastered for vinyl. Some guest appearances by Neil Halstead (Slowdive) and Jonny Greenwood (Radiohead). Vinyl includes extensive liner notes and ephemera from their short lived career."
              },
              {
              "Artist": "Blitzen Trapper",
              "Album": "Unreleased Recordings Series: Waking Bullets at Breakneck Speed",
              "Format": "LP",
              "Label": "Lidkercow",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059948:284",
              "More Info": "Waking Bullets At Breakneck Speed is the first volume of Blitzen Trapper's Unreleased Recordings Series. It was recorded at the Telegraph Building in Portland, OR during the Wild Mountain Nation and Furr sessions circa 2006."
              },
              {
              "Artist": "David Bowie",
              "Album": "BOWPROMO",
              "Format": "Vinyl Box Set",
              "Label": "Parlophone",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059828:284",
              "More Info": "In August 1971, David Bowie's manager, Tony Defries had 500 promo LPs pressed to secure Bowie and fellow Mainman artist Dana Gillespie a record deal. This promo album, featuring seven Bowie songs on one Side A and five by Gillespie on the flip is often referred to as the BOWPROMO white label album. It came in generic white outer and inner sleeves, and had no printed labels so its matrix number (BOWPROMO 1A-1/1B-1) is the only way to safely identify it. This Record Store Day release faithfully replicates the original promo, with Bowie's seven tracks on one side, and adds five exclusive Bowie prints. (Limited worldwide release of 15,000.)"
              },
              {
              "Artist": "David Bowie",
              "Album": "Cracked Actor (Live Los Angeles '74)",
              "Format": "3 x LP",
              "Label": "Parlophone",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059859:284",
              "More Info": "A previously unreleased live recording from Los Angeles on 5th September, 1974. This was a pivotal gig in the transition between the Diamond Dogs tour and the Philly Dogs tour. Produced by David Bowie and mixed by Tony Visconti at Human Studios, NYC in October/November 2016. 3 LP set with etching on sixth side. (Limited worldwide release of 17,000.)"
              },
              {
              "Artist": "Brother Ali",
              "Album": "The Undisputed Truth",
              "Format": "3 x LP",
              "Label": "Rhymesayers",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059914:284",
              "More Info": "Limited edition 3 x color LP containing original album and bonus disc featuring b-sides, unreleased tracks, and a set of 4-track recorded demos never before released. Full color tri-fold LP jacket with matte UV + Spot gloss finish, 12-page LP lyric & photo booklet, 3x color vinyl, & free digital download card."
              },
              {
              "Artist": "Danny Brown",
              "Album": "Ain't It Funny",
              "Format": "10\" Picture Disc",
              "Label": "Warp Records",
              "Quantity": 1300,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061077:284",
              "More Info": "Following his widely acclaimed third album, Atrocity Exhibition, Danny Brown is back for Record Store Day serving up this gorgeous 10\" picture disc with artwork by the Braindead collective. Side A features album cut and fan favorite \"Ain't it Funny\", which was recently featured in the trailer for Dragon Ball Z Super. The B-side features Danny's Clams Casino collaboration \"Worth It\", appearing on vinyl for the first time."
              },
              {
              "Artist": "Bullet For My Valentine",
              "Album": "Don't Need You - Single",
              "Format": "10\" Vinyl",
              "Label": "Spinefarm",
              "Quantity": 1530,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060504:284",
              "More Info": "New track from Bullet For My Valentine on red translucent wax and logo etched b-side in 10\" format. This will be the only phsyical release of this song available and will not be on their upcoming full length"
              },
              {
              "Artist": "R.L. Burnside",
              "Album": "Long Distance Call",
              "Format": "LP",
              "Label": "Fat Possum Records",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060008:284",
              "More Info": "For the first time, the 1982 recordings in Groningen, Netherlands with Leo Bruin have arrived on vinyl. Here you find R.L. Burnside, alone with only his guitar and his voice. Showing off his skills even in his younger days, in the vein of John Lee Hooker and Fred McDowell."
              },
              {
              "Artist": "The Cadillac Three",
              "Album": "Live at Abbey Road",
              "Format": "10\" Vinyl",
              "Label": "Big Machine Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060537:284",
              "More Info": "Live recording from Abbey Road studios in London"
              },
              {
              "Artist": "The Cars",
              "Album": "Live at the Agora, 1978",
              "Format": "2 x LP",
              "Label": "Elektra Catalog Group",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059867:284",
              "More Info": "The Cars Live at the Agora was recorded at the Agora Ballroom in Cleveland, OH on July 18, 1978, right after The Cars' first blush of success with the singles \"Just What I Needed\" and \"My Best Friend's Girl\". This never-before-released live show captures The Cars' early vitality and fierce energy. Side D contains a custom \"tire tread\" etching designed by Cars drummer David Robinson."
              },
              {
              "Artist": "Johnny Cash",
              "Album": "The Johnny Cash Children's Album",
              "Format": "LP",
              "Label": "Sony Legacy",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060046:284",
              "More Info": "The Johnny Cash Children's Album showcased a lighter side of The Man in Black. Released in 1975, this LP featured lighthearted songs like \"Nasty Dan\" (written by Sesame Street writer Jeff Moss and first performed by Cash on the classic children's program), the original \"I Got a Boy (and His Name is John)\" (written about Cash's only son, John Carter Cash, who contributes liner notes to this reissue) and \"Old Shep,\" famously recorded by Elvis Presley in 1956. Available on vinyl for the first time in more than 40 years, The Johnny Cash Children's Album is good country fun for the whole family."
              },
              {
              "Artist": "Cheap Trick",
              "Album": "The Epic Archive Vol. One",
              "Format": "2 x LP",
              "Label": "Real Gone Music",
              "Quantity": 1470,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059905:284",
              "More Info": "Consisting of single mixes/edits, soundtrack, non-LP tracks and other rarities, this yellow vinyl double LP presents eighteen rarities from the early years of this seminal power pop band. Liner notes by Ken Sharp feature track-by-track annotation by Bun E. Carlos, and the package will feature photos from band photographer Bob Alford."
              },
              {
              "Artist": "Vic Chesnutt",
              "Album": "West of Rome",
              "Format": "2 x LP",
              "Label": "New West Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059904:284",
              "More Info": "New West Records is proud to present Vic Chesnutt's second studio album West of Rome. Meticulously remastered and pressed on vinyl for the very first time, West of Rome is widely regarded by fans and hailed by critics as Chesnutt's best record. Originally produced by R.E.M.'s Michael Stipe, this vinyl pressing features an alternate tracklisting curated by Vic and Stipe in which \"Latent/Blatant\" no longer kicks off the album and is moved to the bonus tracks. In addition, the closing instrumental which was \"hidden\" in the original release is now titled \"Little Fugue\" and has been resequenced as the fourteenth track. West of Rome's two studio outtakes, \"Nathan\" and \"Where's The Clock\" appear in the bonus tracks. Also included are four-track demos and live versions of songs from the same time period. This pressing is West of Rome as it was meant to be."
              },
              {
              "Artist": "Brandy Clark",
              "Album": "Live From Los Angeles",
              "Format": "LP",
              "Label": "Warner Bros.",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059844:284",
              "More Info": "Previously unreleased recording, live from the Hotel Cafe featuring Brandy in pared down, intimate setting with only a guitarist accompanying her."
              },
              {
              "Artist": "The Claypool Lennon Delirium",
              "Album": "Lime and Limpid Green",
              "Format": "10\" Vinyl",
              "Label": "ATO Records",
              "Quantity": 3030,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060573:284",
              "More Info": "The Claypool Lennon Delirium covers Pink Floyd, King Crimson, The Who, and Travellin Flower Band on this four song llive EP on mixed bright green vinyl 10\"."
              },
              {
              "Artist": "Inna Baba Coulibaly",
              "Album": "Sahel (feat. Ali Farka Touré)",
              "Format": "10\" Vinyl",
              "Label": "KARTEL/World Circuit",
              "Quantity": "N/A",
              "PhotoURL": "http://recordstoreday.com/Photo/418458059981:284",
              "More Info": "Previously unreleased Ali Farka Toure recording"
              },
              {
              "Artist": "The Count Five",
              "Album": "Psychotic Reaction",
              "Format": "12\" Vinyl",
              "Label": "Concord Bicycle",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060516:284",
              "More Info": "Reissue of rare MONO edition of the garage rock classic from 1966 pressed on 180-gram vinyl."
              },
              {
              "Artist": "David Crosby and the Lighthouse Band",
              "Album": "The David Crosby and the Lighthouse Band Record Store Day 10th Anniversary Record",
              "Format": "12\" Vinyl",
              "Label": "Record Store Day",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059946:284",
              "More Info": "Four songs performed on NPR's World Cafe on December 8th, 2016 and pressed as the official RSD 10th Anniversary Record. The Lighthouse band features David Crosby, Michael League (Snarky Puppy), Becca Stevens, and Michelle Willis. Limited to 2500 copies."
              },
              {
              "Artist": "The Cure",
              "Album": "Greatest Hits",
              "Format": "2 x LP Picture Disc",
              "Label": "Elektra Catalog Group",
              "Quantity": 3250,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059878:284",
              "More Info": "Limited edition double picture discs of The Cure's Greatest Hits. Featuring their best known tracks, including \"Love Song\", \"Friday I'm In Love\" \"Never Enough\", \"Mint Car\" and many more. Curated and remastered by Robert Smith. On vinyl for the very first time for Record Store Day 2017."
              },
              {
              "Artist": "The Cure",
              "Album": "Greatest Hits Acoustic",
              "Format": "2 x LP Picture Disc",
              "Label": "Elektra Catalog Group",
              "Quantity": 3250,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059876:284",
              "More Info": "Limited edition double picture discs of The Cure's Greatest Hits performed acoustically. Featuring their best known tracks, including \"Love Song\", \"Friday I'm In Love\" \"Never Enough\", \"Mint Car\" and many more. Curated and remastered by Robert Smith. On vinyl for the very first time for Record Store Day 2017."
              },
              {
              "Artist": "Miley Cyrus",
              "Album": "Bangerz",
              "Format": "2 x LP",
              "Label": "RCA",
              "Quantity": 1300,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060039:284",
              "More Info": "Double hot pink vinyl set of Bangerz"
              },
              {
              "Artist": "Czarface",
              "Album": "First Weapon Drawn",
              "Format": "LP / Comic",
              "Label": "Silver Age",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059998:284",
              "More Info": "The first weapon drawn in a conflict is language, but the first weapon drawn for Czarface is music. Wu-Tang Clan's Inspectah Deck & Esoteric carved a niche for Czarface with venomous vocals, but the musical production is their super power. Powered by the trademark sound of 7L and Todd Spadafore (The Czar-Keys), a sound that's been developed since Czarface's first LP in 2013, First Weapon Drawn serves as the soundtrack to Czarface's mysterious origin. Fresh off of their collaboration with Marvel Comics, Czarface has not only delivered a new audio adventure complete with narration, it has given us an extra large, full color, action-packed 24 page comic book with it, housed in a beautiful gatefold jacket! In the spirit of the highly sought after Power Records series from the 70's, you can read along with the comic and hear the story come to life on vinyl."
              },
              {
              "Artist": "Deee-Lite",
              "Album": "Groove Is In The Heart/What is Love?",
              "Format": "12\" Vinyl",
              "Label": "Elektra Catalog Group",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059866:284",
              "More Info": "Groove Is In The Heart was originally released in 1990 and has never been released since; with its marvelous combination of modern classic dance sheen, funk and singer Lady Miss Kier's diva attitude, the single defined the summer of 1990 on MTV and radio. Released on pink vinyl for Record Store Day 2017."
              },
              {
              "Artist": "The Dillinger Escape Plan",
              "Album": "Instrumentalist",
              "Format": "7\" Vinyl",
              "Label": "Inc/Cooking Vinyl",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060010:284",
              "More Info": "Limited edition white 7\" featuring instrumental and remix versions of songs from their 2016 release, Dissociation. These versions have never been released and will be exclusive to this Record Store Day 2017 piece."
              },
              {
              "Artist": "The Distillers",
              "Album": "Coral Fang",
              "Format": "LP",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059868:284",
              "More Info": "The Distillers' third and last studio album was also their debut on a major label. Released in 2003, it features some of the best jagged punk-pop in \"Drain The Blood\" and \"Beat Your Heart Out\", beautifully bruising ballads like \"Tonight You're Only Hear To Know\" and some of the Distillers' best songs, such as \"The Hunger\" and \"The Gallow is God\". The LP is long out of print and heavily sought after by fans of the band's leader, Brody Dalle. The original release of this record was limited to a quantity of 1000 with artwork that was featured on only on that version, until now. Our RSD release revisits the artwork with the original photographic design and printed cover insert."
              },
              {
              "Artist": "The Doors",
              "Album": "Live at the Matrix '67",
              "Format": "LP",
              "Label": "Elektra Catalog Group",
              "Quantity": 4500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059873:284",
              "More Info": "The Doors' Live At The Matrix was recorded on March 7, 1967 in San Francisco. Newly mastered by Bruce Botnick, the historic engineer for The Doors, from recently discovered original master tapes. Celebrating 50 years of The Doors, Live at the Matrix is now on vinyl for the very first time, exclusively for Record Store Day 2017."
              },
              {
              "Artist": "Drive-By Truckers",
              "Album": "Electric Lady Sessions",
              "Format": "12\" Vinyl",
              "Label": "ATO Records",
              "Quantity": 3530,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060506:284",
              "More Info": "Seven live tracks recorded at Electric Lady Studios exclusive to this clear vinyl release."
              },
              {
              "Artist": "Steve Earle and the Dukes",
              "Album": "Live",
              "Format": "7\" Vinyl",
              "Label": "Warner Bros.",
              "Quantity": 2800,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059845:284",
              "More Info": "A two song single for Record Store Day, featuring live versions of Waylon Jennings' \"Are You Sure Hank Done It This Way\" and his own \"Fixin To Die\"."
              },
              {
              "Artist": "The Easybeats",
              "Album": "Vigil",
              "Format": "LP",
              "Label": "Varese",
              "Quantity": 2200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060517:284",
              "More Info": "Vigil was originally released in 1968 as the Easybeats follow-up to their UK album, Good Friday. The North American release of Vigil, however, was re-titled Falling Off The Edge Of The World and issued with a different album cover and running order.  This very rare album has been unavailable on vinyl for about 40 years and is being released as Vigil for the first time in the U.S. The album features \"Bring A Little Lovin,\" \"Good Times\" and \"Falling Off the Edge of the World.\""
              },
              {
              "Artist": "Emerson, Lake & Palmer",
              "Album": "Brain Salad Surgery",
              "Format": "7\" Vinyl",
              "Label": "BMG",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059912:284",
              "More Info": "Replica of sought after 1973 NME covermount flexi-disc, imported from the UK for Record Store Day 2017"
              },
              {
              "Artist": "Bill Evans",
              "Album": "Another Time: The Hilversum Concert",
              "Format": "LP",
              "Label": "Resonance Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060082:284",
              "More Info": "Another Time: The Hilversum Concert is a rare, never-before-issued recording of the legendary Bill Evans trio featuring Eddie Gomez on bass and Jack DeJohnette on drums captured live at the NRU (Netherlands Radio Union) Studios in Hilversum in 1968. This is only the third known recording in existence of this particular trio. The tapes have laid dormant for nearly 50 years. This deluxe LP will include rare photos, essays and interviews. 180g black vinyl."
              },
              {
              "Artist": "Marianne Faithfull",
              "Album": "Rich Kid Blues",
              "Format": "LP",
              "Label": "AEC Imports/Demon",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059977:284",
              "More Info": "Produced by Mike Leander, who had produced and arranged much of Faithfull\"s Decca material, Rich Kid Blues is an intriguing album of spare, largely acoustic readings of folk/rock songs, including several Bob Dylan covers, as well as songs by Phil Ochs, George Harrison, Cat Stevens, Tim Hardin, James Taylor and Sandy Denny. Marianne Faithfull had this to say about the 1971 recordings: \"The record itself is very strange and ghostly. It\"s the voice of somebody incredibly high, probably on the edge of death. They always sound like that. Johnny Thunders sounds like that. Anybody who heard that record would have said, \"Well that\"s that. We\"ll never hear from her again\".\" Recorded in 1972, but not released until 1985, this silver vinyl reissue brings it back into print for Record Store Day."
              },
              {
              "Artist": "Dylan Gardner/The Flaming Groovies",
              "Album": "Shake Some Action Side By Side",
              "Format": "7\" Vinyl",
              "Label": "Warner Bros.",
              "Quantity": "N/A",
              "PhotoURL": "http://recordstoreday.com/Photo/418458059849:284",
              "More Info": "Continuing in the now-classic Side By Side Series for Record Store Day 2017, this single features both The Flamin Groovies and Dylan Gardner taking on \"Shake Some Action\" on a red/blue swirl vinyl 7\"."
              },
              {
              "Artist": "Fleetwood Mac",
              "Album": "Alternate Mirage",
              "Format": "LP",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059803:284",
              "More Info": "An album of alternate takes from the Mirage Deluxe edition, originally released in 2016. Includes the early versions of Mirage favorites \"Gypsy\", \"Hold On\" and \"Oh Diane\". Previously released only on CD, first time on vinyl."
              },
              {
              "Artist": "Ben Folds w/ West Australian Symphony Orchestra",
              "Album": "Live in Perth",
              "Format": "2 x LP",
              "Label": "Sony Legacy",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060044:284",
              "More Info": "Recorded live over two nights in Australia in 2005, Live in Perth features Ben Folds in collaboration with The West Australian Symphony Orchestra for an orchestral take on favorites from his witty pianopop discography\"his first of many performances with orchestras all over the world. Previously only available on DVD, Live in Perth will be available as a 2LP set that features two previously unreleased recordings from the concerts."
              },
              {
              "Artist": "Frank n Dank & Jay Dee",
              "Album": "The Jay Dee Tapes",
              "Format": "10\" Vinyl",
              "Label": "Delicious Vinyl",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059999:284",
              "More Info": "Frank Nitt and Dankery Harv - or just Frank n Dank - knew J. Dilla before you. But don't feel bad, they knew Dilla before anyone knew Dilla. When Dilla was still in Detroit, before he was known as J Dilla. Before he'd even stepped foot in LA. From their personal vault, Frank n Dank bring you these cuts from their years working with Dilla, including complete instrumentals, presented in a 10\" red vinyl pressing."
              },
              {
              "Artist": "The Germs",
              "Album": "Lexicon Devil",
              "Format": "7\" Vinyl",
              "Label": "Blank Recording Company",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060743:284",
              "More Info": "First wave Los Angeles punk rock royalty THE GERMS need no introduction to anyone who should care.Their star shone extremely strong for an incredibly short time before their demise.A star that still shines in the aftermath of their end. THE GERMS are still influential to those who came after and ran with the punk rock baton. Lexicon Devil was THE GERMS' second single and the first ever release for the legendary Slash label. This reissue is replicating the original 1978 version. This edition will be made available in the same four sleeve color variations as the original with matching colored vinyl (in red, pink, yellow and orange with each color being limited to 500 for a grand total of 2000 copies). On this reissue the lyrics will be printed on the inner sleeve as opposed to other side of the sleeve like on the original."
              },
              {
              "Artist": "Brantley Gilbert",
              "Album": "The Devil Don't Sleep",
              "Format": "LP",
              "Label": "The Valory Music Co.",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060515:284",
              "More Info": "A Record Store Day release that combines five live tracks with five unreleased demos."
              },
              {
              "Artist": "Dexter Gordon",
              "Album": "Walk The Blues",
              "Format": "12\" Vinyl",
              "Label": "ORG Music",
              "Quantity": 1750,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059902:284",
              "More Info": "During a two day period (July 20-21, 1967) tenor-saxophonist Dexter Gordon and his quartet recorded multiple albums worth of material at one of Gordon's favorite venues, the legendary Jazzhus Montmartre in Copenhagen. The results are are undoubtedly among his finest European recordings. This record, Walk The Blues, is pulled from the second night of recording, and finds Dexter in an expansive, relaxed mood in front of an appreciative audience. These brilliant recordings will now make their vinyl debut on this 180g audiophile-grade LP, pressed at Pallas in Germany. This limited edition color vinyl pressing is available exclusively for Record Store Day 2017."
              },
              {
              "Artist": "Greg Graffin",
              "Album": "Cold As The Clay",
              "Format": "LP",
              "Label": "ANTI-",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059898:284",
              "More Info": "When first released in July of 2006, Greg Graffin's Cold as The Clay may have seemed a world apart from his punk rock roots as singer and founding member of Bad Religion. But the classic American music that Graffin pays homage to here, in both carefully chosen covers and in his own songwriting, forms the backbone of Bad Religion's epic tales of the young and the poor, mired by misery and poverty. Cold as the Clay honors the traditional folk music that Graffin grew up listening to, with original rock compositions that drew inspiration from the folk rock of Gram Parsons and Neil Young, as well as traditional American Folk music. The album was produced by Brett Gurewitz and features guest performances by singer Jolie Holland and The Wearkerthans as backing musicians. In celebration of both the 10th anniversary of this release and the 10th Record Store Day, Cold as the Clay will be pressed on LP for the first time, in a limited run of metallica gold vinyl."
              },
              {
              "Artist": "Grateful Dead",
              "Album": "P.N.E. Garden Auditorium, Vancouver, British Columbia, Canada 7/29/66",
              "Format": "2 x LP",
              "Label": "Grateful Dead Production",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059874:284",
              "More Info": "P.N.E. Garden Auditorium, Vancouver, British Columbia, Canada 7/29/66 marks Grateful Dead's debut performance outside of the United States. Their complete July 29, 1966 performance is being released in a limited edition, 2-LP, 180 gram vinyl-set, with four bonus tracks from the ensuing 7/30 performance at the same venue. Original cover art by Canadian poster artist Bob Masse, the iconic '60s poster artist who has designed original works for artists such as Jefferson Airplane, Janis Joplin, Jimi Hendrix, The Doors, David Bowie, Fleetwood Mac, Steve MillerBand, No Doubt, Fiona Apple & Smashing Pumpkins to name a few. The show was mastered from the original audio recordings by GRAMMY-winning sound engineer Jeffrey Norman at Mockingbird Mastering in Petaluma, CA. This audio was first made available in January, 2016 as the bonus disc in the 2-CD The Grateful Dead (50th Anniversary Deluxe Edition) as it features most of the tracks that would make their way on to the first official Grateful Dead album. This is the only stand-alone release for this content."
              },
              {
              "Artist": "Buddy Guy",
              "Album": "Sick With Love",
              "Format": "10\" Vinyl",
              "Label": "RCA",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060040:284",
              "More Info": "10\" single with two brand new songs exclusive to this RSD release"
              },
              {
              "Artist": "Hawkwind",
              "Album": "Best of the United Artists Years",
              "Format": "LP",
              "Label": "ORG Music",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059917:284",
              "More Info": "Best of United Artists Years: 1971-1974 compiles the some of the best recordings from space-rock pioneers Hawkwind's earliest and, arguably, most compelling material. The record also features some rare and alternate versions of songs from the band's studio albums of that era, like \"Silver Machine (Live at Roundhouse 1971)\". This limited edition pressing on swirl color vinyl is exclusively available for Record Store Day 2017. The album was pressed at Pallas Group in Germany on audiophile-grade vinyl."
              },
              {
              "Artist": "Mayer Hawthorne",
              "Album": "Party of One",
              "Format": "LP",
              "Label": "BMG",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059911:284",
              "More Info": "The first physical release of Mayer's 2016 digital EP, pressed on luminescent aquamarine vinyl."
              },
              {
              "Artist": "Jimi Hendrix (Curtis Knight)",
              "Album": "Live at George's Club 20, 1965 & 1966",
              "Format": "2 x LP",
              "Label": "Sony Legacy",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060052:284",
              "More Info": "Live At George's Club 20 collects raw amateur live recordings of Jimi Hendrix performing with Curtis Knight, made in December 1965 and January 1966, just months before his discovery in Greenwich Village by Animals bassist Chas Chandler. These raucous blues and soul recordings represent the closest approximation of what Chandler heard when he first spotted Hendrix at the Caf_ Wha?. Never before officially released in America, Jimi\"s primal guitar, compelling voice and engaging persona are evident throughout spirited versions of classics by Muddy Waters, Jimmy Reed, Ray Charles and others. This specially priced, two LP offering from Dagger Records, the official bootleg label created by Experience Hendrix, presents the original recordings restored by Eddie Kramer and free of various overdubs and excess manipulation present on earlier, unsanctioned releases."
              },
              {
              "Artist": "Jason Isbell and the 400 Unit",
              "Album": "Welcome to 1979",
              "Format": "12\" Vinyl",
              "Label": "Thirty Tigers",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060003:284",
              "More Info": "Live recordings direct cut to acetate at Nashville studio Welcome To 1979. 12\", tip-on style, simple sleeve jacket, white dust sleeve."
              },
              {
              "Artist": "Jane's Addiction",
              "Album": "Been Caught Stealing",
              "Format": "12\" Vinyl",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059821:284",
              "More Info": "Originally released in 1990 in conjunction with the Ritual De Lo Habitual album, \"Been Caught Stealing\" was a massive hit for Jane's Addiction. This 4 track replicates the original European 12\" release and contains the album version and a remix of \"Been Caught Stealing\" plus \"L.A. Medley\" which includes Woman\" (The Doors), \"Nausea\" (X) and \"Lexicon Devil\" (The Germs)."
              },
              {
              "Artist": "Elton John",
              "Album": "17-11-70",
              "Format": "2 x LP",
              "Label": "UMC/USM/Mercury",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458082015:284",
              "More Info": "For Record Store Day 2017, an expanded two LP edition of the 1970 live session at A&R Studios in New York. Originally released in 1971, 17-11-70 was Elton John's first ever live album. Presented here in a new expanded edition, LP 1 features the original album, remastered in 2016 by Bob Ludwig, with seven additional tracks--six previously unreleased songs mixed by longtime Elton John collaborator matt Still in Atlanta plus the 1995 bonus track \"Amoreena\"."
              },
              {
              "Artist": "Robert Johnson",
              "Album": "The Complete Recordings: The Centennial Collection",
              "Format": "3 x LP",
              "Label": "Sony Legacy",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060050:284",
              "More Info": "In 1936 and 1937, Robert Johnson recorded two sessions of Delta blues that would profoundly shape the course of rock music over the 20th century. The Complete Recordings: The Centennial Collection is the ultimate document of these groundbreaking sessions. All 42 known recordings are exquisitely remastered on 3 LPs, packaged in a limited edition deluxe gatefold jacket including extensive liner notes\"the first time Johnson\"s complete recorded works are available in one vinyl package. This set also includes an exclusive bonus poster featuring the original labels of Johnson\"s 78 RPM singles, released 80 years ago by early 20th century labels like Vocalion, Orion, Conqueror and others."
              },
              {
              "Artist": "Sharon Jones with the E.L. Fields Gospel Wonders",
              "Album": "\"Heaven Bound\" b/w \"Key To The Kingdom\"",
              "Format": "7\" Vinyl",
              "Label": "Daptone Records",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061072:284",
              "More Info": "Introducing the very first Gospel Funk recordings by Sharon Jones from the late '70s with E.L. Fields and The Gospel Wonders. Original composition and lead vocals by Sharon Jones. Pressed on Daptone Records' reissue subsidiary, EVER-SOUL Records. Packaging features a 'picture frame' custom jacket with easel-back + a double-sided photo featuring Sharon Jones' High School Portrait on one side and Sharon Jones with the Gospel Wonders on the other."
              },
              {
              "Artist": "Trevor Jones",
              "Album": "The Dark Crystal: The Original Soundtrack",
              "Format": "LP",
              "Label": "Enjoy The Ride",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060433:284",
              "More Info": "35th Anniversary Vinyl Reissue 1st time available on vinyl since the original films' release Richard Amsel designed poster used as vinyl album cover for the 1st time Pressed on 140 gram \"Crystal Clear\" vinyl. Upgraded 400gsm thick Lp Jacket Limited worldwide pressing of 2000 copies. The Dark Crystal: The Original Sound Track features Trevor Jones' musical score written for the film, arranged specifically for an album listening experience. The album was recorded by the London Symphony Orchestra at the legendary Abby road studios in 1982. The album has been reissued on CD in various countries throughout the last 35 years, but this is the first vinyl reissue since the film's original release."
              },
              {
              "Artist": "Ken Kesey",
              "Album": "The Acid Test",
              "Format": "LP",
              "Label": "Jackpot Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059950:284",
              "More Info": "Originally released in 1966 in a pressing of less than 500, this live-in-the-studio recording was intended to recreate the live acid test shows for listeners. Gratedul Dead and Ken Babb were in attendance at the recording, and this new release will have liner notes by Babb."
              },
              {
              "Artist": "The Kinks",
              "Album": "All Day And All Of The Night",
              "Format": "EP",
              "Label": "BMG",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059802:284",
              "More Info": "Reissue of French EP from 1964. Never available in the U.S., out of print since 1964."
              },
              {
              "Artist": "The Kinks",
              "Album": "Got Love If You Want It",
              "Format": "7\" Vinyl",
              "Label": "BMG",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059907:284",
              "More Info": "Reissue of French EP from 1965. Never available in the U.S., out of print since 1965."
              },
              {
              "Artist": "Pokey LaFarge",
              "Album": "Riot In The Streets/Better Man Than Me",
              "Format": "10\" Vinyl",
              "Label": "Rounder Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060528:284",
              "More Info": "Pokey LaFarge returns with his long anticipated 10\" of brand new material. The A Side includes \"Riot in the Streets\" and \"Better Man than Me\" while the B Side features etching of original hand-drawn image by Pokey. \"It\"s Pokey LaFarge, and it\"s 100% authentic and a hell of a good time.\""
              },
              {
              "Artist": "Bryan Lee",
              "Album": "\"Live at the Old Absinthe House Bar\" Friday Night",
              "Format": "2 x LP",
              "Label": "Justin Time Records",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059910:284",
              "More Info": "New Orleans bluesman Bryan Lee, a longtime fixture on Bourbon Street, indulges in a pyrotechnic guitar summit on Live At The Old Absinthe House Bar...Friday Night. Backed by his good rockin', hard shufflin' band, the blind guitarist cranks on his exuberant theme song \"Braille Blues Daddy,\" Albert King's \"Crosscut Saw\" and Elmore James' \"The Sky Is Crying.\" Harmonica legend James Cotton joins him on rousing renditions of \"Ain't Doin' Too Bad\" and \"Five Long Years,\" then Lee goes toe-to-toe with guest guitarists Kenny Wayne Shepherd and Frank Marino. Originally released on CD in 1997. Released for Record Store Day on double 180g vinyl for the first time."
              },
              {
              "Artist": "Hamilton Leithauser + Rostam",
              "Album": "Live at KCRW Morning Becomes Eclectic",
              "Format": "12\" Vinyl",
              "Label": "Glassnote",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060520:284",
              "More Info": "Recorded 10/26/16 at KCRW for Morning Becomes Eclectic"
              },
              {
              "Artist": "The Lumineers",
              "Album": "Song Seeds",
              "Format": "10\" Vinyl",
              "Label": "Dualtone",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059906:284",
              "More Info": "Since the release of Cleopatra in April 2016, The Lumineers have been going non-stop. They embarked on a world tour soon after the album came out, city after city, to increasingly larger and more packed venues. They're making their presence known in arenas now, including two sold-out shows at Madison Square Garden and will be gracing stadiums this summer opening for U2. During this crazy time, though, the band tries to keep level heads: they try to remember where they are coming from, and at the root of it, what the songs are really saying. Thus, Song Seeds was born. This Record Store Day exclusive 10\" includes three versions of two tracks from Cleopatra, each recorded at a different point in the song's life. There's the \"seed\", which is the early demo version, the album cut and a live version pulled from of the shows on the tour. This particular record features seeds of \"Angela\" and \"Long Way From Home\" and it's a great piece for anyone who loves the band and wants to feel a part of their creative process."
              },
              {
              "Artist": "Luna",
              "Album": "Penthouse Deluxe",
              "Format": "2 x LP",
              "Label": "Elektra Catalog Group",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059879:284",
              "More Info": "Legendary band's most revered album and one that was listed in Rolling Stone's list of Best Albums of the 1990s. After reforming in 2015, the band have toured extensively in the US, while being written about everywhere from the NY Times, Salon and The Washington Post to the New Yorker and Pitchfork. The band hae played a number of \"Penthouse\" complete shows, and plan to do more in 2017. The original album has been specially remastered for vinyl by Scott Hull at Masterdisk and expanded with a second disc of unreleased tracks, rare b-sides and demos, including covers of Wire's \"Outdoor Miner\", Serge Gainsbourg's \"Bonne & Clyde\" (featuring Laetitia Sadier of Stereolab) and Talking Heads' \"Thank You For Sending Me An Angel\" most of which appearing on LP for the first time. Features five previously unreleased tracks, including an extended version of the classic \"23 Minutes in Brussels\"."
              },
              {
              "Artist": "Anni-Frid Lyngstad",
              "Album": "Frida",
              "Format": "LP",
              "Label": "Parlophone",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060699:284",
              "More Info": "Produced by her then-fiance and member of ABBA - Benny Andersson, Frida was released in 1971, the album received unanimously generous praise from the critics and the press, who especially noted the precision and versatility of Lyngstad's voice. The album is sung entirely in Swedish and contains translated covers of international hits such as Leonard Cohen's \"Suzanne\", Simon & Garfunkels \"The Sound of Silence\" and \"Everything's Alright\" from Jesus Christ Superstar."
              },
              {
              "Artist": "M.D.C.",
              "Album": "Magnus Dominus Corpus",
              "Format": "LP",
              "Label": "Beer City Skateboards and Record",
              "Quantity": 1100,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060876:284",
              "More Info": "For the first time on vinyl since it originally came out in 2004  Beer City Skateboards and Records is proud to bring you the political hardcore punk legends M.D.C.\"s eighth full length; M.D.C.- Magnus Dominus Corpus! (The title is a Latin term taken from the returning Crusaders of the 13th century to term the intense hatred between the clashing Islamic and Christian cultures.)This contains the original full length restored and remastered for a louder, better sound then ever before. To top it all off only 1100 of these will be pressed for RSD 2017."
              },
              {
              "Artist": "Madonna",
              "Album": "Dance Mix",
              "Format": "12\" Vinyl",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 4500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059858:284",
              "More Info": "Dance Mix is a 1985 four track EP originally released only in South America. The rare 12\" features Madonna's ground-breaking hit \"Into The Groove\" from the 1985 film Desperately Seeking Susan in which Madonna starred, an extended dance mix of 1984 single \"Angel\" produced by Nile Rodgers and mixed by Nile Rodgers and James Farber, a 12\" \"Chica Material (Material Girl)\" remix by John \"Jellybean\" Benitez and produced by Nile Rodgers and \"Vacacion\" (Holiday) produced by John \"Jellybean\" Benitez. Dance Mix is being released for the first time worldwide for Record Store Day 2017."
              },
              {
              "Artist": "The Magpie Salute",
              "Album": "\"Comin' Home\"/\"Glad and Sorry\"",
              "Format": "10\" Vinyl",
              "Label": "Eagle Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060539:284",
              "More Info": "Record Store Day exclusive limited edition black and white marble 10\" of covers Comin' Home (Delaney & Bonnie) & Glad and Sorry (Faces). The Magpie Salute's Rich Robinson is a founding member of the band The Black Crowes who have sold over 30 million albums."
              },
              {
              "Artist": "Marcy Playground",
              "Album": "Marcy Playground",
              "Format": "LP",
              "Label": "Slow Down Sounds",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059953:284",
              "More Info": "Celebrating the 20th anniversary of their self-titled album, this Record Store Day 2017 release includes a bonus 7\" with two unreleased cover songs. Marcy Playground has never before been released on vinyl."
              },
              {
              "Artist": "Gil Melle",
              "Album": "The Andromeda Strain OST",
              "Format": "LP",
              "Label": "Jackpot Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059952:284",
              "More Info": "One of most sought-after and expensive soundtracks, with one of the most elaborate packages in history.  Features silver foil hexagon cover that folds open, with a hexagon shaped record.   This is the first all-electronic soundtracks released in US, and has never been reissued here. The packaging recreates the original, and the original master tapes were used."
              },
              {
              "Artist": "moe.",
              "Album": "Live From San Francisco",
              "Format": "2 x LP",
              "Label": "Brookvale Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060014:284",
              "More Info": "moe. is the preeminent progressive rock band on the music scene today - a quintet of world class musicians, whose creative output equals that of their longevity. In a remarkable career that has touched three decades and produced a discography of 24 albums, moe. continues to push the standard for performance art higher and further. For their first ever Record Store Day release, the band presents a spectacular new double live album culled from an epic 2016 performance at the historic Fillmore in San Francisco.  \"Live From San Francisco\" has been mastered specifically for vinyl and is a very limited pressing of 1500 copies on beautiful red vinyl with black splatter. The Tip-On gatefold packaging includes a deluxe soft touch coating with spot UV treatment and sequential gold foil stamping. Also included is a beautiful 4-page color photo booklet featuring a selection of photographs from this memorable performance."
              },
              {
              "Artist": "Meredith Monk",
              "Album": "Key",
              "Format": "LP",
              "Label": "Tompkins Square",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458063583:284",
              "More Info": "Composer, singer, director/choreographer, creator of new opera, musical theater works, films and installations, Meredith Monk is one of the most unique and influential artists of our time. She was awarded a National Medal of Arts by President Obama in 2015. Key is her groundbreaking debut album from 1971 and this is the first reissue on vinyl since 1978. Includes original art from the 1971 release. Standard weight, black vinyl."
              },
              {
              "Artist": "Thelonious Monk",
              "Album": "Les Liaisons Dangereuses 1960",
              "Format": "2 x LP",
              "Label": "Sam Records / Saga",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458063813:284",
              "More Info": "The only soundtrack recorded by Thelonious Monk in 1959, to be released for the first time as a 2LP box set! Contains performances of classic Monk tunes heard in Roger Vadim's 1960 French film Les Liaisons Dangereuses. Features Monk\"s 1959 all-star band of Charlie Rouse, Sam Jones & Art Taylor, special guest saxophonist Barney Wilen. Contains a 50 pg booklet with texts, discography, never before seen photographs and memorabilia from the recording session and original artwork. 180g, black vinyl."
              },
              {
              "Artist": "Wes Montgomery & The Wynton Kelly Trio",
              "Album": "Smokin In Seattle: Live at The Penthouse (1966)",
              "Format": "LP",
              "Label": "Resonance Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060079:284",
              "More Info": "Smokin' in Seattle: Live at the Penthouse (1966) presents previously unreleased live sets by jazz guitar icon Wes Montgomery with pianist Wynton Kelly and his trio captured live at the Penthouse in Seattle, WA on April 14 and 21, 1966. The dynamic duo was joined by the solid rhythm section of bassist Ron McClure and legendary drummer Jimmy Cobb. The limited edition deluxe LP includes extensive liner note books featuring rare photos, essays, and interviews. 180g black vinyl."
              },
              {
              "Artist": "Kevin Morby",
              "Album": "Beautiful Strangers",
              "Format": "7\" Vinyl",
              "Label": "Dead Oceans",
              "Quantity": 1100,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061063:284",
              "More Info": "This release is dedicated to and written for all the people I have never met but have only read about. The innocent people who were out living their lives and one day, without warning, had them taken away from them. People who liked to laugh, dance, and love in the way that we all do, but can't anymore. All those names and faces, all those beautiful strangers... So here are two songs, \"Beautiful Strangers\" as well as my cover of Townes Van Zandt's \"No Place To Fall\" that I have been closing my live show with over the past year. Any purchase of these two songs will go to support the work of Everytown For Gun Safety - an organization I have followed for quite some time. I believe in and support them in their efforts to make the world a safer place. Do it for the kids. Love and peace, Kevin Morby"
              },
              {
              "Artist": "Motorhead",
              "Album": "Clean Your Clock",
              "Format": "2 x LP Picture Disc",
              "Label": "UDR",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059919:284",
              "More Info": "Motorhead, Kings of the Road for more than forty years, are immortalized one more time in Clean Your Clock, the superb live album recorded at the Zenith in Munich, Germany during the Winter 2015 Bad Magic Tour. The indomitable cocktail of power, purpose and head-crunching volume that Lemmy Kilmister, Phil Campbell and Mikkey Dee always succeeded in producing is captured superbly by long-time producer Cameron Webb's mix,giving this landmark Motorhead release the warmth, curve and punch which helped the band achieve international acclaim during a career which saw the Grammy-winning icons sell over 15 million albums and play to millions worldwide."
              },
              {
              "Artist": "Mungo Jerry",
              "Album": "\"In The Summertime\"/\"Baby Jump\"",
              "Format": "N/A",
              "Label": "BMG",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059792:284",
              "More Info": "In The Summertime is the debut single by British rock band Mungo Jerry. Written and composed by its lead singer, Ray Dorset, it celebrates the carefree days of summer in 1970 and reached #1 on 19 charts around the world. It's one of the best-selling singles of all time. The B-side, \"Baby Jump\" hit #1 on the UK Singles chart in 1971."
              },
              {
              "Artist": "The Music Machine",
              "Album": "(Turn On) The Music Machine",
              "Format": "12\" Vinyl",
              "Label": "Concord Bicycle",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060526:284",
              "More Info": "Reissue of rare MONO edition of the garage rock classic from 1966 pressed on 180-gram vinyl."
              },
              {
              "Artist": "Stevie Nicks",
              "Album": "Rarities",
              "Format": "10\" Vinyl",
              "Label": "Atlantic Catalog Group",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059871:284",
              "More Info": "This Record Store Day release is a 10\" featuring rare demos, live and early takes from Bella Donna and Wild Heart deluxe editions. Includes two key Stevie Nicks soundtrack cuts: \"Blue Lamp\" (from the Heavy Metal soundtrack) and \"Sleeping Angel\" (from the Fast Times at Ridgemont High soundtrack)."
              },
              {
              "Artist": "Nico & The Faction",
              "Album": "The Last Sessions",
              "Format": "2 x LP",
              "Label": "Tidal Waves Music",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060432:284",
              "More Info": "Tidal Waves Music presents exclusively for Record Store Day 2017: NICO & THE FACTION \"THE LAST SESSIONS\" NICO needs little introduction \" she was a singer-songwriter, composer, model (for \"Vogue\", \"Elle\" & \"Coco Channel\"), actress (she starred in Federico Fellini's masterpiece \"La Dolce Vita\") and Andy Warhol superstar in the 1960s.Collaborations were numerous and the most famous ones include those with BRIAN JONES, VELVET UNDERGROUND, SERGE GAINSBOURG, BRIAN ENO, BOB DYLAN and MARC ALMOND. The experimental and dismal sound of her albums is considered the forerunner of the later \"gothic\" sound. Nico was admired, cited as a major influence and paid tribute to by many musicians such as Siouxsie & the Banshees, Bauhaus, Patti Smith, Morrissey, Bj_rk, Leonard Cohen, Henry Rollins and Marianne Faithfull. This album documents Nico\"s last ever performance held on June 6, 1988 in West Berlin as part of the European Capital of Culture festival that year. Except for the album's closing song (which was previously released on The End...), Nico and her backing band \"The Faction\" composed all the pieces specifically for the show. As the title of the album indicates, the concert was Nico's last, and the material on the album is among the last she (co-)wrote. Six weeks later, on July 18, she died while on vacation in Ibiza. This is a stunning album. The last stand of an exceptional artist, shortly before her untimely tragic death, who lived an exceptional life overshadowed by a 15 year struggle with heroin addiction. Originally released on CD in 1994, this is the first time the soundtrack gets a vinyl release outside of Europe. Now available as a gorgeously packaged deluxe DOUBLE vinyl edition, exclusively for Record Store Day 2017. Strictly limited to 1500 copies, this release also comes with an insert featuring extensive liner notes & background information."
              },
              {
              "Artist": "The Notorious B.I.G.",
              "Album": "Born Again",
              "Format": "2 x LP",
              "Label": "Bad Boy Records",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059826:284",
              "More Info": "Born Again was originally released December 7, 1999 and has been out of print since the early 2000s. It debuted at #1 on the Billboard 200 charts and solve over 485k albums in the first week of release. Guest artists include Busta Rhymes, Redman and Method Man, Missy Elliott, Ice Cube, and Snoop Dogg. Its reissue on double gold vinyl for Record Store Day 2017 is part of the commemoration of the twentieth anniversary of the death of the Notorious B.I.G."
              },
              {
              "Artist": "Nuclear Valdez",
              "Album": "Present From The Past",
              "Format": "LP",
              "Label": "AEC Imports/Sinical",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059974:284",
              "More Info": "More than 20 years since our first album was released, we are frequently flattered by fans expressing how much our music meant to them. We are often asked if we have a new album in the works. So far, the answer has been no. But for a while now, we\"ve been thinking of issuing an album of unreleased songs for our fans around the world. With the encouragement of a few close friends, the idea grew and soon we were rummaging through our old tape archives.  So, what you have here is not an album of new songs, but a collection of old songs from the time of our previous albums. Songs that never went beyond the demo stage. We hope and hope and hope that you will enjoy them in all their low-hi-fi glory. --Nuclear Valdez"
              },
              {
              "Artist": "The Offspring",
              "Album": "The Offspring",
              "Format": "12\" Vinyl",
              "Label": "Nitro",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060540:284",
              "More Info": "Reissue of the band's debut album on blue transparent vinyl."
              },
              {
              "Artist": "Old 97's",
              "Album": "\"Terlingua\"/\"Off My Mynd\"",
              "Format": "12\" Vinyl",
              "Label": "ATO Records",
              "Quantity": 2530,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060575:284",
              "More Info": "Unreleased exclusive b-sides taken from forthcoming album sessions, on opaque white wax with etched b-side."
              },
              {
              "Artist": "Jimmy Page & The Black Crowes",
              "Album": "Live at Jones Beach",
              "Format": "10\" Vinyl",
              "Label": "The Orchard",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060875:284",
              "More Info": "Live recordings from the legendary Jones Beach Concert on marbled black and white vinyl."
              },
              {
              "Artist": "Dolly Parton",
              "Album": "Puppy Love",
              "Format": "7\" Vinyl",
              "Label": "Yep Roc Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061079:284",
              "More Info": "This is one of the earliest recordings to be released by Dolly Parton.  Originally released  in 1959 by Gold Band Recordings. Yep Roc Records, in conjunction with Southern Folklife, is proud to re-release this 45 in packaging that is as true to the original as we could make it.  The B-side features \"Girl Left Alone,\" written by Parton, her Aunt Dorothy Jo Owens, and her Uncle Bill Owens.  This is limited edition of 2500 worldwide."
              },
              {
              "Artist": "Jaco Pastorious",
              "Album": "Truth, Liberty & Soul - Live in NYC: The Complete 1982 NPR Jazz Alive! Recording",
              "Format": "3 x LP",
              "Label": "Resonance Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060073:284",
              "More Info": "This release captures the iconic bass innovator Jaco Pastorius leading a 22-piece big band on June 27, 1982 at Avery Fisher Hall in NYC. Featuring a congregation of the top jazz musicians such as Randy Brecker, Jon Faddis, Bob Mintzer, Frank Wess, Lew Soloff, Howard Johnson and Peter Erskine, along with special guest, Toots Thielemans, Truth, Liberty & Soul-Live in NYC showcases Jaco\"\"\"s brilliant compositions for large ensembles with the electrifying energy of a live performance. 180g black vinyl"
              },
              {
              "Artist": "Mike Peters & The Alarm",
              "Album": "Man In The Camo Jacket Motion Picture Soundtrack",
              "Format": "LP",
              "Label": "J-2 Music",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060700:284",
              "More Info": "RSD exclusive vinyl soundtrack to the documentary film \"Man in the Camo Jacket\". The inspirational film follows Alarm singer Mike Peters' journey from starting the band to his fight with cancer and the founding of the Love, Hope, Strength Foundation - Saving Lives One Concert At A Time. Features brand new and unreleased Alarm studio and live tracks. Semi-transparent brown vinyl with download card and a poster."
              },
              {
              "Artist": "Pink Floyd",
              "Album": "Interstellar Overdrive",
              "Format": "12\" Vinyl",
              "Label": "Sony Legacy",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060054:284",
              "More Info": "A previously unreleased 14:57 minute recording from 1966, released in mono at 33 1/3 for Record Store Day."
              },
              {
              "Artist": "Iggy Pop",
              "Album": "Post Pop Depression: Live At The Royal Albert Hall",
              "Format": "3 x LP",
              "Label": "Loma Vista Recordings",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060521:284",
              "More Info": "Individually numbered, four sleeve, book-style gatefold release with 16 page book stuffed full of exclusive photos."
              },
              {
              "Artist": "Prince",
              "Album": "\"Little Red Corvette\"/\"1999\"",
              "Format": "7\" Picture Disc",
              "Label": "Warner Bros.",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059795:284",
              "More Info": "Reissue of a 1983 picture disc, out of print since 1985"
              },
              {
              "Artist": "Procol Harum",
              "Album": "Shine On Brightly",
              "Format": "LP",
              "Label": "Varese",
              "Quantity": 2200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060530:284",
              "More Info": "Shine On Brightly, the 1968 second studio album by Procol Harum, saw the band delve deeper into progressive rock stylings. The masterpiece of the album is the epic 18 minute long composition, \"In Held Twas In I.\" This is the first time in over 30 years that the original album with the American artwork is available on vinyl."
              },
              {
              "Artist": "Ra Ra Riot",
              "Album": "Ra Ra Riot",
              "Format": "12\" Vinyl",
              "Label": "Ra Ra Riot, LLC",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061075:284",
              "More Info": "In celebration of the 10th anniversary of its release, Ra Ra Riot's critically acclaimed debut EP is being issued on vinyl for the very first time. This Record Store Day exclusive vinyl is a limited edition of 1,500 units worldwide and each is individually numbered. The music has been remastered specifically for this release and the updated artwork includes a printed inner sleeve."
              },
              {
              "Artist": "Ramones",
              "Album": "76-'79 Singles Box",
              "Format": "Box Set",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059796:284",
              "More Info": "A box of pre-1980 US 7\" singles by the Ramones, authentically reproduced with Sire labels, picture covers where applicable and a selection of great punk rock tracks that changed the course of rock 'n' roll. All packaged in a unique cigarette-style outer box, with an insert and individually foil-stamped numbered global edition of 6500. Wall-to-wall Ramones classics including \"Blitzkrieg Bop\", \"Sheena Is A Punk Rocker\", \"Swallow My Pride\", \"Rock 'N' Roll High School\" and a special mono/stereo promo edition of \"I Wanna Be Sedated\", all presented the way punk rock should be--as 45 RPM slabs of wax."
              },
              {
              "Artist": "Red Hot Chili Peppers",
              "Album": "Go Robot",
              "Format": "12\" Picture Disc",
              "Label": "Warner Bros.",
              "Quantity": 4750,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059840:284",
              "More Info": "Picture disc containing two unreleased live RHCP tracks, \"Go Robot\", recorded live at in Paris, France at AccorHotels Arena in 2016 and \"Dreams of a Samurai\" recorded live in Madrid, Spain at Barclaycard Center in 2016."
              },
              {
              "Artist": "Lou Reed",
              "Album": "Perfect Night: Live in London",
              "Format": "2 x LP",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059869:284",
              "More Info": "Perfect Night: Live in London is an acoustic live album recorded during the Meltdown '97 festival. It Includes a version of the Velvet Underground's \"I'll Be Your Mirror\", originally sung by Nico. This Record Store Day release is the first time this album will be available on vinyl."
              },
              {
              "Artist": "Run The Jewels",
              "Album": "RTJ RSD Record Tote Bag",
              "Format": "Tote Bag",
              "Label": "Run The Jewels INC",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060002:284",
              "More Info": "Royal Blue recycled cotton canvas tote - gold foil Run The Jewels logo on one side and 5 color screen print on the other side with 2 attached enamel hand pins polybagged."
              },
              {
              "Artist": "Santana",
              "Album": "Live at The Woodstock Music & Arts Fair, August 16, 1969",
              "Format": "LP",
              "Label": "Sony Legacy",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060043:284",
              "More Info": "When Santana took the stage at the Woodstock Music & Art Fair on August 16, 1969, they were unknown outside of the thriving Bay Area music scene. By the time they triumphantly walked off the stage, they were one of the festival\"s biggest surprises. Santana delivered a career-making performance melding Latin rock and bruising blues that set the stage for their platinum-selling debut album, released weeks later. Now, Santana Live At The Woodstock Music & Art Fair, August 16, 1969 takes listeners back to that show-stopping set, pressed on vinyl for the first time."
              },
              {
              "Artist": "Tegan and Sara",
              "Album": "Under Feet Like Ours",
              "Format": "LP",
              "Label": "Warner Bros.",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059835:284",
              "More Info": "The first, self-released, album from the duo that became Tegan and Sara, released for the first time on vinyl for Record Store Day 2017."
              },
              {
              "Artist": "Saxon",
              "Album": "Into The Labyrinth",
              "Format": "12\" Picture Disc",
              "Label": "AEC Imports/Demon",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059973:284",
              "More Info": "Released in 2009, Into The Labyrinth features the classics \"Valley Of The Kings\" and \"Come Rock Of Ages\". Issued as a beautiful picture disc for Record Store Day 2017, the A-side features the original cover paining by Saxon\"s artist-in-residence Paul Gregory and the B-side features a painting by Kai Swillus."
              },
              {
              "Artist": "Peter Schilling",
              "Album": "Major Tom",
              "Format": "7\" Picture Disc",
              "Label": "Elektra Catalog Group",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059870:284",
              "More Info": "The title track of the hugely successful German TV series Deutschland 83. Includes the German and English versions on a fantastic 7\" picture disc."
              },
              {
              "Artist": "John Scoggins",
              "Album": "Pressed For Time",
              "Format": "LP",
              "Label": "Rhino Records",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059913:284",
              "More Info": "John Scoggins\"\"\" solo LP Pressed for Time is regarded amongst record collectors of obscure \"\"\"70\"\"\"s rock and McCartney/Rhodes style proto-power pop as one of the great undiscovered gems, whose quality matches its scarcity. Original copies fetch hundreds of dollars, pricing this charming LP outside the reaches of the casual listener. A heartfelt, sunny, cult classic that everyone can now appreciate."
              },
              {
              "Artist": "The Sex Pistols",
              "Album": "Anarchy In The UK --The UK & US Singles",
              "Format": "5 x 7\" Vinyl Box",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059805:284",
              "More Info": "Four original UK 7\"s and one US 7\" presented in replicas of the original 1977 sleeves, housed in a singles box. Includes \"Anarchy In the UK\", \"God Save The Queen\", \"Pretty Vacant (UK version)\", \"Pretty Vacant (US version)\", and \"Holidays in the Sun\"."
              },
              {
              "Artist": "Paul Shaffer & The World's Most Dangerous Band",
              "Album": "Happy Street (featuring Bill Murray)",
              "Format": "7\" Vinyl",
              "Label": "Rhino Records",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059862:284",
              "More Info": "Paul Shaffer & The World's Most Dangerous Band team up with long-time friend Bill Murray for the 7\" single. Murray and Shaffer have a long history--Shaffer played piano for Murray's popular Saturday Night Live character Nick The Lounge Singer, and last year served as MC for the actor's Netflix special A Very Murray Christmas, for which Murray received his fourth Emmy nomination."
              },
              {
              "Artist": "The Shelters",
              "Album": "The Shelters Really Wanted You",
              "Format": "7\" Vinyl",
              "Label": "Warner Bros.",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059843:284",
              "More Info": "A special 7\" Record Store Day single with two cover songs: \"Really Wanted You\", originally written and performed by Emmit Rhodes and \"So Get Out\", originally performed by The Surfaris."
              },
              {
              "Artist": "Shocking Blue",
              "Album": "At Home",
              "Format": "LP",
              "Label": "Music on Vinyl",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060754:284",
              "More Info": "Shocking Blue was a Dutch rockband from The Hague that was at their peak in the 60s and 70s and gained major cross-Atlantic success. The band was founded in 1967 and after recruiting vocalist Mariska Veres they soon became huge. With their single \"Venus\" they became the first Dutch band ever to reach the first spot on the American Billboard Hot 100. The band had a series of subsequent hits but decided to call it a day in 1975. Their influence reached well beyond their generation: even bands like Nirvana and The Prodigy used Shocking Blue's \"Love Buzz\". At Home contains both \"Venus\" as well as \"Love Buzz\". Furthermore this legendary album features 4 bonus tracks that were previously available as b-sides on various long out of print 45s. In celebration of Record Store Day 2017, the album is pressed on coloured vinyl for the first time ever. The worldwide imited edition of 2500 individually numbered copies is pressed on \"Shocking Blue\" coloured vinyl."
              },
              {
              "Artist": "Sia",
              "Album": "Spotify Sessions",
              "Format": "12\" Vinyl",
              "Label": "RCA",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060041:284",
              "More Info": "Exclusive vinyl release of Sia's live Spotify Sessions."
              },
              {
              "Artist": "John Sinclair",
              "Album": "Mobile Homeland",
              "Format": "LP",
              "Label": "Jett Plastic Recordings",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060748:284",
              "More Info": "Iconic Poet/Activist John Sinclair, former manager and spiritual adviser to the legendary MC5, has a lot to say on his very first full length vinyl album. Featuring an absolutely stellar all-star cast of Detroit musicians and produced by Tino Gross, this album features Wayne Kramer (MC5), Mary Cobra (Detroit Cobras), Jimmie Bones (Kid Rock), Johnnie Bassett (Legendary Detroit Bluesman), Harmonica Shah, Jeff Grand, Dave McMurray, Johnny \"Bee\" Badanjek (Mitch Ryder, Alice Cooper) and Kenny Olson (Kid Rock), among others. This is hopefully the first volume of 'Mobile Homeland,' with more volumes planned in the near future. John Sinclair's unique brand of poetry comes across fabulously on this album, and we're beyond proud to share this with the world on Record Store Day 2017. 600 red/600 white vinyl pieces shipped randomly."
              },
              {
              "Artist": "Slick Rick",
              "Album": "The Great Adventures Of\"",
              "Format": "Book",
              "Label": "Get On Down",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059983:284",
              "More Info": "Get On Down, known for its unique approach to packaging hip-hop classics, has come up with another winner here, presenting the lyrics to this immortal rap tale in never-before-seen form. Rick\"s lines from the song are re-created in visual form in a 16 page book with a puffy cover _ presented like a legit children\"s book, thick pages and all. From the little boy who was misled to the tense police chase, to the unsure children hearing the story from their \"Uncle Ricky,\" this is the most unique way the story has ever been presented. Of course there is music to match _ for Record Store Day the exclusive package includes a picture sleeve 45 with \"Children\"s Story\" and \"The Moment I Feared\" (with artwork taken from the original \"Children\"s Story\" 12-inch), and a CD of The Great Adventures of Slick Rick, the 1988 Def Jam album that made Rick a worldwide star."
              },
              {
              "Artist": "Patti Smith",
              "Album": "Hey Joe",
              "Format": "7\" Vinyl",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 2250,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059864:284",
              "More Info": "Patti Smith's debut single, \"Hey Joe\" was released in 1974. Her version of this well-known and multiple times covered American popular song is based on the recording by blues guitarist Roy Buchanan, but obviously Smith's rendition is unique and includes also a salacious and brief monologue as well as featuring Tom Verlaine from Television on guitar. The B-side \"Piss Factory\" was an original composition that placed on the 1989 \"1001 Greatest Singles Ever Made\" list. \"Hey Joe\" was reissued in the UK in 2012 as part of a Sire series, but this is the first time since the 1970s that the original picture sleeve has been reproduced."
              },
              {
              "Artist": "The Smiths",
              "Album": "The Boy With The Thorn In His Side",
              "Format": "7\" Vinyl",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059861:284",
              "More Info": "A 7\" single featuring previously unreleased versions of \"The Boy With The Thorn In His Side\" and \"Rubber Ring\". Includes new artwork featuring Salford actor Albert Finney."
              },
              {
              "Artist": "Snapcase",
              "Album": "Lookinglassself",
              "Format": "LP",
              "Label": "Victory Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060012:284",
              "More Info": "Out of print on vinyl for more than a decade, released on blue vinyl for Record Store Day 2017"
              },
              {
              "Artist": "Soul Assassins",
              "Album": "\"Mugg Presents\" The Soul Assassins Chapter 1",
              "Format": "12\" Picture Disc",
              "Label": "Sony Legacy",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060047:284",
              "More Info": "On The Soul Assassins Chapter 1, producer DJ Muggs assembled a hard-hitting album that combined a murderer\"s row of hip-hop icons with Muggs\" laid-back, West Coast beats. With verses from Cypress Hill, Dr. Dre, RZA, GZA, Goodie Mob, KRS-One, Mobb Deep, Wyclef Jean and more, The Soul Assassins Chapter 1 is a one of a kind hip-hop touchstone. It\"s being reissued for its 20th anniversary as a 12\" picture disc featuring the original album\"s striking cover illustration and logo."
              },
              {
              "Artist": "Spoon",
              "Album": "Hot Thoughts (Record Store Day)",
              "Format": "12\" Vinyl",
              "Label": "Matador",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059892:284",
              "More Info": "This Record Store Day, Spoon will release the 12\" single \"Hot Thoughts\" including two otherwise unavailable tracks: \"Hot Thoughts (Dave Sitek Remix) and Spoon's cover of Elvis Presley's \"Love Letters\"."
              },
              {
              "Artist": "Sting",
              "Album": "Sting Live At The Bataclan",
              "Format": "12\" Vinyl",
              "Label": "Interscope",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060534:284",
              "More Info": "Live From The Bataclan is a limited edition release of songs, both new and old, taken from Sting's historic concert on November 12, 2016 at the Bataclan theatre in paris. Sting's performance that night commemorated the one year anniversary of the tragic terrorist attack at the iconic venue and re-opened the doors in honor of the victims and in celebration of their memory and the enduring power of music."
              },
              {
              "Artist": "Sublime With Rome",
              "Album": "Unreleased Demos 2017",
              "Format": "12\" Vinyl",
              "Label": "5 Music",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060009:284",
              "More Info": "Exclusive taste of new music from Sublime with Rome. 1500 hand stamped/hand numbered multi-color vinyl 12\"s. inch multi colored vinyl with white label."
              },
              {
              "Artist": "Sun Ra",
              "Album": "Janus",
              "Format": "LP",
              "Label": "ORG Music",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059916:284",
              "More Info": "Janus is a compilation of rare material from the Sun Ra Arkestra, drawing from tapes recorded between 1963 and 1970, taken from both live and studio performances. The space-age jazz shaman conjures up a variety of styles and moods along the way. The album is finally making its vinyl debut with this limited edition, psychedelic swirl color vinyl for Record Store Day 2017. The tracks have been remastered, and pressed on audiophile-grade yellow/black swirl vinyl at Pallas in Germany."
              },
              {
              "Artist": "The Sundays",
              "Album": "Blind - 25th Anniversary Edition",
              "Format": "LP",
              "Label": "FUGITIVE",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060013:284",
              "More Info": "Blind is The Sunday's best selling album in the US, and this Record Store Day 2017 release, commemorating years since its original 1992 releae is the first time it has ever been released in the United States on vinyl."
              },
              {
              "Artist": "Sunny Day Real Estate",
              "Album": "The Rising Tide",
              "Format": "2 x LP",
              "Label": "Concord Bicycle",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060536:284",
              "More Info": "Reissue of the band's 2000 album on double colored vinyl."
              },
              {
              "Artist": "Super Furry Animals",
              "Album": "Fuzzy Logic",
              "Format": "LP",
              "Label": "Everloving Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061073:284",
              "More Info": "Super Furry Animals landmark debut1996 album has been remastered and reissued on 180g vinyl. With digital download card that offers previously unreleased bonus tracks, including remastered b-sides, previously unreleased demo versions and the Live at The Phoenix Festival 1996 gig."
              },
              {
              "Artist": "Superchunk",
              "Album": "Cup of Sand",
              "Format": "3 x LP",
              "Label": "Merge Records",
              "Quantity": 1000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059896:284",
              "More Info": "On Record Store Day, Superchunk will release Cup of Sand, their 2003 singles and rarities compilation on vinyl for the first time. The original CD packaging has been expanded for this edition to showcase Laura Balance's original paintings, and features expanded conversations with Mac, Jon, Jim and Laura about every track included--the ones they remember recording, anyway. The notes have been expanded to comprise the three additonal songs from out-of-print compilations which have been added to this remastered reissue. The limited edition packaging will be available exclusively to independent record stores."
              },
              {
              "Artist": "Suuns",
              "Album": "Hold/Still Remix",
              "Format": "2 x LP",
              "Label": "Secretly Canadian",
              "Quantity": 1150,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060772:284",
              "More Info": "Almost a year to the day from the release of Suuns' most-far reaching and creative record Hold/Still comes an album of remixes. Spanning an incredibly diverse range of artists and sounds, each one of these remixes takes the original track and twists and turns it into some very unique. The source material leant itself perfectly to a remix project - these are songs that are complex, layered, experimental. The remixes vary from the dancefloor fillers from the likes of Redshape or Marvin & Guy through to the ambience of Lee Gamble and Beatrice Dillon and the techno of VRIL, and shows Suuns as one of the most forward thinking and fertile bands around. Time to go and get lost. Comes as a double, colored, limited vinyl."
              },
              {
              "Artist": "The Sword",
              "Album": "Low Country",
              "Format": "LP",
              "Label": "Razor & Tie",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060541:284",
              "More Info": "The Sword album Low Country on colored vinyl, includes an exclusive poster."
              },
              {
              "Artist": "Talking Heads/Wildling",
              "Album": "This Must Be The Place Side By Side",
              "Format": "7\" Vinyl",
              "Label": "Warner Bros.",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059857:284",
              "More Info": "Continuing in the now-classic Side By Side Series for Record Store Day 2017, this single features both Talking Heads and Wildling taking on \"This Must Be The Place\" on a black vinyl 7\"."
              },
              {
              "Artist": "Mike Taylor",
              "Album": "Feel Good",
              "Format": "12\" Picture Disc",
              "Label": "Rostrum Records",
              "Quantity": 1030,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060574:284",
              "More Info": "Picture disc of Mike Taylor's recent Feel Good EP featuring a solid white sleeve cover and all cover art elements turned into stickers so fans can design their own custom cover art."
              },
              {
              "Artist": "Teammate/Mike Taylor",
              "Album": "\"Electric Feel\"/\"Sweetness\"",
              "Format": "7\" Vinyl",
              "Label": "Rostrum Records",
              "Quantity": 1030,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060513:284",
              "More Info": "Split single with TeamMate's cover of Jimmy Eat World's \"Sweetness\" and Mike Taylor's cover of MGMT's \"Electric Feel\" on black vinyl."
              },
              {
              "Artist": "Tegan And Sara/The Regrettes",
              "Album": "Back In Your Head Side By Side",
              "Format": "Single",
              "Label": "Warner Bros.",
              "Quantity": 2700,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059810:284",
              "More Info": "Continuing in the now-classic Side By Side Series for Record Store Day 2017, this single features both Tegan and Sara and The Regrettes taking on \"Back In Your Head\"."
              },
              {
              "Artist": "Thrice",
              "Album": "Sea Change",
              "Format": "7\" Vinyl",
              "Label": "Vagrant Records",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059894:284",
              "More Info": "This exclusive 7\" includes \"Sea Change,\" a b-side from the To Be Everywhere Is To Be Nowhere sessions and a live version of \"Black Honey\"."
              },
              {
              "Artist": "The Time",
              "Album": "What Time Is It?",
              "Format": "LP",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059865:284",
              "More Info": "Despite showing similarities with the debut album, The Time's second effort What Time Is It? offers three boasting, extended synth-funk jams (\"Wild and Loose\", \"777-9311\" and \"The Walk\") that are undoubtedly much better than those on the first album and an exceptional humorous ballad as well (\"Gigolos Get Lonely Too\"). The album was recorded at Sunset Sound and at Prince's Minneapolis home studio. What Time Is It? represents The Time's best developed album overall, much more fully developed than its predecessor, and it is particularly appreciated by fans of Prince's early works."
              },
              {
              "Artist": "Peter Tosh",
              "Album": "Legalize It!",
              "Format": "LP",
              "Label": "Brookvale Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060708:284",
              "More Info": "Peter Tosh's legendary album, reissued for Record Store Day in the colors of Jamaica: red, yellow, green striped vinyl, with SCRATCH AND SNIFF inner sleeve. Limited to 2000, Gold Foil Stamped and Numbered. Fully remastered and sounds INCREDIBLE for a colored vinyl release."
              },
              {
              "Artist": "TOTO",
              "Album": "Africa",
              "Format": "12\" Picture Disc",
              "Label": "Sony Legacy",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060048:284",
              "More Info": "Two of Toto\"s biggest hits\"the chart-topping \"Africa\" and Grammy Award-winning smash \"Rosanna\"\"return to vinyl on a special recreation of a limited edition, die-cut, Africa-shaped picture disc originally released in 1982, featuring a map of the continent on the A-side and an image of actress Rosanna Arquette, the inspiration for \"Rosanna,\" on the B-side. This is the first release in celebration of the 40th anniversary of Toto, one of the best-selling and most virtuosic rock bands of all time."
              },
              {
              "Artist": "John Trudell",
              "Album": "AKA Grafitti Man",
              "Format": "2 x LP",
              "Label": "Inside Recordings",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059801:284",
              "More Info": "Trudell's iconic 1992 album, lauded by Bob Dylan as the best album that year in Rolling Stone (Dylan and the Grateful Dean also played it during show intermissions on their 1992 summer tour). RSD would get an exclusive LP of the album, which would also contain bonus digital video about the Dakota Pipeline. 2xLP / 180g - translucent red vinyl. A portion of the label proceeds would go to the Standing Rock Sioux Tribe to help support the efforts against the Dakota Pipeline (Trudell, who passed away late last year, was a Dakota Native American)."
              },
              {
              "Artist": "The Turtles",
              "Album": "More Golden Hits",
              "Format": "LP",
              "Label": "Manifesto",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059982:284",
              "More Info": "A mono reissue on gold vinyl for the Turtles 1970 album."
              },
              {
              "Artist": "Two Door Cinema Club",
              "Album": "Live at KCRW Morning Becomes Eclectic",
              "Format": "12\" Vinyl",
              "Label": "Glassnote",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060542:284",
              "More Info": "Recorded 10/26/16 at KCRW for Morning Becomes Eclectic"
              },
              {
              "Artist": "U-Roy",
              "Album": "Dread In A Babylon",
              "Format": "LP",
              "Label": "Get On Down",
              "Quantity": 1000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059984:284",
              "More Info": "U-Roy was a true reggae pioneer, dubbed The Originator for good reason. Bursting onto the Jamaican scene in the earliest 1970s, he pioneered the vocal approach called \"toasting,\" which in addition to branching out Jamaican music into a new era, was also heavily influential on an American genre in its infancy: rapping. U-Roy\"s style and charisma are always on display, and _ as with all of his classic records _ the groove rules all. Presented for Record Store Day 2017 on black vinyl with a poster of the glorious, ganja-drenched cover art, it\"s the perfect chance to revisit one of the more underrated voices in Jamaican musical history."
              },
              {
              "Artist": "U2",
              "Album": "Red Hill Mining Town",
              "Format": "12\" Picture Disc",
              "Label": "Island Records",
              "Quantity": 7000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061148:284",
              "More Info": "To coincide with the 30th anniversary of U2\"s iconic album The Joshua Tree, Island Records will release a 2017 mix of \"Red Hill Mining Town\" on limited edition 12\" picture disc, featuring the classic photography of Anton Corbijn in colour. The previously unreleased mix is by Steve Lillywhite, who produced the band\"s critically acclaimed debut, \"Boy\". \"Red Hill Mining Town\" is famously \"the single that never was\", originally discussed as the second single from The Joshua Tree but then put to one side at the last minute in favour of \"I Still Haven\"t Found What I\"m Looking For\". The Joshua Tree went to #1 in the U.K, U.S., Ireland and around the world, selling in excess of 25 million albums, and catapulted Bono, The Edge, Adam Clayton and Larry Mullen Jr \"\" from heroes to superstars\" (Rolling Stone)."
              },
              {
              "Artist": "Various Artists",
              "Album": "The Rough Guide To Bollywood The Psychedelic Years",
              "Format": "LP",
              "Label": "World Music Network",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059909:284",
              "More Info": "In the 1960s and 1970s Bollywood composers adventurously adopted the trippy guitars, spiralling synthesizers and ethereal vocals of psychedelia and mixed it with lusciously over-the-top Indian orchestrations. Jewels featured include songs by Asha Bhosle, Lata Mangeshkar and Mohammed Rafi. This limited edition LP includes a download card giving you high quality mp3 versions of all the tracks from this record, as well as bonus Bollywood tracks."
              },
              {
              "Artist": "Various Artists",
              "Album": "Ciao! Manhattan Original Motion Picture Soundtrack",
              "Format": "LP",
              "Label": "Cinewax/Light In The Attic",
              "Quantity": 2700,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060429:284",
              "More Info": "* Official Record Store Day title * Limited to 3,000 copies on \"Angel Shock\" color wax * Never before released in any format * Audio restored and remastered from original film transfers * LP housed in a deluxe gatefold Stoughton tip-on jacket * Includes 20-page book with rare archive photos and liner notes Q&A with writer/director David Weisman Edie Sedgwick was the true \"It Girl\" of the Pop Art age; a woman who famously said she wanted \"to turn the world on just for a moment\". Part of Andy Warhol's Factory for a year in the mid-'60s, she is widely believed to have inspired The Velvet Underground's \"Femme Fatale\" as well as Bob Dylan's \"Leopard-Skin Pill-Box Hat\" and \"Just Like A Woman\". 1973's Ciao! Manhattan, the model and actor's final film, gave some indication of why she inspired such devotion. Written and directed by Factory affiliates John Palmer and David Weisman, the movie tells a quasi-fictionalised account _ a chronicle \" clef in Weisman's words _ of Sedgewick's journey from New York to Santa Barbara. In the film, Sedgwick is Susan Superstar, a New Yorker who winds up living in a drained Santa Barbara swimming pool in a narcotic daze, life and art just a hair away from each other. Shot over a five year period, Sedgwick died of a barbiturate overdose at the age of 28 before filming wrapped in 1971. For a movie starring some of rock's great muses, the soundtrack fittingly features cult figures of the era: Richie Havens (\"Shouldn't All The World Be Dancing\", \"To Give All Your Love Away\", \"I Can\"t Make It Anymore\"), John Phillips (\"Malibu People\") and Byrds/Flying Burrito Brothers member Skip Battin, who performs Kim Fowley's \"Citizen Kane\". Other artists are less well-known, including actor Kim Milford, who sings the stirring \"Justice\", and Factory man Gino Piserchio, an artist and dear friend of Weisman, whose synthesizer compositions anchor the score. Never before released in any format, this long-overdue pressing includes all of the above plus selected dialogue from the film, each snippet like a beat poem in its own way. The Village Voice once called Ciao! \"The Citizen Kane of the drug generation\"; deeply evocative of the era, the mood of the soundtrack captures the psychedelic spirit of the film, as well as the darkness and tragedy that characterized Edie's life."
              },
              {
              "Artist": "Various Artists",
              "Album": "The Rough Guide To Delta Blues",
              "Format": "LP",
              "Label": "World Music Network",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059908:284",
              "More Info": "The most influential of all the blues forms, Delta blues laid the foundations for what was to become rock and roll. Born in the punishing and poverty stricken environment of the Mississippi Delta, This Rough Guide traces its early origins with classic tracks by many delta legends as well as lesser known artists shrouded in mystery. Includes a digital download card which contains extra tracks."
              },
              {
              "Artist": "Various Artists",
              "Album": "Dogfish Head Presents: Music To Drink Beer To 3rd Edition",
              "Format": "LP",
              "Label": "Sony Legacy",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060051:284",
              "More Info": "Music To Drink Beer To 3rd Edition is the latest limited-edition compilation put together by longtime friends Sam Calagione of Dogfish Head and Adam Block of Sony Music\"s Legacy Recordings. Sam, who\"s in the beer business and a raging music geek, and Adam, who\"s in the music business and a raging beer geek, sat down over a few beers and a stash of well-worn vinyl and picked some of their favorite tracks from the Legacy catalog."
              },
              {
              "Artist": "Various Artists",
              "Album": "Dr. Who and the Pescatons/Sound Effects",
              "Format": "2 x LP",
              "Label": "AEC Imports/Demon",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059975:284",
              "More Info": "After the success of the Record Store Day 2016 exclusive, Genesis Of The Daleks, Demon Records is proud to present this vinyl reissue of the soundtrack for Doctor Who & The Pescatons on 180g Pescaton Green vinyl. As an added bonus the gatefold release also comes with Dr Who Sound Effects on Orange vinyl. With the original artwork for each release back to back this is a must for any Dr Who fan."
              },
              {
              "Artist": "Various Artists",
              "Album": "Fawlty Towers",
              "Format": "12\" Picture Disc",
              "Label": "AEC Imports/Demon",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059976:284",
              "More Info": "Created by John Cleese and Connie Booth, Fawlty Towers is a classic BBC programme from the 1970s. In 2000 the British Film Institute ranked it number 1 in the 100 Greatest British Television Programmes list. For Record Store Day 2017, Demon Records is proud to present this limited edition Fawlty Towers picture disc, featuring two of the most highly rated episodes ever: the classic \"Mrs Richards\" backed with \"Hotel Inspectors\"."
              },
              {
              "Artist": "Various Artists",
              "Album": "Giant Single: Profile Records Rap Anthology V1",
              "Format": "2 x LP",
              "Label": "Sony Legacy",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060049:284",
              "More Info": "While New York-based Profile Records was conceived as a home for disco when it was founded in 1979, the fledgling label caught on to the hip-hop movement as the 1980s dawned, releasing pioneering tracks by Dr. Jeckyll & Mr. Hyde, Rammelzee vs. K-Rob, Run-DMC, Dana Dane and more. Giant Single: The Profile Records Rap Anthology Vol. 1 spotlights the early influence of one of rap\"s true super-powered indie labels, with fifteen classic jams on double red vinyl!"
              },
              {
              "Artist": "Various Artists",
              "Album": "Girls In The Garage - Oriental Special - Volume 9",
              "Format": "LP",
              "Label": "Past & Present",
              "Quantity": 1400,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060723:284",
              "More Info": "With the eventual rise of bands such as Dara Puspita and an overall excitement and impatience to form a band, the Asian continent stirred with the sound of rock and roll thanks to the arrival of The Beatles and The Rolling Stones. Assisted by Rediffusion and various other British colonial networks, the sound and the fury were being absorbed by a new generation. Where else will you hear a Mandarin Nancy Sinatra chewing on \"Sugar Town\"? Or an indescribably baffling masterpiece of Chinese bubble-gum? Toss away your potential pop prejudice and absorb the hidden treasures of life in an esteemed selection of forgotten 45s from the Far East. Past and Present present an Oriental twist on pop with professionally re-mastered original audio. Limited edition, 180 gram colored vinyl; Hand-numbered sleeve; Includes insert with expanded liners, and a plethora of rare archival photos."
              },
              {
              "Artist": "Various Artists",
              "Album": "How Far I'll Go (From Moana)",
              "Format": "10\" Picture Disc",
              "Label": "Walt Disney Records",
              "Quantity": 3000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060524:284",
              "More Info": "From Walt Disney Animation Studios comes \"Moana,\" an animated adventure about a spirited teenager who sails out on a daring mission to prove herself a master wayfinder and fulfill her ancestors\" unfinished quest. Including two key moments from the film, \"How Far I\"ll Go\" Moana\"s key anthem performed by Auli`i Cravalho, and the demi-god Maui's \"You\"re Welcome\" performed by Dwayne Johnson, this RSD picture disc vinyl release features beautiful images of the two main characters from the hit family film of 2016."
              },
              {
              "Artist": "Various Artists",
              "Album": "Just Say 50: Sire Records 50th Anniversary Box Set",
              "Format": "4 x LP",
              "Label": "Sire",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059839:284",
              "More Info": "A 4 LP, limited edition, numbered box set exclusive that celebrates the 50th anniversary of the legendary and influential Sire Records label, co-founded in 1967 by Seymour Stein. The compilation spans the years 1969 to 1995, and features 46 artists, including early releases from Climax Blues Band and the label's first #1 hit, \"Hocus Pocus\" by Dutch band Focus, plus all the key artists from Sire's amazing history: Madonna, Talking Heads, The Ramones, The Smiths, The Pretenders, Depeche Mode, Echo & The Bunnymen, The Cult, Ice T, k.d. lang, Seal, The Replacements, Wilco and the list goes on and on."
              },
              {
              "Artist": "Various Artists",
              "Album": "Like Nashville In Naija: Nigeria\"s Romance with Country Music, Yesterday and Today",
              "Format": "2 x LP",
              "Label": "Comb & Razor Sound",
              "Quantity": 1200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059997:284",
              "More Info": "Country music is big in Africa. Yes, we realize how absurd that probably sounds to most ears, but it\"s really true: American country & western records have been tremendously popular and deeply beloved across the continent for almost a century. The people of the West African nation of Nigeria have long been not only voracious consumers of country music, but fairly enthusiastic performers of it as well. Cowboy songs have remained a consistent part of most bands\" live repertoire, but relatively few artists have dedicated themselves to actually recording country music. They did exist, though; mostly in the1970s and 80s, but they were rarely heard outside the country, and in the intervening years, most of their output has fallen through the cracks of posterity, forgotten even by ardent music fans at home. Until now. Like Nashville in Naija: Nigeria\"s Romance with Country Music, Yesterday and Today collects some of the best country recordings as a loving tribute to Nigeria\"s cowboy troubadours of yore."
              },
              {
              "Artist": "Various Artists",
              "Album": "Like a Drunk In A Midnight Choir--Record Store Day Celebrates the Music of Leonard Cohen",
              "Format": "LP",
              "Label": "Record Store Day",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059947:284",
              "More Info": "Record Store Day brings eleven artists together to celebrate the life and music of Leonard Cohen, with proceeds of the sales of each album going to Pablove, an organization devoted to fighting childhood cancer with love."
              },
              {
              "Artist": "Various Artists (featuring Mike Watt)",
              "Album": "Balkans-Pedro Four-Way",
              "Format": "7\" Vinyl",
              "Label": "ORG Music",
              "Quantity": 1800,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059816:284",
              "More Info": "Mike Watt is at it again with more international co-conspirators, this time from the Balkans. This one-of-a kind release brings together four bands from four countries, all covering each others songs. The bands hail from Zagreb, Skopje, Belgrade, and of course Watt's own San Pedro, CA. They all share a common ethos and a deep connection to the punk rock and post-punk tradition of their respecitive countries. The limited edition 7\" vinyl release features never-before heard recordings, and will be available exclusively for Record Store Day 2017."
              },
              {
              "Artist": "Various Artists",
              "Album": "Mind of a Genius Vol. 1",
              "Format": "LP",
              "Label": "Warner Bros.",
              "Quantity": 2200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059841:284",
              "More Info": "Mind of A Genius Records presents the first in a series of samplers featuring tracks from ZHU, Gallant, THEY, Klangstol, and KWAYE (two unreleased songs)."
              },
              {
              "Artist": "Various Artists",
              "Album": "Nuggets: Come To The Sunshine: Soft Pop Nuggets from the WEA Vaults",
              "Format": "2 x LP",
              "Label": "Rhino/Warner Bros.",
              "Quantity": 2800,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059863:284",
              "More Info": "Originally released as a 2004 compilation by Rhino Handmade, one of two new compilations using the Nuggets name. The title comes from the first track, \"Come To The Sunshine\" performed by Harpers Bizarre. This orange/yellow marble double vinyl set follows the Record Store Day 2016 release Hallucinations: Psychedelic Pop Nuggets from the WEA Vaults."
              },
              {
              "Artist": "Various Artists",
              "Album": "Pineapple Express (Original Movie Soundtrack)",
              "Format": "2 x LP",
              "Label": "Phineas Atwood/Lakeshore Records",
              "Quantity": 1800,
              "PhotoURL": "http://recordstoreday.com/Photo/418458061135:284",
              "More Info": "Pineapple Express starred James Franco and Seth Rogen, and its soundtrack makes its vinyl debut. Features music from the film including Cypress Hill, Humble Pie, Public Enemy and Huey Lewis. Original score by Graeme Revell (Street Kings, Sin City, The Crow)"
              },
              {
              "Artist": "Various Artists",
              "Album": "Where The Pyramid Meets The Eye--A Tribute To Roky Erickson",
              "Format": "2 x LP",
              "Label": "Sire",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060709:284",
              "More Info": "Originally issued in 1990, this tribute album to the founder of the 13th Floor Elevators is a favorite of record stores and fans who wish to own Erickson's definition of psychedelic music. Includes Doug Sahm, ZZ Top, the Butthole Surfers, T-Bone Burnett and a host of other great artists. It's a loving tribute to Roky, a man who influenced so many of his peers and became a hero to a whole new generation of musicians. Conceived by Sire Records president and long time fan Bill Bentley, the record was created as a means to widen Roky's audience and aid in the financial woes he experienced later in life. Double vinyl remaster housed in a gatefold sleeve, includes three extra tracks previously only available on the original cassette release."
              },
              {
              "Artist": "Various Artists",
              "Album": "Soul Slabs Volume 1",
              "Format": "2 x LP",
              "Label": "Colemine Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060878:284",
              "More Info": "A selection of 22 tracks from pulled from the 7-inch catalog of Colemine Records, a label steeped in modern groups recording deep funk and soul music, similar to Daptone Records."
              },
              {
              "Artist": "Various Artists",
              "Album": "Space Jam: Music From and Inspired By The Motion Picture",
              "Format": "2 x LP",
              "Label": "Atlantic Catalog Group",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059881:284",
              "More Info": "Soundtrack to the 1996 animated sports comedy film Space Jam starring Michael Jordan and the Looney Tunes Cartoon characters. The soundtrack features hits from R. Kelly (\"I Believe I Can Fly\"), Seal (\"Fly Like An Eagle\"), Coolio (\"The Winner\"), and Salt N Pepa (\"Upside Down\" (Round-N-Round))"
              },
              {
              "Artist": "Various Artists",
              "Album": "Stories for Ways & Means",
              "Format": "LP",
              "Label": "Waxploitation",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060005:284",
              "More Info": "Waxploitation Records founder Jeff Antebi asked his favorite artists from the worlds of music and the visual arts to collaborate on original children\"s stories for a multi-media \"literary mixtape\".  Those pairings can be found in the 350 page book Stories For Ways & Means and includes stories from Jim James, Nick Cave, Frank Black, Justin Vernon, Laura Marling, Devendra Banhart, Alison Mosshart as well as paintings/illustrations from Anthony Lister, James Jean, Dan Baldwin, Swoon, Will Barras, Ronzo, Kai & Sunny and more.  For Record Store Day 2017, Waxploitation has created a limited edition artifact of narrations from the book on 12\" colored vinyl (with an insert containing an excerpt from the book) with special guests like Zach Galifianlis, Danny Devito, Nick Offerman, King Krule, D.R.A.M., and more!"
              },
              {
              "Artist": "Various Artists",
              "Album": "Really Rock 'Em Right: Sun Records Curated By Record Store Day Volume 4",
              "Format": "LP",
              "Label": "ORG Music",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059915:284",
              "More Info": "This limited edition compilation LP was taken from the classic Sun Record Company catalog by participating RSD stores, and marks the fourth installment of the 'Sun Records Curated by Record Store Day' series. The track list was carefully curated by the hardworking people in record stores themselves. This Record Store Day 2017 exclusive release is limited to 4,000 copies worldwide and features songs from artists like Howlin' Wof, Ma Rainey, Jerry Lee Lewis, and Johnny Cash, to name a few."
              },
              {
              "Artist": "Various Artists",
              "Album": "We're Gonna Have A Party! The Soul of Wand Records",
              "Format": "LP",
              "Label": "Sundazed Music",
              "Quantity": 1060,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060015:284",
              "More Info": "Rare and danceable cuts of soul from the Wand Records catalog. A follow-up to the Scepter Soul release that came out on Black Friday 2016."
              },
              {
              "Artist": "Townes Van Zandt",
              "Album": "Live at Austin City Limits",
              "Format": "LP",
              "Label": "Fat Possum Records",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060004:284",
              "More Info": "The 1976 Austin City Limits television performance shows Townes Van Zandt at his best. Sharp and effortless guitar seamless with an intense delivery of his worlds. His eyes often closed, but baring his soul, as he delivers his songs to the audience."
              },
              {
              "Artist": "Vangelis",
              "Album": "Blade Runner Original Soundtrack",
              "Format": "LP Picture Disc",
              "Label": "Atlantic Catalog Group",
              "Quantity": 3500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059824:284",
              "More Info": "2017 sees the 35th anniversary of the original release of Ridley Scott's 1982 cult film Blade Runner. The original soundtrack, composed by Vangelis will be released on picture disc for the first time, housed within a die-cut single sleeve jacket."
              },
              {
              "Artist": "Venom",
              "Album": "At War With Satan",
              "Format": "LP Picture Disc",
              "Label": "BMG",
              "Quantity": 1500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059807:284",
              "More Info": "Limited edition picture disc of the clasic 1984 semi-concept album that tells the story of a war between Heaven and Hell, which the latter side wins."
              },
              {
              "Artist": "The War On Drugs",
              "Album": "Thinking of A Place",
              "Format": "12\" Vinyl",
              "Label": "Atlantic",
              "Quantity": 5500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059831:284",
              "More Info": "Thinking of A Place is the first new music from The War On Drugs since the release of their critically acclaimed album 2014 album Lost In The Dream. Available on 45 rpm-mastered vinyl exclusively for Record Store Day 2017."
              },
              {
              "Artist": "John Williams",
              "Album": "Star Wars: A New Hope",
              "Format": "10\" Vinyl",
              "Label": "Walt Disney Records",
              "Quantity": 4000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060522:284",
              "More Info": "In celebration of the 40th Anniversary of Star Wars \"A New Hope\" this nostalgic 10\" RSD exclusive features two tracks from John Williams\" incomparable score from the film that kicked off a legendary franchise."
              },
              {
              "Artist": "The Wipers",
              "Album": "Better off Dead",
              "Format": "7\" Vinyl",
              "Label": "Jackpot Records",
              "Quantity": 2000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059949:284",
              "More Info": "First ever recordings of historic NW band The Wipers, originally released in 1978 and reissued here for the first time, with original artwork."
              },
              {
              "Artist": "Link Wray",
              "Album": "Beans and Fatback",
              "Format": "LP",
              "Label": "Tidal Waves Music",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060430:284",
              "More Info": "Tidal Waves Music presents exclusively for Record Store Day 2017: LINK WRAY \"BEANS AND FATBACK\" Fred Lincoln \"Link\" Wray, Jr. (1929-2005) born of Shawnee Native American parents was an American rock and roll guitarist, songwriter and vocalist who became popular in the late 1950s.Though he began in country music, his musical style went on to consist primarily of rock and roll, rockabilly and instrumental rock. Building on the distorted electric guitar sound of early records, his 1958 instrumental hit \"Rumble\" (banned in New York and Boston for fear it would incite teenage gang violence) popularized \"the power chord\" which laid the foundation to modern rock music.Building on the distorted electric guitar sound of early records, his 1958 instrumental hit \"Rumble\" (banned in New York and Boston for fear it would incite teenage gang violence) popularized \"the power chord\" which laid the foundation to modern rock music.This is where the \"Beans and Fatback\" sessions were recorded in 1971, making it part of what we now know as the \"Shack Trilogy\" together with the albums \"Link Wray\" & \"Mordicai Jones\".Producer Steve Verroca had, allegedly, stolen the demo tapes of Beans and Fatback and sold them to Virgin Records who later withdrew the album.Beans and Fatback is made out of fantastic Americana blended blues, country, gospel, Native American chants, folk rock and traditionals such as \"Hobo Man\" and \"Georgia Pines\" (the latter a rewrite of Lead Belly\"s \"In the Pines).Link Wray leaves a legacy as big as his career: Rolling Stone placed Wray at No. 45 of the 100 greatest guitarists of all time and in 2013 he was a nominee for the Rock and Roll Hall of Fame. Pete Townshend of The Who once said, \"If it hadn't been for Link Wray and 'Rumble,' I never would have picked up a guitar.\" Other musicians citing him as a major influence are Iggy Pop, Neil Young & Jimmy Page (amongst others).Originally released on Virgin Records in 1973, this is the first time the album gets a vinyl release outside of Europe. Now available as a gorgeously packaged deluxe vinyl edition, exclusively for Record Store Day 2017. Strictly limited to 2500 copies."
              },
              {
              "Artist": "Yes",
              "Album": "90125",
              "Format": "LP Picture Disc",
              "Label": "Atlantic Catalog Group",
              "Quantity": 2500,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059799:284",
              "More Info": "Bestelling album from Yes, 90125, originally released in 1983, represented a remarkable self-reinvention of the English prog-rock band, that positively surprised both their fans and their critics. The slick production of Trevor Horn, the trademark vocals of returning founding member Jon Anderson and the new energy infused by the distinctly '80s guitar sound of Trevor Rabin created the perfect mix for Yes' resurgence. 90125, which features the hit \"Owner of a Lonely Heart\" will be available on picture disc for the first for Record Store Day 2017."
              },
              {
              "Artist": "Neil Young",
              "Album": "Decade",
              "Format": "3 x LP",
              "Label": "Reprise",
              "Quantity": 5000,
              "PhotoURL": "http://recordstoreday.com/Photo/418458059838:284",
              "More Info": "A remastered reproduction of the original 3 X LP release, including two photo reproductions by Henry Diltz"
              },
              {
              "Artist": "The Zombies",
              "Album": "I Want You Back",
              "Format": "7\" Vinyl",
              "Label": "BMG",
              "Quantity": 1250,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060707:284",
              "More Info": "A 7\" that spans fifty years with one song, \"I Want You Back\" as The Zombies performed it in 1965 and 2015."
              },
              {
              "Artist": "The Zombies",
              "Album": "\"A Rose For Emily\" / \"This Will Be Our Year\"",
              "Format": "7\" Vinyl",
              "Label": "Varese",
              "Quantity": 2200,
              "PhotoURL": "http://recordstoreday.com/Photo/418458060071:284",
              "More Info": "2017 is the 50th anniversary of The Zombies' Odessey and Oracle, a Rolling Stone Top 100 album of all-time, and the band's seminal release. In preparation for a 50th anniversary deluxe CD of O&O, a\" never before released version of \"A Rose For Emily\" with cello accompaniment was discovered, and it is lovely. The b-side of this 7\" features the original version of \"This Will Be Our Year.\" The song is featured in Starbucks' 2016 holiday campaign, exposing the classic song to a new generation of listeners. The 7\" comes on pink vinyl. The Zombies will embark on a North American tour in 2017 playing the entire O&O album, with the first 28 dates already announced. They are also a finalist to be inducted into the Rock N Roll Hall of Fame."
              }
        ]
