[
    {
     "Artist": "Randy Newman",
     "Album": "You've Got A Friend In Me",
     "Format": "3\" Vinyl",
     "Label": "Walt Disney Records",
     "Quantity": 3500,
     "PhotoURL": "https://recordstoreday.com/Photo/418461633393:360",
     "More Info": "A song from the Pixar animated film Toy Story, pressed on 3\" vinyl for play on the RSD3 mini-turntable. One of four in a series of classic Disney/Pixar songs on 3\" vinyl for RSD Black Friday."
     },
    {
    "Artist": "Jodi Benson",
    "Album": "Part of Your World",
    "Format": "3\" Vinyl",
    "Label": "Walt Disney Records",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461633369:360",
    "More Info": "A song from the Disney animated film The Little Mermaid, pressed on 3\" vinyl for play on the RSD3 mini-turntable. One of four in a series of classic Disney/Pixar songs on 3\" vinyl for RSD Black Friday."
    },
    {
    "Artist": "Ernie Sabella, Joseph Williams, Kristle Edwards, Nathan Lane and Sally Dworsky",
    "Album": "Can You Feel The Love Tonight",
    "Format": "3\" Vinyl",
    "Label": "Walt Disney Records",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461633315:360",
    "More Info": "A song from the Disney animated film The Lion King, pressed on 3\" vinyl for play on the RSD3 mini-turntable. One of four in a series of classic Disney/Pixar songs on 3\" vinyl for RSD Black Friday."
    },
    {
    "Artist": "Lea Salonga and Brad Kane",
    "Album": "A Whole New World",
    "Format": "3\" Vinyl",
    "Label": "Walt Disney Records",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461633294:360",
    "More Info": "A song from the Disney animated film Aladdin, pressed on 3\" vinyl for play on the RSD3 mini-turntable. One of four in a series of classic Disney/Pixar songs on 3\" vinyl for RSD Black Friday."
    },
    {
    "Artist": "Vince Guaraldi",
    "Album": "A Charlie Brown Christmas RSD3 Blind Box Series",
    "Format": "3\" Vinyl",
    "Label": "Varese Sarabande",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461708148:360",
    "More Info": "A Charlie Brown Christmas, certified 4X Platinum by the RIAA in 2016, is one of the best-selling jazz albums in history, second only to Miles Davis' Kind of Blue; and it's no surprise: Guaraldi's engaging score to the synonymous holiday television special has introduced generations of children and their parents to the joys of jazz music, with tracks like the instantly recognizable \"Linus and Lucy,\" and yuletide favorite \"Christmas Time Is Here.\" The album was inducted into the GRAMMY® Hall of Fame in 2007 and the Library of Congress's National Recording Registry five years later, and continues to be a perennial favorite, thanks to annual airings of the Christmas TV special. Made to play on the RSD3 mini-turntable, the RSD3 A CHARLIE BROWN CHRISTMAS \"BLIND BOX\" single comes in an outer box that reproduces the original 12\" album art, and includes one of four possible songs; \"Christmas Time is Here (Vocal),\" \"Hark the Herald Angels Sing,\" \"Linus and Lucy\" and \"Skating.\" Each track comes with its own unique pull-out poster."
    },
    {
    "Artist": "Arcade Fire",
    "Album": "Neighborhood #1 (Tunnels)",
    "Format": "7\" Vinyl",
    "Label": "Legacy",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606706:360",
    "More Info": "Frequently cited as one of the most important alternative songs of the 2000s, \"Neighborhood #1 (Tunnels)\" – the opening track on debut album Funeral – was an early introduction to the trademark Arcade Fire sound and encapsulates the essence of the music and themes on Funeral. The B-side, \"My Buddy\" by the Alvino Rey Orchestra, pays tribute to Will and Win Butler's late grandfather, the Jazz musician Alvino Rey whose passing during the early part of Arcade Fire's career would greatly influence Funeral. This RSD Black Friday 7\" replicates the original Merge Records single – first released in June 2004 – the debut single from the band. Originally limited to 1500 copies, it has become a highly collectable item amongst fans over the years."
    },
    {
    "Artist": "Louis Armstrong & His All-Stars",
    "Album": "Live in 1956 (Allentown, PA)",
    "Format": "LP",
    "Label": "ORG Music",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593206:360",
    "More Info": "Unearthed for the first time after the discovery of a \"mystery\" tape reel, Louis Armstrong's performance in Allentown, PA on November 24, 1956 is one for the history books. Armstrong is joined by his All-Stars, including Trummy Young, Edmund Hall, Billy Kyle, and Velma Middleton. Available for the first time in any format, the historic concert audio has been mastered from the original analog tape and pressed on color vinyl for this limited edition release, exclusively for RSD Black Friday."
    },
    {
    "Artist": "Sebastian Bach",
    "Album": "Forever Wild (Los Angeles / 2003)",
    "Format": "2 x LP",
    "Label": "earMUSIC",
    "Quantity": 2300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605213:360",
    "More Info": "2 x LP reissue of Sebastian Bach's legendary 1998 appearance at the Whisky A Go-Go."
    },
    {
    "Artist": "Bad Company",
    "Album": "Live at Red Rocks",
    "Format": "2 x LP",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603512:360",
    "More Info": "Fourteen tracks from the band's May 2016 show at Red Rocks, while Rich Robinson of The Black Crowes was sitting in on guitar. On double red vinyl in a gatefold sleeve."
    },
    {
    "Artist": "Chet Baker",
    "Album": "Chet Baker Sings It Could Happen To You",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593142:360",
    "More Info": "Reissue of the rare MONO version of Chet Baker's classic 1958 album on Riverside Records. Cut from the analog master, pressed on 180-gram vinyl at RTI and housed in a tip-on jacket."
    },
    {
    "Artist": "Chuck Berry",
    "Album": "Chuck Berry In London",
    "Format": "LP",
    "Label": "Elemental Music",
    "Quantity": 2350,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593139:360",
    "More Info": "In early 1965, Chuck Berry's career was making a resurgence on the back of The Beatles and The Rolling Stones covering his songs on their early records. Chuck Berry In London (1965) was the answer to that British revival, and it is considered one of his best efforts of that period. This masterpiece contains eight songs recorded in London in early 1965, backed by the UK R&B group The Five Dimensions, plus other tracks belonging to a December 1964 Chicago session with the Jules Blattner Group. 180g LP. First official reissue in over 50 years."
    },
    {
    "Artist": "Brothers Osborne",
    "Album": "Live at the Ryman",
    "Format": "2 x LP",
    "Label": "EMI Nashville",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592960:360",
    "More Info": "The first live album from the three-time CMA Vocal Duo of the Year and two-time ACM Vocal Duo of the Year, recorded at two sold out nights at the historic Ryman Auditorium in February 2019. Current CMA Duo Of The Year! 12 Tracks including the hit songs- \"It Ain’t My Fault\", \"Shoot Me Straight\", \"21 Summer\" and the #1 Song- \"Stay A Little Longer\". Brothers Osborne currently reigns as three-time CMA Vocal Duo of the Year in addition to being named ACM Vocal Duo of the Year the past two years. Overall, Brothers Osborne have collected four CMA, five ACM trophies and stand as five-time GRAMMY nominees. The Maryland Natives are set to reunite with Chris Stapleton on tour later this fall and will also open select dates for Willie Nelson including the legendary Farm Aid on September 21."
    },
    {
    "Artist": "Jeff Buckley",
    "Album": "Live on KCRW: Morning Becomes Eclectic",
    "Format": "LP",
    "Label": "Legacy",
    "Quantity": 3750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606715:360",
    "More Info": "One of the most magical, as-yet unreleased live performances by Jeff Buckley debuts on vinyl as part of the continuing celebration of the 25th anniversary of his debut studio album Grace. Buckley's captivating appearance on KCRW-FM's long-running Morning Becomes Eclectic was accompanied by the core band with which he recorded Grace, and features favorites from that record, including \"Mojo Pin,\" \"So Real,\" and \"Lover, You Should Have Come Over.\""
    },
    {
    "Artist": "Lewis Capaldi",
    "Album": "Hold Me While You Wait/When The Party's Over",
    "Format": "7\" Vinyl",
    "Label": "Capitol",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592942:360",
    "More Info": "Lewis Capaldi's Spotify Singles Session, available on limited edtion 7\" vinyl exclusively for RSD BF! Features live recordings of \"Hold Me While You Wait\" and a cover of \"when the party's over\" originally performed by Billie Eilish"
    },
    {
    "Artist": "Cheap Trick",
    "Album": "Are You Ready? Live 12/31/1979",
    "Format": "2 x LP",
    "Label": "Legacy",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606709:360",
    "More Info": "Flash back to the close of the 1970s, when Cheap Trick (who electrified the tail end of the decade's rock scene) rang in a new era with their road-tested, rafter-shaking rock 'n' roll revelry at the fabulous Forum just outside Los Angeles! Rockford's finest deliver all the killer cuts you want, including \"I Want You To Want Me,\" \"Surrender,\" and \"Clock Strikes Ten,\" plus tracks from their recently-released fourth studio album Dream Police. This mythic concert is now available for the first time ever, featuring new mixes from the original multi-track masters!"
    },
    {
    "Artist": "Eric Clapton",
    "Album": "\"Home For The Holidays\" / \"For Love On Christmas Day\"",
    "Format": "LP",
    "Label": "SURFDOG RECORDS",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603518:360",
    "More Info": ""
    },
    {
    "Artist": "J. Cole",
    "Album": "2014 Forest Hills Drive EP",
    "Format": "12\" Picture Disc",
    "Label": "Legacy",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606713:360",
    "More Info": "Rediscover the songs that helped J. Cole's third album go ballistic! Includes \"Apparently,\" \"Wet Dreamz,\" \"No Role Modelz\" and \"Love Yourz.\""
    },
    {
    "Artist": "Willie Colon and Hector Lavoe",
    "Album": "Asalto Navideño",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593144:360",
    "More Info": "Classic  1970 salsa holiday album from the Fania catalog. First time being reissued on vinyl, cut from the analog master and pressed on translucent red vinyl."
    },
    {
    "Artist": "Alice Cooper",
    "Album": "Billion Dollar Babies",
    "Format": "LP",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607136:360",
    "More Info": "Alice Cooper's Billion Dollar Babies Live LP, recorded live at Sam Houston Coliseum in Houston on April 28, 1973.  Previously released on the Deluxe CD edition of Billion Dollar Babies in 2001. This RSD Black Friday release is the first vinyl pressing for this historic concert."
    },
    {
    "Artist": "Miles Davis",
    "Album": "Early Minor: Rare Miles From The Complete In A Silent Way Sessions",
    "Format": "LP",
    "Label": "Legacy",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606731:360",
    "More Info": "During the year between the dissolution of his '60s quintet and the groundbreaking Bitches Brew, Miles Davis recorded a number of transitional sessions creating music of lyrical beauty, culminating in the masterful album In a Silent Way. Three superb pieces—\"Splashdown,\" \"Early Minor\" and \"The Ghetto Walk\"—come to vinyl for general release for the first time ever, as originally heard on The Complete In a Silent Way Sessions, released in 2001."
    },
    {
    "Artist": "Devo",
    "Album": "Devo Live!",
    "Format": "LP",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604991:360",
    "More Info": "In the early 1980s the \"Warner Bros. Music Show\" series was mailed to radio stations as promo copies, to be aired only once as a radio show. Pressings were probably a run of a few hundred copies and may have been included as part of the Rockpool service that was sent to 250 college stations. For RSD Black Friday this edition of the series' promo has been replicated, for commercial use for the first time.  Six songs from this recording, including an unlisted intro, were used to make the DEV-O Live 12\" mini-album."
    },
    {
    "Artist": "Dio",
    "Album": "Rainbow In The Dark (Live)",
    "Format": "12\" Picture Disc",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603513:360",
    "More Info": "These songs appear on vinyl for the first time, and it's on a dragon picture disc! The live version of \"Rainbow In The Dark\" was recorded in 2002."
    },
    {
    "Artist": "DMX",
    "Album": "The Smoke Out Festival Presents",
    "Format": "LP",
    "Label": "earMUSIC",
    "Quantity": 2300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604993:360",
    "More Info": "DMX’s live set from Cypress Hill’s famous Smoke Out Fest from 2003."
    },
    {
    "Artist": "Thomas Dolby",
    "Album": "\"She Blinded Me With Science\" / \"One of Our Submarines\"",
    "Format": "7\" Vinyl",
    "Label": "Echo",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606750:360",
    "More Info": "Released on special coloured vinyl exclusively for RSD Black Friday, this 7\" single features two of the best-loved tracks from Thomas Dolby. Originally released in 1982, \"She Blinded Me With Science\" reached #5 on the Billboard Hot 100 and then spent two weeks at #2 in Canada In 2002. Side B features \"One Of Our Submarines\" another knock-out track that's a firm favourite among Dolby fans."
    },
    {
    "Artist": "The Doors",
    "Album": "Live At The Isle Of Wight Festival 1970",
    "Format": "2 x LP",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605226:360",
    "More Info": "The 1970 Isle of Wight performance, their last as a foursome outside the US, on vinyl for the very first time.  Features Doors classics \"Roadhouse Blues\", \"Break On Through (To The Other Side)\", \"Light My Fire\" and \"The End\". Pressed on audiophile-quality, heavyweight double black vinyl."
    },
    {
    "Artist": "Bill Evans",
    "Album": "Live at Art D'Lugoff's Top of The Gate",
    "Format": "2 x LP",
    "Label": "Resonance Records",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593105:360",
    "More Info": "This Record Store Day Black Friday release captures two complete sets of the Bill Evans Trio (with bassist Eddie Gomez and drummer Marty Morell) on October 23, 1968 at Art D'Lugoff's legendary Village Gate club in New York City. The much sought-after 2012 3LP boxed set edition was initially pressed at 45 RPM and has been out of print and unavailable for three years. Originally recorded by Resonance founder and co-president George Klabin at 21 years old, and digitally remastered from the original tapes, this deluxe 2LP gatefold set includes a 4-page insert with iconic photos by Tom Copi, Jan Persson, Raymond Ross, Fred Seligo and Herb Snitzer, essays by renowned jazz critic Nat Hentoff, vibraphonist Gary Burton, Art D'Lugoff's son Raphael D'Lugoff, and more! This is a limited edition re-pressing of 4,000 copies worldwide, on 180g black vinyl. Mastered by Bernie Grundman and pressed by Record Technology Inc. at 33 1/3RMP."
    },
    {
    "Artist": "Fight",
    "Album": "War of Words",
    "Format": "LP",
    "Label": "Real Gone Music",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606711:360",
    "More Info": "The first U.S. vinyl issue of the 1993 debut album from the band led by Judas Priest's Rob Halford. White with black splatter vinyl pressing limited to 1500 copies."
    },
    {
    "Artist": "Aretha Franklin",
    "Album": "Aretha Franklin - The Atlantic Singles Collection 1968",
    "Format": "7\" Vinyl Box Set",
    "Label": "Atlantic Records",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607205:360",
    "More Info": "Aretha Franklin - The Atlantic Singles 1968 7\" Vinyl Singles boxset, featuring Aretha's four 7\" singles from 1968. Following the Aretha Franklin 1967 7\" Singles Boxed set released for RSD 2019."
    },
    {
    "Artist": "Gun Club",
    "Album": "Sex Beat 81",
    "Format": "LP",
    "Label": "Culture Factory",
    "Quantity": 1300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593179:360",
    "More Info": "The Gun Club were a highly influential post-punk/ blues band from Los Angeles, CA that existed from 1979 to 1996. Created and led by talented maverick singer songwriter-guitarist Jeffrey Lee Pierce, they merged the contemporary genre of punk rock with the more traditional genres of rockabilly and country music, alongside X, the Flesh Eaters and the Blasters. The Gun Club has been called a \"tribal psychobilly blues\" band and initiators of the U.S. wave of Cowpunk. Sex Beat 81 is a live album, recorded in 1981 and eventually released in 1984. It's not been reissued on vinyl until now, and comes out on RSD Black Friday on translucent yellow vinyl, with reproductions of the original labels, and an OBI spine."
    },
    {
    "Artist": "Sammy Hagar",
    "Album": "Santa’s Going South For Christmas",
    "Format": "12\" Picture Disc",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605210:360",
    "More Info": "\"Santa's Going South For Christmas\" // \"Eagles Fly (Live 2019)\""
    },
    {
    "Artist": "Albert Hammond, Jr.",
    "Album": "Off Cycle",
    "Format": "10\" Vinyl",
    "Label": "Red Bull Records",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605064:360",
    "More Info": "A two song blue 10\" featuring the singles \"Fast Times\" and \"More to Life\" that Albert Hammond Jr. of The Strokes released in 2019 for his solo project under his name."
    },
    {
    "Artist": "Jimi Hendrix",
    "Album": "Merry Christmas and Happy New Year",
    "Format": "12\" Picture Disc",
    "Label": "Legacy",
    "Quantity": 4500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606718:360",
    "More Info": "As Christmas 1969 beckoned, Jimi Hendrix, bassist Billy Cox, and drummer Buddy Miles (christened Band Of Gypsys by Hendrix) engaged in extensive rehearsals for their highly anticipated appearances at The Fillmore East in New York. To mark the occasion in his own inimitable fashion, Jimi readied this special medley of holiday favorites to celebrate both Christmas and the dawning of a new decade. This medley of \"Little Drummer Boy,\" \"Silent Night\" and \"Auld Lang Syne,\" along with \"Three Little Bears,\" a playful Electric Ladyland outtake from 1968, is now available on picture disc, featuring album artwork on one side and a photo of Jimi dressed as Santa Claus on the other."
    },
    {
    "Artist": "Hippo Campus",
    "Album": "Demos I & II",
    "Format": "2 x LP",
    "Label": "Grand Jury Music",
    "Quantity": 1750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605002:360",
    "More Info": "This is a collection of all the material created around the recording of Hippo Campus' most recent record, Bambi. One LP is early iterations of songs from the album, while the second collection is material that was written and recorded in sessions for the album, including several live fan favorites. 2x LP on opaque white 180g vinyl. Matte-finish gatefold jacket & printed sleeves. All packaged in a custom-printed polybag. Includes download card."
    },
    {
    "Artist": "The Hold Steady",
    "Album": "Four on Ten",
    "Format": "10\" Vinyl",
    "Label": "Frenchkiss",
    "Quantity": 1800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605227:360",
    "More Info": "A collection of four songs, previously only released as digital singles."
    },
    {
    "Artist": "Robert Johnson",
    "Album": "Sweet Home Chicago/Walkin Blues",
    "Format": "10\" Vinyl",
    "Label": "Traffic Entertainment",
    "Quantity": 1900,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607399:360",
    "More Info": "The impact of Robert Johnson's talent, be it his intense vocals, outstanding guitar skills or masterful songwriting, is still being measured. As a youth Johnson learned to play the harmonica, and according to Son House, Johnson was pretty good at it. His real ambition was to master the guitar and sometimes during a break when his idols Son House and Willie Brown performed he would pick up one the guitars and try playing it himself annoying his idols. House's story of the events: \"Such a racket you never heard. It'd make the people mad. I'd come back in I'd scold him about it. Don't do that Robert. You drive the people nuts. You can't play nothing.\" Driven by the negative response to his inadequate abilities on the guitar, Johnson disappears for a year or two, returning with stunning results as a master of the Mississippi Delta blues style not only absorbing the immediate influences of his mentors but perfecting his craft one step further with unprecedented intensity creating a guitar mastery and expressive vocal emotion that radiates and inspires to this day. For RSD Black Friday 2019 Traffic Entertainment presents two of Johnson's most iconic sides as a 78 RPM microgroove record housed in a glorious reproduction of the Vocalion sleeve wrapped in a full color OBI with detailed liner notes."
    },
    {
    "Artist": "Blind Willie Johnson",
    "Album": "Dark Was The Night, Cold Was The Ground/It's Nobody's Fault But Mine",
    "Format": "10\" Vinyl",
    "Label": "Traffic Entertainment",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593300:360",
    "More Info": "Blind Willie Johnson was the greatest and most popular guitar evangelist, and influenced generations of musicians. His unique, intense, emotional and haunting gruff voice—coupled with some of the finest slide-guitar of any of his peers—firmly established Johnson's status as one of the premier gospel-blues artists of all time. Between 1927 and 1930, Johnson recorded 30 powerful, timeless, landmark songs for Columbia Records in five sessions in Dallas, New Orleans, and Atlanta, generating strong sales and national fame. On December 3, 1927, in a temporary studio in the Deep Ellum district of Dallas, Johnson recorded six groundbreaking songs, including the iconic slide guitar classic, \"Dark Was the Night, Cold Was the Ground.\" Johnson's haunting response to Christ's crucifixion remains one of the masterpieces of American music. Ry Cooder described it as \"the most soulful, transcendent piece in all American Music.\" Jack White called it \"the greatest example of slide guitar ever recorded.\" For RSD Black Friday 2019 Traffic Entertainment presents two of Johnson's most iconic sides as a 78 RPM microgroove record housed in a glorious reproduction of the Columbia sleeve wrapped in a full color OBI with detailed liner notes."
    },
    {
    "Artist": "Norah Jones",
    "Album": "I'll Be Gone",
    "Format": "7\" Vinyl",
    "Label": "Blue Note",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592940:360",
    "More Info": "Brand new music from Norah Jones, featuring collaborations with Mavis Staples and Tarriona \"Tank\" Ball of Tank & The Bangas."
    },
    {
    "Artist": "Freddy King",
    "Album": "The Mojo! King Rarities & Obscurities",
    "Format": "LP",
    "Label": "Modern Harmonic",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604995:360",
    "More Info": "Blues master Freddy King made history with his explosive and unconventional guitar style, his immortal instrumentals inspiring axe-men both at home and abroad. The Mojo! showcases Freddy's fusion of traditional blues with a contemporary edge across a blazing set of originally unissued alternate takes and rarities from the King Records era and beyond, all fourteen of which making their first-ever appearance on LP! Pressed on gold vinyl at RTI!"
    },
    {
    "Artist": "Kings Of Leon",
    "Album": "Day Old Belgian Blues",
    "Format": "12\" Vinyl",
    "Label": "Legacy",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606727:360",
    "More Info": "Recorded on a European tour to promote their sophomore album, 2004's Aha Shake Heartbreak, Day Old Belgian Blues captures Kings of Leon's raw, urgent rock sound as it swept over fans and critics alike. This live EP, featuring versions of \"The Bucket,\" \"Four Kicks,\" \"Molly’s Chambers\" and more, makes its vinyl debut for RSD Black Friday."
    },
    {
    "Artist": "The Kinks",
    "Album": "\"Arthur\" / \"Brainwashed\"",
    "Format": "7\" Vinyl",
    "Label": "Sanctuary Records",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605228:360",
    "More Info": "New 2019 mono remasters of these two original Kinks Arthur album tracks from 1969 on 7\" vinyl, exclusive to RSD Black Friday. Set to coincide with the deluxe re-issues of Arthur for its 50th anniversary October 2019. It's the first time for these tracks to be released on a single, and the first time on coloured vinyl, with Union Jack labels."
    },
    {
    "Artist": "Geddy Lee",
    "Album": "My Favourite Heachache",
    "Format": "LP",
    "Label": "Atlantic Records",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604996:360",
    "More Info": "The first vinyl release for RUSH frontman Geddy Lee's solo album."
    },
    {
    "Artist": "John Linnell",
    "Album": "State Songs",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593169:360",
    "More Info": "The 1999 solo album from one of the two They Might Be Giants Johns makes its vinyl debut in celebration of the album's 20th anniversary."
    },
    {
    "Artist": "Nick Lowe & Wilco",
    "Album": "Cruel to Be Kind (40th Anniversary Edition)",
    "Format": "7\" Vinyl",
    "Label": "Yep Roc Records",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594715:360",
    "More Info": "Nick Lowe's \"Cruel to Be Kind\" was first released as a single in 1979 and, thanks to the hook-laden chorus and Lowe's signature turn of phrase, has never left our ears since. To celebrate the 40th anniversary of the power pop gem, Yep Roc is releasing a limited edition 45 single of \"Cruel to Be Kind\" for Record Store Day Black Friday 2019. The A-side features the classic single and the B-side contains Nick Lowe & Wilco performing the track together in 2012. The Nick Lowe & Wilco cover of \"Cruel to Be Kind\" has never been previously available in any physical format. The 45 single arrives on green vinyl and contains a digital download for both songs."
    },
    {
    "Artist": "Madonna",
    "Album": "I Rise",
    "Format": "LP",
    "Label": "IGA",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592949:360",
    "More Info": "Remixes of the track \"I Rise\" from Madonna's latest album, Madame X."
    },
    {
    "Artist": "Paul McCartney",
    "Album": "Home Tonight/In A Hurry",
    "Format": "7\" Vinyl",
    "Label": "Capitol",
    "Quantity": 12000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592934:360",
    "More Info": "Both \"Home Tonight\" and \"In A Hurry\" were recorded during the Greg Kurstin sessions for Paul's #1 charting album Egypt Station. The limited edition vinyl picture disc will feature new artwork exclusively created for this RSD Black Friday release, based on the parlour game Exquisite Corpse, and includes a lyric insert."
    },
    {
    "Artist": "The Monkees",
    "Album": "Christmas Party Plus!",
    "Format": "2 x 7\" Vinyl",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607201:360",
    "More Info": "The Monkees' Unwrap You At Christmas features two 7\" singles on color vinyl (one red / one green), housed in a gatefold sleeve."
    },
    {
    "Artist": "Matt Nathanson",
    "Album": "Some Mad Hope",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593166:360",
    "More Info": "Singer-songwriter Matt Nathanson’s sixth album, released in August 2007, gets its first vinyl release, on sky-colored vinyl, for RSD Black Friday."
    },
    {
    "Artist": "Willie Nelson",
    "Album": "\"Sometimes Even I Can Get Too High\" b/w \"It's All Going To Pot\" (w/ Merle Haggard)",
    "Format": "7\" Vinyl",
    "Label": "Legacy",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606766:360",
    "More Info": "It's said that legends aren't born—they're grown. Willie Nelson, an enduring American icon and tireless supporter of marijuana legalization, offers the latest hit from his stash, a humorous ode to the sweetest of leaves as only Willie can do it. \"Sometimes Even I Can Get Too High,\" a new song from the sessions for Willie's latest album, Ride Me Back Home is backed with \"It’s All Going To Pot,\" another 420 favorite from Django and Jimmie, Willie and Merle Haggard's 2015 album."
    },
    {
    "Artist": "Agnes Obel",
    "Album": "Island of Doom",
    "Format": "7\" Vinyl",
    "Label": "Blue Note",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592948:360",
    "More Info": ""
    },
    {
    "Artist": "J.S. Ondara",
    "Album": "Tales of America B Sides",
    "Format": "LP",
    "Label": "Verve",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592965:360",
    "More Info": "Born and raised in Nairobi, Kenya, J.S. Ondara fell in love with Bob Dylan and moved to Minneapolis when he was 20 to pursue a career as a singer-songwriter. His debut album, Tales of America, is an examination of the American Dream, but from the perspective of the outsider, the immigrant, the social commentator. This album made J.S. an NPR Slingshot Artist, a Rolling Stone Artist You Need To Know, and earned him a Best Emerging Act nomination from the Americana Music Association in 2019. Tales of America: B Sides is a five track LP packaged exclusively for Record Store Day, and features a previously unreleased track, a demo, a remix, and two cover songs."
    },
    {
    "Artist": "Pearl Jam",
    "Album": "MTV Unplugged (3/16/1992)",
    "Format": "LP",
    "Label": "Legacy",
    "Quantity": 13000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606735:360",
    "More Info": "Three days after completing their first American tour, Pearl Jam headed to New York to strip back songs from their debut album Ten, well on its way to becoming one of 1992's top rock albums. For the first time on vinyl, relive all seven songs featured in the MTV Unplugged broadcast, including \"Jeremy,\" \"Even Flow,\" \"Alive,\" \"Black\" and \"State Of Love and Trust.\""
    },
    {
    "Artist": "Elvis Presley",
    "Album": "American Sound 1969",
    "Format": "2 x LP",
    "Label": "Legacy",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606710:360",
    "More Info": "1969 was a pivotal year for Elvis Presley. Fresh from the success of the '68 Comeback Special, a revitalized Elvis headed to American Sound Studios with producer Chips Moman and a crack group of local session musicians. From these sessions came From Elvis In Memphis, one of the most beloved LPs of his career, plus the seminal hits \"Suspicious Minds\" (his 18th and final No. 1 hit) and \"In The Ghetto.\" American Sound Sessions 1969, available for the first time on vinyl, features rare and unreleased outtakes from these legendary sessions."
    },
    {
    "Artist": "The Pretenders",
    "Album": "UK Singles 1979-1981",
    "Format": "7\" Vinyl Box Set",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605187:360",
    "More Info": "This year marks forty years since the Pretenders' debut single, a cover of the Kinks classic \"Stop Your Sobbing\" was released, and to celebrate a collection of their first eight 7\" singles (from their first two albums Pretenders and Pretenders II) has been put together for RSD Black Friday."
    },
    {
    "Artist": "Lou Reed",
    "Album": "The Raven",
    "Format": "3 x LP",
    "Label": "Rhino",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607138:360",
    "More Info": "Lou Reed's 19th solo album, 2003's The Raven, is a concept album, recounting the short stories and poems of Edgar Allan Poe. It features guest vocals from Laurie Anderson and David Bowie (amongst others) and also includes different versions of two classic Lou Reed tracks: \"Perfect Day\" (originally released on his breakthrough album Transformer) and \"The Bed\" (originally released on his third studio album Berlin). This RSD Black Friday title marks the first time The Raven is released on vinyl."
    },
    {
    "Artist": "The Runaways",
    "Album": "Live in Japan",
    "Format": "LP",
    "Label": "Culture Factory",
    "Quantity": 1200,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593189:360",
    "More Info": "This 1977 live recording has explosive performances of \"Cherry Bomb,\" \"You Drive Me Wild,\" and \"California Paradise\". The Runaways' only live album is a hard-to-find gem. All the original members, including Joan Jett, were still in the band at the time and Lita Ford is at her most metallic. The album, also known as \"The Runaways album\" was originally released only in Japan, and some other regions including Canada, Australia, and New Zealand, and was not intended for release in the United States or UK. This RSD Black Friday release features a gatefold jacket, printed inner sleeves, reproductions of the original labels, and an OBI spine."
    },
    {
    "Artist": "Todd Rundgren",
    "Album": "Bang Bang",
    "Format": "7\" Vinyl",
    "Label": "Yep Roc Records",
    "Quantity": 1800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605231:360",
    "More Info": "\"Bang Bang\" has remained a curious single in the Squeeze discography, as it was nearly disowned by its songwriters Glenn Tilbrook and Chris Difford. Even more curious, however, is renowned wizard (and true star) Todd Rundgren covering it for the fourth installment in the Swindles series. Rundgren takes the song down a electropop wormhole, transforming the tune into something completely unique from the original recording. \"Bang Bang\" was produced and engineered by Rundgren and Swindles-curator Steve Mandel and is available as a limited edition 45 single for Record Store Day Black Friday 2019."
    },
    {
    "Artist": "Joe Satriani",
    "Album": "Surfing With The Alien",
    "Format": "2 x LP",
    "Label": "Legacy",
    "Quantity": 3500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606724:360",
    "More Info": "From its original release in 1987, Surfing With The Alien established Joe Satriani as one of the definitive guitarists of his generation thanks to unforgettable songs like \"Satch Boogie\" and \"Always With Me, Always With You.\" More than 30 years after Surfing With The Alien went platinum, earned two Grammy Award nominations and camped out on the Billboard 200 for over a year, the remastered original album is paired on vinyl with a unique presentation of the album without its signature guitar leads—a chance for seasoned fans and aspiring shredders to appreciate what makes this album a must hear for guitar players the world over. This special double vinyl package—one red, one yellow—comes to record stores for RSD Black Friday."
    },
    {
    "Artist": "William Shatner/The Cramps",
    "Album": "Garbageman",
    "Format": "LP",
    "Label": "Demented Punk",
    "Quantity": 1200,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605254:360",
    "More Info": "This special limited edition split maxi-single pairs pop-culture icon William Shatner's mind-blowing interpretation of The Cramps' punk classic \"Garbageman\" (a cover that Rolling Stone hailed as a \"growling and expertly melodramatic version\"), teamed with the original 1980 recording that inspired it—performed by the legendary Cramps themselves and produced by Alex Chilton. Shatner’s \"Garbageman\" (produced by Osaka Popstar's John Cafiero) is the second single from the #1 Billboard charting album Dr. Demento Covered in Punk. This Shatner x Cramps RSD Black Friday exclusive release is pressed on 12\" neon yellow vinyl, with bonus tracks by both artists, and exclusive unreleased content unavailable anywhere else! Taking it a step further, Demented Punk commemorates the culture-clash with amazing new front cover art by Cramps illustrator Stephen Blickenstaff. Created in homage to his original Bad Music for Bad People cover illustration (shown on the back of this release), the new piece beams in the likeness of the legendary Shatner in place of the late great Cramps front man Lux Interior. Must be seen AND heard to be believed..."
    },
    {
    "Artist": "Slipknot",
    "Album": "All Out Life/Unsainted",
    "Format": "7\" Vinyl",
    "Label": "Roadrunner",
    "Quantity": 5000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605217:360",
    "More Info": "The song whose lyrics gave their newest album its name, but doesn't appear on it gets its first physical US release on this special picture disc 7\" for RSD Black Friday."
    },
    {
    "Artist": "Bruce Springsteen",
    "Album": "Western Stars b/w The Wayfarer",
    "Format": "7\" Vinyl",
    "Label": "Legacy",
    "Quantity": 4750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606744:360",
    "More Info": "Taken from the critically-acclaimed album Western Stars, Bruce Springsteen presents an RSD Black Friday exclusive 7\" single of \"Western Stars\" b/w \"The Wayfarer.\" Western Stars draws inspiration in part from the Southern California pop records of the late '60s and early '70s, and its release in June 2019 was heralded as \"his best new work in a decade\" by Esquire magazine."
    },
    {
    "Artist": "Squirrel Nut Zippers",
    "Album": "Christmas Caravan",
    "Format": "LP",
    "Label": "Hollywood",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592953:360",
    "More Info": "Riding high on the strength of their 1996 album \"Hot\", Squirrel Nut Zippers released their holiday album, Christmas Caravan in 1998. Relying heavily on original material, the crew created an unconventional album that revives swing and hot jazz, tweaking it with ironic humor, yet remaining reverential of the music's heritage. Christmas Caravan delivers a good time, thanks to their enthusiastic performances and strong songwriting. Catch the band on their third annual holiday tour this December!"
    },
    {
    "Artist": "Steep Canyon Rangers",
    "Album": "North Carolina Songbook",
    "Format": "CD",
    "Label": "Yep Roc Records",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605218:360",
    "More Info": "GRAMMY-Award winning bluegrass outfit Steep Canyon Rangers brought a special surprise to attendees of their performance at Merlefest 2019. To honor their home state, the Rangers performed a selection of songs from the artists of North Carolina. Featuring unsung Carolinian heroes like Ola Belle Reed and Elizabeth Cotten to world-renowned performers like Thelonious Monk, Doc Watson, James Taylor and Ben E. King, the Rangers' live North Carolina Songbook performance shows why the Tar Heel State continues to celebrate their legacy of musical excellence and influence that dates back over a century."
    },
    {
    "Artist": "Steppenwolf",
    "Album": "Steppenwolf",
    "Format": "LP",
    "Label": "Sundazed Music",
    "Quantity": 1700,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605222:360",
    "More Info": "Heavy Metal Thunder! You couldn't go anywhere in the blazing summer of '68 without hearing \"Born To Be Wild\" blaring, and its inclusion in the iconic film Easy Rider the following year cemented it as a rallying cry for bikers and countless other counterculture miscreants. On their debut album, Steppenwolf (fronted by John Kay's menacing rasp) reach new levels of deafening heaviness, ripping through a set of originals and attitude-filled covers, simultaneously forging a name for the sounds of an emerging genre. Pressed at RTI on clear vinyl and packaged in an elaborate foil jacket, this is the first ever reissue of the highly-coveted mono version of the album."
    },
    {
    "Artist": "Tamba 4",
    "Album": "California Soul",
    "Format": "LP",
    "Label": "Elemental Music",
    "Quantity": 1440,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593141:360",
    "More Info": "Finally unearthed and being released 50 years later, California Soul is a light, breezy, previously-unissued bossa-pop album from one of Rio De Janeiro's most influential '60s bands, recorded and mixed by Rudy Van Gelder. Produced for release by Zev Feldman and Greg Caz, this long lost studio album was mastered by Kevin Gray at Cohearent Audio. 180g black vinyl."
    },
    {
    "Artist": "Cecil Taylor",
    "Album": "Indent",
    "Format": "LP",
    "Label": "ORG Music",
    "Quantity": 1750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593214:360",
    "More Info": "Indent, a live solo album by Cecil Taylor, was recorded in Ohio in March 1973. It was originally released on Taylor's own Unit Core label, subsequently more widely released on the Freedom label, and has received critical praise, including a 4/5 star review from the Rolling Stone Jazz Record Guide. Previously out of print for decades, the phenomenal work is finally coming back to vinyl with an audiophile-grade pressing from Pallas Group. The album was remastered for vinyl at Infrasonic Mastering. This white color vinyl pressing is exclusively available for RSD Black Friday."
    },
    {
    "Artist": "Benmont Tench",
    "Album": "Nervous From the Fall",
    "Format": "7\" Vinyl",
    "Label": "",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607105:360",
    "More Info": "Two covers from Benmont Tench, Live from Rockwood Music Hall in NYC"
    },
    {
    "Artist": "Velvert Turner Group",
    "Album": "Velvert Turner Group",
    "Format": "LP",
    "Label": "ORG Music",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593194:360",
    "More Info": "Velvert Turner is largely known for being a protégé and student of Jimi Hendrix, who he met as a teenager in New York in the late '60s. The influence is immediately clear, with respect to both Turner's guitar work and vocals. Some have even mistaken his only album for a \"lost\" Hendrix recording, and it's hard to blame them. Velvert Turner Group's self-titled 1972 release, which aptly closes with a tribute to Hendrix (a cover of \"Freedom\"), has been out of print for decades. Now it's coming back to vinyl with a color pressing, mastered from original analog tapes, exclusively for RSD Black Friday."
    },
    {
    "Artist": "Tuxedo",
    "Album": "Get The Money",
    "Format": "7\" Vinyl",
    "Label": "Funk On Sight",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605233:360",
    "More Info": "Bonding over a shared love of Chic, Parliament and the other signs in the greater funk Zodiac, Mayer Hawthorne (Aquarius) and Jake One (Taurus), collectively known as Tuxedo present this exclusive 7\" release for RSD Black Friday, fresh off the release of their third studio album Tuxedo III. Featuring the previously unreleased tracks \"Get The Money\" feat. Ceelo Green and \"Own Thang\" feat. Tony! Toni! Toné!, Tuxedo is back to remind you that the dance floor will always be there to welcome you, whoever you are."
    },
    {
    "Artist": "Twiztid",
    "Album": "A Very Twiztid Christmas",
    "Format": "7\" Vinyl",
    "Label": "Majik Ninja",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593138:360",
    "More Info": "This 7\" single features a brand new holiday track \"A Very Twiztid Christmas\" as well as their previous Christmas song \"My Ornaments\" remixed by Young Wicked. Inside is a download code and a Christmas card—and 160 of them will be autographed and randomly inserted!"
    },
    {
    "Artist": "U2",
    "Album": "Three",
    "Format": "LP",
    "Label": "Island",
    "Quantity": 7000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607107:360",
    "More Info": "Originally released in Ireland in September 1979, the Three EP features three songs recorded at Windmill Lane Studios in Dublin with producer Chas De Whalley – \"Out Of Control\", \"Stories For Boys\" and \"Boy-Girl\". The A-side was chosen via a listener poll on Dave Fanning's RTÉ (Irish national radio) music show. All songs have been remastered for this numbered, limited edition RSD Black Friday reissue."
    },
    {
    "Artist": "Various Artists",
    "Album": "A Slice of Delicious Vinyl: Rare Singles & RMXS",
    "Format": "LP",
    "Label": "ORG Music",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593215:360",
    "More Info": "Iconic Los Angeles hip-hop label Delicious Vinyl is best known for early hits like Tone Loc's \"Wild Thing\" and \"Funky Cold Medina\", Young MC's \"Bust a Move\", and influential '90s hip-hop group The Pharcyde. For this compilation, we dug through the vaults to uncover some of Delicious Vinyl's rarest singles, remixes, and b-sides. The compilation comes on a limited edition red color vinyl pressing, exclusively for RSD Black Friday."
    },
    {
    "Artist": "Various Artists",
    "Album": "Desperado: The Soundtrack",
    "Format": "2 x LP",
    "Label": "Real Gone Music",
    "Quantity": 1800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605234:360",
    "More Info": "Like his buddy and occasional collaborator Quentin Tarantino, Robert Rodriguez is one of those film directors whose movies always come with incredible soundtracks. But it's tough to top the array of music he assembled for his gun 'n' guitar-slinging western Desperado, the 1995 sequel to his breakthrough debut El Mariachi. Not only was the Desperado score composed and performed by the L.A. bands Los Lobos (whose performance of \"Mariachi Suite\" won a Grammy for Best Pop Instrumental Performance) and Tito and Tarantula (memorably seen the following year as the house band at the Titty Twister in Rodriguez's From Dusk Till Dawn), but it also boasted contributions from Dire Straits, Link Wray, Carlos Santana, and the Latin Playboys among other artists. A blend of ranchera, Chicano, and garage rock, it's the perfect accompaniment for the blood-soaked imagery of the film…and for this, the first vinyl release of the soundtrack, we at Real Gone Music have created the perfect visual accompaniment as well. For the gatefold jacket housing our 2 X LP set, we commissioned Illustrator Matt Ryan Tobin to create one-of-a-kind, never-to-be-reprinted illustrated artwork, a lyrical yet lurid tableau that was approved not just by Robert Rodriguez but also by all four actors depicted (Antonio Banderas, Salma Hayek, Steve Buscemi, and Joaquim de Almeida). Inside the gatefold, we designed two 4-color inner sleeves offering production stills from the film, and pressed up 2500 copies in sultry \"Blood & Gunpowder\" vinyl. This pressing is exclusive for RSD Black Friday, and, again, both the jacket and the colored vinyl will never be reprinted... this might be the most collectible release we have ever created!"
    },
    {
    "Artist": "Various Artists",
    "Album": "Jazz Dispensary: The Dank D-Funk Blend",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607191:360",
    "More Info": "The next release in an ongoing Jazz Dispensary series. This new compilation for Record Store Day Black Friday highlights tracks from the Prestige catalog, in conjunction with the Prestige 70 campaign."
    },
    {
    "Artist": "Various Artists",
    "Album": "More Oar – A Tribute To The Skip Spence Album",
    "Format": "2 x LP",
    "Label": "Modern Harmonic",
    "Quantity": 1450,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605242:360",
    "More Info": "Plant, Beck, Waits, Skip! Celebrating its 20th anniversary, Modern Harmonic presents the first ever vinyl edition of More Oar – A Tribute To The Skip Spence Album. In addition to the full album–which features covers from Robert Plant, Beck, Mudhoney, Tom Waits, and others – this edition features the wild skeletal recording of \"Little Hands\" by The Flaming Lips that was originally intended as a collaboration with Robert Plant. A double LP pressed at Third Man, this set also includes liner notes from the original album's producer."
    },
    {
    "Artist": "Venom",
    "Album": "Manitou",
    "Format": "7\" Picture Disc",
    "Label": "Sanctuary Records",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461699206:360",
    "More Info": "Reproduction of 1984 7\" shaped picture disc of the single Manitou, which has been out of print for 35 years. Featuring the classic trio of Cronos, Mantas and Abaddon."
    },
    {
    "Artist": "Sid Vicious",
    "Album": "Sid Lives!",
    "Format": "2 x LP",
    "Label": "Jungle Records",
    "Quantity": 1350,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605216:360",
    "More Info": "The resurrection of SID VICIOUS continues with SID LIVES' - a 2xLP set of Sid's four last-ever shows, containing 39 tracks, mostly previously unreleased and packaged with comprehensive 8,000-word notes in the gatefold sleeve. It tells the story of Sid: firstly in an eyewitness account from surviving guitarist Steve Dior; secondly in a lengthy Sid, Nancy and Sex Pistols day-by-day timeline from pre-Pistols early days to his demise (and inevitable Nancy death theories); plus a song-by-song background. Since his death Sid has come to symbolize the Sex Pistols - always courting controversy he out-did old college-mate Johnny Rotten in the punk outrage stakes. With an impressive rock'n'roll voice and an abundance of attitude, just three memorable solo singles was all that he left - plus an industry of posters, documentaries and films. These recordings, backed by the New York Dolls' late rhythm section of Arthur Kane and Jerry Nolan along with guitarist Steve Dior (at that time trading together as 'The Idols'), show the direction Sid would have gone for his next recordings had he lived. This is the definitive Sid Vicious release for all fans of the punk-rock scene. TRI-COLOR (RED, WHITE & BLUE) VINYL."
    },
    {
    "Artist": "Larry Mullins + Mike Watt",
    "Album": "\"1969\" (Parts I and II): A Tribute to Scott Asheton",
    "Format": "7\" Vinyl",
    "Label": "ORG Music",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593209:360",
    "More Info": "Larry Mullins (aka Toby Dammit) and Mike Watt team up for a tribute to the late Scott Asheton, founding member and original drummer of The Stooges. Mullins and Watt previously played together in the most recent iteration of The Stooges. The 7\" vinyl release features their take on The Stooges' \"1969\", divided into two parts. The single is exclusively available for RSD Black Friday. Half of the pressing comes on a blue and yellow split color vinyl, with the other half on standard black vinyl. The two editions will be randomly mixed, so you're in for a surprise."
    },
    {
    "Artist": "Hank Williams",
    "Album": "The 1940 Recordings",
    "Format": "7\" Vinyl",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603514:360",
    "More Info": "The songs featured on this RSD Black Friday 45 RPM 7” single catch Williams at age 18 on homemade recordings. Coupled with last year's 7\" release The First Recordings 1938, these two 7's represent the earliest known recordings of Hank Williams. Newly restored and remastered by the Grammy-Award winning Hank Williams team!"
    },
    {
    "Artist": "John Williams and Anne-Sophie Mutter",
    "Album": "Across The Stars: Special Edition",
    "Format": "LP",
    "Label": "Verve",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461592972:360",
    "More Info": "Legendary film composer John Williams conducts five exceptional movie themes from the world-famous Star Wars saga in stunning new adaptations written especially for his superstar violinist friend and collaborator Anne-Sophie Mutter. The music ranges from \"Yoda’s Theme\" from The Empire Strikes Back and \"Luke and Leia\" from Return of the Jedi to more recent pieces such as \"Across the Stars\" from Attack of the Clones and \"Rey’s Theme\" from The Force Awakens. This unique 12\" combines all the Star Wars tracks from the album Across the Stars, with the exclusive vinyl release of \"Princess Leia’s Theme\" from A New Hope. The b-side with an artfully engraved image of the Death Star. Limited to 6,000 numbered albums globally."
    },
    {
    "Artist": "The Wrens",
    "Album": "Silver",
    "Format": "2 x LP",
    "Label": "Craft Recordings",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461593163:360",
    "More Info": "The 1994 Grass Records debut album from New Jersey's The Wrens, for the first time on vinyl. Celebrating its 25th anniversary with a double vinyl release on coke bottle clear vinyl."
    },
    {
    "Artist": "Acid Witch",
    "Album": "Black Christmas Evil",
    "Format": "7\" Vinyl",
    "Label": "Witch House",
    "Quantity": 750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607104:360",
    "More Info": "The first physical release, on red vinyl, naturally, of holiday-themed tracks released digitally in 2018."
    },
    {
    "Artist": "Altitudes and Attitudes",
    "Album": "Get It Out",
    "Format": "12\" Picture Disc",
    "Label": "MRI",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604977:360",
    "More Info": "Picture Disc of the recently released album Get It Out, is the second release and first full-length from Altitudes & Attitude, a collaboration between Frank Bello and David Ellefson, bassists for Anthrax and Megadeth respectively."
    },
    {
    "Artist": "Canned Heat",
    "Album": "Canned Heat Christmas Album",
    "Format": "LP",
    "Label": "Friday Music",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604983:360",
    "More Info": "Celebrate RSD Black Friday with the world's finest rock, blues and boogie band Canned Heat as they release for the first time ever on vinyl the classic Canned Heat Christmas Album. Classic holiday songs like \"Deck The Halls\", \"Santa Claus is Coming To Town\", \"Jingle Bells\" are joined by Canned Heat boogie staples — they were one of the nation's first jam bands — \"Christmas Boogie\" and \"Shake 'N Boogie\". Mastered by Canned Heat associate/producer Joe Reagoso for its first release on vinyl, all tracks and artwork are from the authorized Canned Heat Music and Fito de la Parra archives, and the white vinyl release comes housed in a unique die-cut can-shaped cover."
    },
    {
    "Artist": "Chai",
    "Album": "WAGAMA-MANIA",
    "Format": "12\" Picture Disc",
    "Label": "Burger Records",
    "Quantity": 350,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604987:360",
    "More Info": ""
    },
    {
    "Artist": "Patsy Cline",
    "Album": "Sweet Dreams: The Complete Decca Masters 1960-1963",
    "Format": "3 x LP",
    "Label": "Third Man Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605177:360",
    "More Info": "An amazing 3xLP set including all of Patsy Cline's Decca Studio masters, all of Patsy Cline and The Jordanaires hits, classics and so much more. A hauntingly beautiful collection, and an essential piece of the American music puzzle. This collection has never been released on vinyl and for Record Store Day Black Friday it's available on pink, purple and yellow pastel vinyl in a tri-gatefold sleeve."
    },
    {
    "Artist": "Bill Conti",
    "Album": "Masters of the Universe (Original Soundtrack)",
    "Format": "2 x LP",
    "Label": "Notefornote",
    "Quantity": 800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605032:360",
    "More Info": "He-Man and the Masters of the Universe made their retail debut in 1982 because executives at Mattel wanted their own line of action figures to compete with Kenner's blockbuster Star Wars toys. Masters of the Universe went on to huge success in the '80s and spawned comics, a cartoon series and a movie produced by Menahem Golan and Yoram Globus for their company Cannon Group. Originally released in 1987, the film stars Dolph Lundgren and Frank Langella. One of Cannon's last films, it would go on to become a cult classic. Bill Conti (Rocky, Karate Kid, For Your Eyes Only) Now the blockbuster score by Bill Conti (Rocky, Karate Kid, For Your Eyes Only) 2 X LP limited edition release for RSD Black Friday, with new cover art and colored vinyl to match the theme of the movie - LP1 is silver, reflecting He-Man’s famed POWER! Sword, LP2 is bone white to match Skeletor's famed face. There is a whole new generation of fans collecting the toys, watching the old cartoon series, and a new film is scheduled."
    },
    {
    "Artist": "Barns Courtney",
    "Album": "Barns Courtney Live From The Old Nunnery",
    "Format": "7\" Vinyl",
    "Label": "Capitol",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594414:360",
    "More Info": "Barns Courtney's scaled back performances of \"You And I\" and \"99\" Live from the Old Nunnery. Not available on vinyl anywhere else!"
    },
    {
    "Artist": "Fu Manchu",
    "Album": "Live at Roadburn 2003",
    "Format": "CD",
    "Label": "At The Dojo",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594657:360",
    "More Info": "To celebrate RSD Black Friday, At The Dojo Records releases Fu Manchu's complete incendiary performance at the 2003 edition of the Roadburn Festival Netherlands on limited edition LP and CD. The band recently unearthed the original professional recordings taken directly from the soundboard and had them specifically mastered for this release. This is a legendary Fu set, and includes classics \"Squash That Fly,\" \"Hell On Wheels,\" \"Boogie Van\" and \"King Of The Road.\" \"Playing Roadburn back in 2003 was a blast!”, Scott Hill, lead vocals/guitar of Fu Manchu says. \"It was the year before we put out Start The Machine and we played a couple of songs from it live for the first time on that tour. One of the songs that's on this live record, \"I Wanna Be,\" is a different arrangement than what ended up on the final studio release. We're stoked that the show was recorded and that people will get to hear it. Always a good time playing at Roadburn!\""
    },
    {
    "Artist": "Fu Manchu",
    "Album": "Live at Roadburn 2003",
    "Format": "LP",
    "Label": "At The Dojo",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594657:360",
    "More Info": "To celebrate RSD Black Friday, At The Dojo Records releases Fu Manchu's complete incendiary performance at the 2003 edition of the Roadburn Festival Netherlands on limited edition LP and CD. The band recently unearthed the original professional recordings taken directly from the soundboard and had them specifically mastered for this release. This is a legendary Fu set, and includes classics \"Squash That Fly,\" \"Hell On Wheels,\" \"Boogie Van\" and \"King Of The Road.\" \"Playing Roadburn back in 2003 was a blast!”, Scott Hill, lead vocals/guitar of Fu Manchu says. \"It was the year before we put out Start The Machine and we played a couple of songs from it live for the first time on that tour. One of the songs that's on this live record, \"I Wanna Be,\" is a different arrangement than what ended up on the final studio release. We're stoked that the show was recorded and that people will get to hear it. Always a good time playing at Roadburn!\""
    },
    {
    "Artist": "Gray",
    "Album": "Shades Of...",
    "Format": "3 x LP",
    "Label": "Ubiquity Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604999:360",
    "More Info": "1979, Downtown New York, Gray was making industrial music with sound. Jean-Michel Basquiat played the guitar with a metal file, Michael Holman played masking tape and steel ball bearings, Justin Thyme abstracted the keys, as Nick Taylor played his guitar with historical restraint. Famed painter Jean Michel-Basquiat was one of the co-founders of the band Gray. This anthology features their previously limited self-release plus unreleased material, and remixes from Todd Rundgren, Hank Shocklee, King Britt, Sal P (Liquid Liquid), Deantoni Parks, Tewz, Free The Robots, and The Gaslamp Killer, along with features from Amir Yaghmai and Kool Keith."
    },
    {
    "Artist": "Daryl Hall & John Oates",
    "Album": "Home For Christmas",
    "Format": "LP",
    "Label": "Friday Music",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605001:360",
    "More Info": "The first vinyl release for the 2006 holiday album from the #1 selling duo of all time. Holiday classics and a heartfelt tribute to The Band on \"Son Of A Carpenter (Christmas Must Be Tonight)\" as well as Christmas-themed tunes from their own catalog like \"No Child Should Ever Cry on Christmas\" and the title track \"Home For Christmas\" appear on the limited edition translucent red vinyl RSD Black Friday release."
    },
    {
    "Artist": "Peter Holsapple Combo",
    "Album": "Christmas Must Be Tonight",
    "Format": "7\" Vinyl",
    "Label": "Omnivore Recordings",
    "Quantity": 700,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605180:360",
    "More Info": "A brand new Peter Holsapple holiday gift: covers by The Band and The DBs on a color vinyl 7\" single"
    },
    {
    "Artist": "Homeshake",
    "Album": "Helium Remixes",
    "Format": "LP",
    "Label": "Sindelyn",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605003:360",
    "More Info": "Homeshake - aka former Mac Demarco guitarist Peter Sagar - released his fourth album Helium in February of 2019. He asked some of his favorite musicians - who have inspired him - to remix some of the tracks from the album. This RSD Black Friday release (on translucent grape vinyl) features remixes by some of the buzziest electronic artists today including Skepta, Laurel Halo, Jesse Lanza, DJ Taye, DJ Paypal, Foodman, Project Pablo, Ciel, and others."
    },
    {
    "Artist": "Thad Jones & Mel Lewis Orchestra",
    "Album": "All My Yesterdays",
    "Format": "3 x LP",
    "Label": "Resonance Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594436:360",
    "More Info": "All My Yesterdays is the first official release of the recordings of the Thad Jones/Mel Lewis Orchestra at the legendary Village Vanguard in NYC on February 7, 1966 and March 21, 1966 endorsed by the estates of Thad Jones, Mel Lewis and the Village Vanguard. Originally released as a 2CD set in 2016, this deluxe triple gatefold 3LP edition comes with an expansive 16-page insert providing rare photos by Chuck Stewart, Raymond Ross, Ray Avery and Jan Persson, essays by executive producer and original recording engineer George Klabin, associate producer Chris Smith (author of The View from the Back of the Band: The Life and Music of Mel Lewis), longtime Vanguard Jazz Orchestra arranger and pianist Jim McNeely and more! All of the living musicians who played on these recordings also contributed their accounts via interviews, including saxophonists Jerry Dodgion, Eddie Daniels and Marv \"Doc\" Holladay, trumpeter Jimmy Owens, trombonists Garnett Brown and Tom McIntosh, along with bassist Richard Davis. Limited edition of 2,000 on 180-gram black vinyl. Mastered by Bernie Grundman and pressed by Record Technology Inc. at 33 1/3RMP."
    },
    {
    "Artist": "Lenny Kaye & The Fleshtones",
    "Album": "Lost on Xandu",
    "Format": "7\" Vinyl",
    "Label": "Yep Roc Records",
    "Quantity": 450,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594714:360",
    "More Info": ""
    },
    {
    "Artist": "Julia Kent",
    "Album": "Green and Grey (Expanded)",
    "Format": "2 x LP",
    "Label": "The Leaf Label",
    "Quantity": 400,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594713:360",
    "More Info": "Canadian cellist/composer Julia Kent's celebrated 2011 second album Green and Grey gets its first vinyl release across two discs, on green and grey coloured vinyl (naturally). This RSD Black Friday release also features the Last Day in July EP which preceded the album, as well as two previously unreleased tracks from the album sessions. The double LP will be released in a gatefold sleeve, with artwork 'remixed' from the original album. Green and Grey explores the intersections between the human world and the natural world, the melding of the technological and the organic, using Kent's now-trademark looped and layered cello, electronics, and field recordings. It references the patterns and repetitions that exist in nature often mirrored in human creations and also the complexity and fragility of our relationships, with one another and with the world that surrounds us."
    },
    {
    "Artist": "Lisa Loeb",
    "Album": "Stay (I Missed You) 25th Anniversary",
    "Format": "LP",
    "Label": "Furious Rose",
    "Quantity": 800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605024:360",
    "More Info": "In celebration of the 25th anniversary of her chart-topping debut single \"Stay (I Missed You)\" hitting #1 on the U.S. charts (the first time ever by an unsigned artist) Grammy Award-winning American recording artist Lisa Loeb commemorates the milestone with the release of a special limited edition 12\" color vinyl of her seminal 1994 classic off of the Reality Bites soundtrack and 1995 album Tails. Produced by Loeb and Juan Patino, including four additional never-before-released live versions of fan favorites \"Stay (I Missed You),\" \"Waiting for Wednesday,\" \"Truthfully\" and \"I Do\" recorded in Japan in January 2013 with her band Nine Stories."
    },
    {
    "Artist": "Monster Movie",
    "Album": "Last Night Something Happened (Expanded)",
    "Format": "LP",
    "Label": "Graveface",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605042:360",
    "More Info": "Reissue of this now legendary shoegaze record from Christian Savill (Slowdive) and Sean Hewson (Eternal). It was originally pressed in 2002 and was limited to 500 units. If you want to score a copy originals fetch $75+. We're pressing this for the first time in 17 years on 180 gram colored vinyl in a deluxe stoughton gatefold jacket. Comes with a bonus 7\" that contains material from their first-ever EP (never before released on vinyl)."
    },
    {
    "Artist": "Pink Purple",
    "Album": "Red",
    "Format": "LP",
    "Label": "Jackpot Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605183:360",
    "More Info": "Pink Purple features Kliph Scurlock and John Huff. RED was recorded in 2010 during winter break from the Flaming Lips' Embryonic tour, entirely with analog synths and equipment from the Flaming Lips live tour. The band's encyclopedic knowledge of classic British rock/prog/psych shine throughout the tracks, weaving together the history of progressive rock and that of the Flaming Lips. Cover artwork by designer Dave Thomas (Mogwai,Vashti Bunyan). These recordings have never been released and will only be available for RSD. Will Include download with 3 bonus tracks."
    },
    {
    "Artist": "Leon Redbone",
    "Album": "Strings And Jokes, Live in Bremen 1977",
    "Format": "2 x LP",
    "Label": "Made In Germany",
    "Quantity": 300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605018:360",
    "More Info": "Wanderer between the worlds. No other words can describe the musical work of Leon Redborne. His first official stage appearance took place in 1971 at the Mariposa Folk Festival in Orillia, Ontario, and soon after he began performing in local clubs where he became famous with his unique style. His trademarks were a perfect suit (white jacket, black trousers), dark sunglasses, a moustache and a white fedora. Best known for his interpretations of music from the Depression Era--Blues, Ragtime, Folk and Tin Pan Alley—laying on top his remarkable singing style. Influenced by the music of Fats Waller, Jelly Roll Morton, Jimmy Rodgers or Irving Berlin, his interpretations are legendary. Both concerts on this RSD Black Friday release took place in Bremen, Northern Germany, in 1977 and show two different sides of Leon Redbone. At the first concert, at the \"Glocke\", he was accompanied by tube player Jonathan Dorn, and the second, at the \"Post-Aula\" was a solo concert, pure and simple. Both are electrifying because of his unique performance and the combination of Blues and influences from Folk-Jazz. He sings, yodels, murmurs and hums and knows to fascinate his fans with his warm and outstanding voice. A must have for every fan of traditional and not commonplace music."
    },
    {
    "Artist": "Buffy Saint-Marie",
    "Album": "Illuminations",
    "Format": "LP",
    "Label": "Craft Recordings",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594440:360",
    "More Info": "50th anniversary release of this seminal electronic album, featuring the psychedelic classic \"God is Alive, Magic is Afoot.\"  Cut from the analog master, pressed on 180-gram opaque yellow vinyl at QRP and housed in a tip-on jacket."
    },
    {
    "Artist": "Raymond Scott",
    "Album": "The Jingle Workshop: Midcentury Musical Miniatures 1951-1965",
    "Format": "2 x CD",
    "Label": "Modern Harmonic",
    "Quantity": 300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605192:360",
    "More Info": "Tingling tartness of jingle perfection! In addition to being a pioneer of early electronic music, Raymond Scott generated hymns to hunger, odes to pudding and pilsner, and crafted carols for countless other products, elevating the form of advertisement to an art. If Zappa had written music for commercials, it's not hard to think his approach would have been similar! This first ever collection contains varied styles in both instrumentation and vocalization, previously unavailable electronic works, and a zine-style insert with rare photos and a reproduction of a 1964 interview with Raymond himself. Products may contain soy, wheat, dairy, or Mel Tormé."
    },
    {
    "Artist": "Raymond Scott",
    "Album": "The Jingle Workshop: Midcentury Musical Miniatures 1951-1965",
    "Format": "2 x LP",
    "Label": "Modern Harmonic",
    "Quantity": 800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605192:360",
    "More Info": "Tingling tartness of jingle perfection! In addition to being a pioneer of early electronic music, Raymond Scott generated hymns to hunger, odes to pudding and pilsner, and crafted carols for countless other products, elevating the form of advertisement to an art. If Zappa had written music for commercials, it's not hard to think his approach would have been similar! This first ever collection contains varied styles in both instrumentation and vocalization, previously unavailable electronic works, and a zine-style insert with rare photos and a reproduction of a 1964 interview with Raymond himself. Products may contain soy, wheat, dairy, or Mel Tormé."
    },
    {
    "Artist": "Steep Canyon Rangers",
    "Album": "North Carolina Songbook",
    "Format": "LP",
    "Label": "Yep Roc Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605219:360",
    "More Info": "GRAMMY-Award winning bluegrass outfit Steep Canyon Rangers brought a special surprise to attendees of their performance at Merlefest 2019. To honor their home state, the Rangers performed a selection of songs from the artists of North Carolina. Featuring unsung Carolinian heroes like Ola Belle Reed and Elizabeth Cotten to world-renowned performers like Thelonious Monk, Doc Watson, James Taylor and Ben E. King, the Rangers' live North Carolina Songbook performance shows why the Tar Heel State continues to celebrate their legacy of musical excellence and influence that dates back over a century. This first edition of the North Carolina Songbook arrives on North Carolina Flag Tri-Color vinyl."
    },
    {
    "Artist": "Tune-Yards",
    "Album": "Sorry To Bother You (Original Score)",
    "Format": "LP",
    "Label": "4AD",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607109:360",
    "More Info": "Vinyl release of the original score for Boots Riley's acclaimed 2018 film Sorry To Bother You starring Lakeith Stanfield and Tessa Thompson."
    },
    {
    "Artist": "Various Artists",
    "Album": "Rhythm Showcase, Vol. 1",
    "Format": "LP",
    "Label": "Daptone Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605240:360",
    "More Info": "Daptone Records is ready to wrap you in a sonic embrace of soulful sounds from across the seven seas. Introducing The Daptone Rhythm Showcase. Sink your teeth into this baker's dozen of tantalizing, previously unreleased songs and other deep cuts and diasporic dialogues from across space and time. Get ready to move to this exquisite collection of sultry sounds stretching from the five boroughs of New York to the bustling megacities of West Africa, the deserts of Morocco, the sacred and psychedelic landscapes of the Native American West and beyond. Musical medicine for the body, mind and soul: once again Daptone delivers."
    },
    {
    "Artist": "Various Artists",
    "Album": "Philip K. Dick's Electric Dreams: Original Soundtrack",
    "Format": "LP",
    "Label": "SPACELAB9",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605045:360",
    "More Info": "The score for the acclaimed anthology series Philip K Dick's Electric Dreams comes to life for the first time on fabulous vinyl! Featuring tracks from renowned composers Harry Gregson-Williams, Bear McCreary, Cristobal Tapia de Veer, Olafur Arnalds, Mark Isham and BT on \"Electric Blue\" vinyl. Includes an 18\" x 24\" poster featuring original artwork."
    },
    {
    "Artist": "Various Artists",
    "Album": "Merry Christmas From King Records",
    "Format": "LP",
    "Label": "Sundazed Music",
    "Quantity": 800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605239:360",
    "More Info": "A stocking full of yuletide cheer from King Records and their eclectic roster. Originally released for Christmas 1959, this is the first ever reissue, pressed on festive red vinyl!"
    },
    {
    "Artist": "Various Artists",
    "Album": "File #733 U.F.O. - Further Investigation",
    "Format": "2 x LP",
    "Label": "Modern Harmonic",
    "Quantity": 700,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605237:360",
    "More Info": "What do you get when you combine a 1966 album of a man interviewing survivors of alien abductions with new music from the likes of modern psych beacons Kikagaku Moyo, Heron Oblivion, Al Lover, Mugstar, Earthen Sea, Demian Castellanos, Holy Mountain Top Removers, Jeffrey Alexander, Terceiro Olho de Marte, and White Manna? ...not sure but you’re going to need two turntables to find out. This odd collaboration is both the first reissue of a strange spoken word record, and a separate LP of modern drone and psych that works as the perfect backdrop to the words of Jack Jenkins and Sid Padrick, these are two fabulous albums that combine to form one magnificent experience."
    },
    {
    "Artist": "Tony Joe White",
    "Album": "That On The Road Look \"Live\"",
    "Format": "2 x LP",
    "Label": "Real Gone Music",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605232:360",
    "More Info": "The only live album recorded at Tony Joe White's peak... and it's never been available at retail before. Recorded in the fall of 1971 while TJW was opening for Creedence Clearwater Revival, this show became the proverbial \"legendary lost live album,\" and for good reason: Warner Bros. recorded the concert on multitrack tape, fully intending it to be released. But for some reason lost to the mists of time, the album never came out until Rhino Handmade released it on CD in 2010 via their website. Which means it never went to regular retail at all in any format, and that's a real shame, because you could make a good argument that it's the best Tony Joe White album of 'em all, with a set list to die for, a great band (featuring Duck Dunn on bass), pristine fidelity, and plenty of Swamp Fox attitude. This exclusive RSD Black Friday white vinyl pressing comes inside a gatefold jacket featuring a front cover cut-out displaying the art on one of two inner sleeves, with great liner notes by Ben Vaughn."
    },
    {
    "Artist": "Yacht Rock Revue",
    "Album": "Doobie Bounce / What a Fool Believes (Live in Boston)",
    "Format": "7\" Vinyl",
    "Label": "Amplified",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594450:360",
    "More Info": "A quick hit of Yacht Rock from the \"Greatest Show on Surf and the finest tribute to '70s light rock to ever perform anywhere. Ever.\" The original track \"The Doobie Bounce\" on the A-side, with a classic Doobie bounce on the flip!"
    },
    {
    "Artist": "Jon Batiste",
    "Album": "Chronology of a Dream: Live at the Village Vanguard",
    "Format": "LP",
    "Label": "Verve",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594531:360",
    "More Info": "Recorded live at the historic Village Vanguard in NYC in the fall of 2018 during Jon Batiste's residency.  Companion piece to the August release of Anatomy of Angels: Live at the Village Vanguard. This title includes more of the raucous, full band material Jon Batiste, and his hometown New Orleans, are often associated with. Featuring eight new tracks and an interlude."
    },
    {
    "Artist": "Black Label Society",
    "Album": "Nuns & Roaches",
    "Format": "LP",
    "Label": "Metal/Entertainment One",
    "Quantity": 2400,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603550:360",
    "More Info": "A six song EP originally recorded in 1999."
    },
    {
    "Artist": "Broncho",
    "Album": "Bad",
    "Format": "LP",
    "Label": "Park The Van",
    "Quantity": 900,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604981:360",
    "More Info": "Bad is a selection of remixes from Broncho's latest album Bad Behavior, on red splatter vinyl. This limited edition release is for all the good boys and girls. It features remixes of Broncho songs by real sweeties like of Montreal, Yeasayer, Methyl Ethel, Generationals, and Computer Magic and we hope it makes you boogie and feel really good."
    },
    {
    "Artist": "James Brown",
    "Album": "Live at Home: The After Show",
    "Format": "LP",
    "Label": "UMe",
    "Quantity": 5000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594581:360",
    "More Info": "A complement to the 50th anniversary release of Live at Home With His Bad Self (which itself is an expansion of a 1969 live show that was heavily edited into the LP 'Sex Machine'), this RSD Black Friday exclusive is the after-show set, featuring extended versions of rare (released) cuts, new mixes, a duet with Marva Whitney and some revealing stage patter."
    },
    {
    "Artist": "Jackson Browne & Leslie Mendelson",
    "Album": "Human Touch",
    "Format": "LP",
    "Label": "Inside Recordings",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604973:360",
    "More Info": "The \"Human Touch\" single is featured in the HIV/AIDS documentary titled 5B. Pressed on 180g black vinyl for RSD Black Friday."
    },
    {
    "Artist": "Cardi B",
    "Album": "Gangsta Bitch Music Vol. 1",
    "Format": "LP",
    "Label": "EMPIRE",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594590:360",
    "More Info": "The mixtape that started it all for Cardi B."
    },
    {
    "Artist": "Cheap Trick",
    "Album": "Gimme Some Truth",
    "Format": "7\" Vinyl",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603521:360",
    "More Info": "A song from the latest Cheap Trick album, and a song for the season, pressed on a red vinyl 7\" single."
    },
    {
    "Artist": "Alex Chilton",
    "Album": "My Rival",
    "Format": "10\" Vinyl",
    "Label": "Omnivore Recordings",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606701:360",
    "More Info": "Previously unissued tracks by Alex Chilton, engineered by Chris Bell, and featuring new liner notes from Rich Tupica and Elizabeth Hoehn (aka Lesa Aldridge). The first release of these tracks is for RSD Black Friday."
    },
    {
    "Artist": "Colonel Les Claypool's Fearless Flying Frog Brigade",
    "Album": "Live Frog Sets 1 & 2",
    "Format": "3 x LP",
    "Label": "Prawn Song",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594633:360",
    "More Info": "From the warped mind of Primus' frontman comes the official RSD Black Friday release of Colonel Les Claypool's Fearless Flying Frog Brigade's Live At The Great American Music Hall. This two-set, 12 track collection was recorded live over two nights in San Francisco and is available for the first time ever on three 140g transparent green vinyl LPs. Set 1 includes five Claypool originals bookended by superb King Crimson and Pink Floyd covers, while Set 2 is comprised of an unabridged performance of Pink Floyd's legendary 1977 concert album, Animals. This release is limited to 3000 copies worldwide and serves as both a whimsical and potent homage to some of Claypool's biggest musical influences."
    },
    {
    "Artist": "The Comet Is Coming",
    "Album": "The Afterlife",
    "Format": "LP",
    "Label": "Verve",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594530:360",
    "More Info": "The Comet Is Coming is: Danalogue (synths), Betamax (drums) and King Shabaka (saxophone) and they follow up their critically acclaimed Trust in The Lifeforce of the Deep Mystery with The Afterlife EP. \"The two records can be seen as companions, that cannot exist without each other, like day and night, light and dark, creation and destruction. They were made together, at the same time, and have always been intended to be experienced together,\" says Danalogue. \"The Afterlife has been a topic of deep consideration and one of the keys to spiritual mythology around the world for millenia... The idea of a form of continuation of consciousness from our perceived reality into another state brings an extra dimension of meaning into the gravitas of our actions in this life, our respect and reverence for our ancestors, as well as the sense of a continuum of life over an infinite, timeless void.\""
    },
    {
    "Artist": "Alice Cooper",
    "Album": "Dragontown",
    "Format": "2 x LP",
    "Label": "Nashville Catalog/eOne",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606704:360",
    "More Info": "First time on 2LP Colored Vinyl!! Dragontown is the fifteenth solo album by Alice Cooper. It was released in 2001 on Spitfire Records, and is coming on RSD Black Friday for the first time on 2 x LP Colored Vinyl. Like Brutal Planet, the album displays a heavier metal style than many of his previous releases."
    },
    {
    "Artist": "Czarface",
    "Album": "The Odd Czar Against Us",
    "Format": "LP",
    "Label": "Silver Age",
    "Quantity": 2200,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594630:360",
    "More Info": "Odds are that you’ll love this one: The Odd Czar Against Us is a 12 track album from CZARFACE debuting on RSD Black Friday. Bored with beating down the regular bad guys, Czarface takes his cosmic reach and sonic superpowers to uncharted territory. Expect the unexpected and keep your head on a swivel, as Czarface returns fresh for 2025, yet in time for RSD Black Friday 2019. Debuting at record stores on an exclusive colored vinyl pressing, housed in a jacket featuring an exclusive variant cover."
    },
    {
    "Artist": "Miles Davis",
    "Album": "Miles in Tokyo",
    "Format": "2 x LP",
    "Label": "Get On Down",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594629:360",
    "More Info": "Miles Davis was on the verge of forming one of his most acclaimed ensembles in 1964. It was this year that he travelled to perform in Japan for the first time, bringing with him 3/4ths of the musicians that would form his famed \"second great quartet\": Herbie Hancock on piano, Ron Carter on double bass, and Tony Williams on drums. In addition, the jazz legend brought along saxophonist Sam Rivers to replace the recently exited George Coleman. Davis and Rivers never developed any major chemistry and frequently found their distinct styles clashing (or perhaps dueling) in their performances. Rivers would ultimately be dismissed from the group at the end of their trip, leading to the arrival of Wayne Shorter, and the inception of the second great quintet. The partnership of Miles Davis and Sam Rivers may have been short-lived, but it did produce the live album Miles In Tokyo. The record is a rare jewel in Miles Davis' discography, featuring high-energy live versions of songs by Rodgers & Hart, Cole Porter, and Richard Carpenter, as well as a restlessly fast-paced take on the Davis staple \"So What\". This collection has previously only been available in Japan, but is now presented on vinyl for the first time in America by Get On Down, just in time for RSD Black Friday."
    },
    {
    "Artist": "Dr. John",
    "Album": "Babylon",
    "Format": "LP",
    "Label": "Silver Age",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594632:360",
    "More Info": "When Dr. John hit the studio in 1968 to record Babylon, America was in a very turbulent period. On top of that, Dr. John was being pursued by various Los Angeles authorities for a handful of criminal offenses. It was, in his own words: \"a heavy time for me.\" This set the stage for Babylon being a reflection of the chaotic and tumultuous time that he was living in. He and his band dove deeper into the voodoo-inflected psychedelic rock and the R&B of Gris-Gris, while touching upon elements of free jazz and Captain Beefheart-style avant garde. Babylon stands out as a psychedelic swamp of apocalyptic lyrical content, drunk, disorienting experimentation, and a fascinating entry into Dr. John's catalogue well-worthy of his expansive legacy. Out of print on vinyl for 40 years, Get On Down is all too eager to reissue this unique recording for RSD Black Friday. In keeping with the album's hallucinogenic sound, it is presented on trippy never to be repeated splatter-colored vinyl and housed in a deluxe gatefold jacket."
    },
    {
    "Artist": "Edan",
    "Album": "Beauty and the Beat",
    "Format": "LP",
    "Label": "Lewis Entertainment",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594626:360",
    "More Info": "While Edan's critically acclaimed debut, Primitive Plus, was a celebration of hip-hop's golden age and a true throwback, his sophomore album, Beauty And The Beat, is a vast musical collage that contains many different influences; Hip-hop, rock, pop, dusty breaks, hazy loops, luxurious off-kilter samples and curveball tempo changes that are all crafted into one cohesive piece of art. In 2015, FACT placed it at number 30 on the \"100 Best Indie Hip-Hop Records of All Time\" list. In 2013 NME placed it at number 392 on the \"500 Greatest Albums of All Time\" list."
    },
    {
    "Artist": "Ace Frehley",
    "Album": "Frehley's Comet Live...",
    "Format": "LP",
    "Label": "Metal/Entertainment One",
    "Quantity": 2700,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603555:360",
    "More Info": ""
    },
    {
    "Artist": "Liam Gallagher",
    "Album": "Why Me? Why Not.",
    "Format": "LP Picture Disc",
    "Label": "Warner Records",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605020:360",
    "More Info": "A picture disc version of the new solo album from Oasis' Liam Gallagher."
    },
    {
    "Artist": "Jerry Garcia Band",
    "Album": "GarciaLive Volume One: March 1st, 1980 Capitol Theatre",
    "Format": "LP Box Set",
    "Label": "Round Records/ATO Records",
    "Quantity": 5000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594587:360",
    "More Info": "First ever LP release of the first installment in the Garcialive Series, bringing complete, previously unreleased landmark live performances in Jerry Garcia's career to listeners, remixed and mastered from 24 track recordings! Vol.1 showcases the Jerry Garcia Band's performance at the Capitol Theatre from 3/1/1980 across a 5LP Boxset!"
    },
    {
    "Artist": "Gov't Mule",
    "Album": "Bring On The Music - Live at the Capitol Theatre: Vol 3",
    "Format": "LP",
    "Label": "Provogue",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604933:360",
    "More Info": "Volume 3 of the series celebrating Gov’t Mule’s 25 years as a band is a multi-colored LP with matching cover."
    },
    {
    "Artist": "Johnny Griffin / Eddie \"Lockjaw\" Davis Quintet",
    "Album": "Ow! Live at the Penthouse",
    "Format": "2 x LP",
    "Label": "Reel To Real",
    "Quantity": 750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605012:360",
    "More Info": "Official release of the previously unissued live recordings of the Johnny Griffin-Eddie \"Lockjaw\" Davis Quintet, featuring Horace Parlan, Buddy Catlett and Art Taylor, from 1962. Released in partnership with the estates of Johnny Griffin and Eddie \"Lockjaw\" Davis. Deluxe limited-edition 180 gm LP, mastered by Bernie Grundman Mastering. Remastered audio transferred directly from the original 350 10\" tapes at 7 1/2 IPS. Includes extensive booklet with rare photos; essays by journalist Ted Panken, pianist Michael Weiss, co-producer Zev Feldman and Corry Weeds, plus interviews with drum icon Kenny Washington, saxophone colossus James Carter and more!"
    },
    {
    "Artist": "Herbie Hancock",
    "Album": "Directstep",
    "Format": "LP",
    "Label": "Get on Down",
    "Quantity": 2200,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594627:360",
    "More Info": "Throughout the 1970s, legendary jazz pianist and composer Herbie Hancock engaged in a prolonged period of experimentation across sounds and recording formats, releasing several albums for Columbia that were only issued in Japan. 1979's Directstep was one such album, one that made use of a new form of recording technology called \"Direct-To-Disc.\" This method recorded masters, in real time, to acetate discs, rendering incredibly high fidelity LP pressings, but sacrificing the ability to edit or overdub, a challenge Hancock and his group were more than up to. Directstep utilized other technological advancements as well, incorporating brand new electronic instrument technology such as the electronic wind instrument the Lyricon, the freshly released Propet-5 synthesizer, and of course the Sennheiser Vocoder which would become a key part of the artist's arsenal during his electro-funk period in the 1980s. Beyond all that, Directstep is an incredibly solid collection of Herbie Hancock material, featuring stirring remakes of Hancock staples \"Butterfly\" and \"I Thought It Was You\" as well as brand new track \"Shiftless Shuffle.\" Get On Down is proud to present this reissue of Directstep, a gem of jazz-fusion, available on vinyl for the first time in 30 years for RSD Black Friday!"
    },
    {
    "Artist": "John Lee Hooker",
    "Album": "Black Night Is Falling Live at The Rising Sun Celebrity Jazz Club (Collector's Edition)",
    "Format": "2 x LP",
    "Label": "Justin Time Records",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603562:360",
    "More Info": "Known to music fans around the world as the \"King of the Boogie,\" John Lee Hooker endures as one of the true superstars of the blues genre: the ultimate beholder of cool. His work is widely recognized for its impact on modern music – his simple, yet deeply effective songs transcend borders and languages around the globe. \"Recorded at the Rising Sun Celebrity Jazz Club in Montreal, Quebec, on May 5, 1977, Black Night Is Falling finds John Lee Hooker in fine voice and backed by a driving band composed of John Garcia on guitar, Steve Jones on bass, and Larry 'Wild Man' Martin on drums, with the end result being an excellent example of Hooker at his best. Highlights include impressive romps through Hooker's signature tunes, \"Boom Boom,\" which simply blazes with raw energy here, and \"One Bourbon, One Scotch, One Beer,\" which is delivered as a wonderfully paced barroom cautionary tale. This is what the live Hooker sounded like with a sympathetic band behind him, a band that luckily wasn't afraid to push him a little.\" - All Music. The Collectors Edition coming for RSD Black Friday iincludes a bonus disc of unreleased material (a 17 min jam of \"Rock Steady\" plus three \"Rock Steady\" remixes) and a brand new cover portrait of John Lee Hooker by John Rummen."
    },
    {
    "Artist": "Ian & Sylvia Tyson",
    "Album": "The Lost Tapes",
    "Format": "2 x LP",
    "Label": "Stony Plain Records",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605004:360",
    "More Info": "Regarded as pioneers of the folk & Americana genre, Ian & Sylvia first came to prominence in the early ‘60s Greenwich Village and Yorkville folk scenes, performing alongside Bob Dylan (they were also managed by Albert Grossman), Joni Mitchell, and Gordon Lightfoot (who they made famous by being the first to record “Early Morning Rain”) and headlining at the now-famous 1963 Newport Folk Festival. Ian's composition \"Four Strong Winds\" is now considered a standard and a CBC poll in 2005 named it the \"most essential\" piece of Canadian music. Ian & Sylvia were one of the first artists to explore an electric Country Rock sound, recording with both New York and Nashville musicians. In early 2019 Sylvia discovered a box of old 1/4\" analog tapes in her attic that were professionally recorded in the early 1970s in front of a live studio audience. More than twenty previously unreleased recordings included many of Ian & Sylvia's classics, but also enough recordings that had never been included on any Ian & Sylvia album to make up a full album, presented here as a double vinyl release for RSD Black Friday."
    },
    {
    "Artist": "Insane Clown Posse",
    "Album": "Flip The Rat",
    "Format": "2 x LP",
    "Label": "Psychopathic Records",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594635:360",
    "More Info": "Insane Clown Posse's Flip The Rat album was a hit with both juggalos and collectors alike. Flip The Rat accompanied their studio album Fearless Fred Fury and was only available with a purchase of that album. Features from artists Ouija Macc, Big Hoodoo and DJ Paul make this 12 track album a must-have for any fan, and for the first time it's pressed to double vinyl."
    },
    {
    "Artist": "JBS",
    "Album": "More Mess On My Thing",
    "Format": "LP",
    "Label": "Now-Again Records",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594625:360",
    "More Info": "Here it is, rumored no more: the demo Bootsy Collins and his band recorded for James Brown in 1969 that won them the title \"The J.B.'s\" – and changed the course of popular music. Also included is the complete version of \"When You Feel It, Grunt If You Can,\" presenting two never-issued songs in a 22-minute medley, and the unreleased instrumental \"The Wedge.\" The companion piece to Now-Again's first-ever issue of the lost J.B.'s album These Are The J.B.'s (NA 5119). All tracks mixed by Mario Caldato, directly from Brown’s original multi-track masters. Contains extensive booklet with full annotation, liner notes by Brown historian Alan Leeds and never-before-published photos."
    },
    {
    "Artist": "Jinjer",
    "Album": "Macro",
    "Format": "LP",
    "Label": "Napalm Records",
    "Quantity": 750,
    "PhotoURL": "https://recordstoreday.com/Photo/418461606721:360",
    "More Info": "A marbled LP version of their new album."
    },
    {
    "Artist": "Johnathan Fire*Eater",
    "Album": "Wolf Songs For Lambs",
    "Format": "LP",
    "Label": "Third Man Records",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605015:360",
    "More Info": "Jonathan Fire*Eater's acclaimed and long out-of-print influential album is back in print. \"Jonathan Fire*Eater is the reason I moved to NYC and started a band.\" - Nick Zinner (Yeah Yeah Yeahs). LIMITED \"STATION COFFEE BROWN\" VINYL EXCLUSIVE TO RSD STORES. Remastered. 150 Gram Vinyl."
    },
    {
    "Artist": "Rolfe Kent",
    "Album": "Stan & Ollie Original Motion Picture Soundtrack",
    "Format": "LP",
    "Label": "Music Soundtrack/eOne",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603553:360",
    "More Info": ""
    },
    {
    "Artist": "Jenny Lewis",
    "Album": "On The iPhone",
    "Format": "7\" Vinyl",
    "Label": "Warner Records",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605010:360",
    "More Info": ""
    },
    {
    "Artist": "Huey Lewis",
    "Album": "Plansville",
    "Format": "7\" Vinyl",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603524:360",
    "More Info": "Previously unreleased tracks from Huey Lewis!"
    },
    {
    "Artist": "Life of Agony",
    "Album": "The Sound of Scars",
    "Format": "LP",
    "Label": "Napalm Records",
    "Quantity": 450,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605021:360",
    "More Info": "A black/red splattered vinyl version of the latest album."
    },
    {
    "Artist": "Lizzo",
    "Album": "Coconut Oil EP",
    "Format": "LP",
    "Label": "Atlantic Records",
    "Quantity": 5500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605025:360",
    "More Info": "Lizzo's first EP, released in October 2016, comes to vinyl for the first time, on a milky white pressing with a coconut-scented insert! \"There's self-exploration. There's self-love. Then there's self-realization,\" Lizzo told Rolling Stone. \"'Coconut Oil' is the ultimate ode to self-care and to my process. I'm not there yet, but I'm creating my music so I can get there.\""
    },
    {
    "Artist": "The Marhsall Tucker Band",
    "Album": "New Year's in New Orleans - Roll Up '78 and Light Up '79",
    "Format": "2 x CD",
    "Label": "Ramblin Records",
    "Quantity": 900,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594644:360",
    "More Info": "\"Let's show the people coast to coast that we here in New Orleans can party! Are you ready to roll '78 and light up 79?!\" announces the boisterous (and probably slightly buzzed) emcee introducing The Marshall Tucker Band to the tight-knit community of joint-passing, beer-cheersing rock 'n' rolling regulars at The Warehouse, New Orleans' legendary 1970s music hall. Not only would the audience of 2,000+ longhairs enjoy the New Year's Eve concert that night, but so would a huge audience of radio listeners rockin' in simulcast nationwide. The emcee claimed that this was the largest radio audience ever to hear a broadcast and at the time, it probably was. The band elevated themselves to the occasion and delivered an absolutely smokin' performance of what were already their most memorable and cherished hits. Sourced from the original 24-track tapes. Mixed in Macon, Georgia in 2019 by Paul Hornsby, the original Capricorn Records producer who recorded and produced their first six gold and platinum albums. Featuring never before published photos by The Warehouse's photographer, Sidney Smith, plus images of archival documents form the recording engineers."
    },
    {
    "Artist": "The Marhsall Tucker Band",
    "Album": "New Year's in New Orleans - Roll Up '78 and Light Up '79",
    "Format": "2 x LP",
    "Label": "Ramblin Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594644:360",
    "More Info": "\"Let's show the people coast to coast that we here in New Orleans can party! Are you ready to roll '78 and light up 79?!\" announces the boisterous (and probably slightly buzzed) emcee introducing The Marshall Tucker Band to the tight-knit community of joint-passing, beer-cheersing rock 'n' rolling regulars at The Warehouse, New Orleans' legendary 1970s music hall. Not only would the audience of 2,000+ longhairs enjoy the New Year's Eve concert that night, but so would a huge audience of radio listeners rockin' in simulcast nationwide. The emcee claimed that this was the largest radio audience ever to hear a broadcast and at the time, it probably was. The band elevated themselves to the occasion and delivered an absolutely smokin' performance of what were already their most memorable and cherished hits. Sourced from the original 24-track tapes. Mixed in Macon, Georgia in 2019 by Paul Hornsby, the original Capricorn Records producer who recorded and produced their first six gold and platinum albums. Featuring never before published photos by The Warehouse's photographer, Sidney Smith, plus images of archival documents form the recording engineers. Double LP, gatefold."
    },
    {
    "Artist": "Dave Matthews Band",
    "Album": "Live At The Hollywood Bowl",
    "Format": "LP Box Set",
    "Label": "Bama Rags Records",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604992:360",
    "More Info": ""
    },
    {
    "Artist": "JD McPherson",
    "Album": "\"Red Bows For A Blue Girl\" / \"Holly, Carol, Candy and Joy\"",
    "Format": "7\" Vinyl",
    "Label": "New West Records",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594702:360",
    "More Info": "This is a new 7\" of two Christmas songs. \"Red Bows for A Blue Girl\" is a brand new original record specifically for RSD Black Friday. \"Holly, Carol, Candy and Joy\" is a b-side from the album SOCKs which was released in November of 2018."
    },
    {
    "Artist": "NAS",
    "Album": "Stillmatic",
    "Format": "2 x LP",
    "Label": "Get On Down",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594631:360",
    "More Info": "2001 marked the release of Nas' fifth studio full-length, on which made the effort to re-establish himself in the underground style which first brought him to prominence. The title is even a nod to his own roots: Stillmatic, a clear and present reference and sequel of sorts to Illmatic. The move worked perfectly; Stillmatic was hailed by critics as a brilliant return to form, earning rave reviews from rap outlets such as The Source and HipHopDX as well as from more mainstream publications like The Rolling Stone and The Village Voice. Now approaching two decades after the record's release, Get On Down proudly brings you this deluxe double LP reissue. Stillmatic, unavailable on vinyl since its original 2001 release, is now presented with remastered audio in a silver vinyl pressing exclusively for RSD Black Friday!"
    },
    {
    "Artist": "The National",
    "Album": "Live at the Greek Theatre, Berkeley, CA, 9/24 + 9/25/2018 (The Mike Millard Method)",
    "Format": "3 x Cassette",
    "Label": "4AD",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461607108:360",
    "More Info": "A three cassette release of the National's September 24th and 25th shows at the Greek Theatre in Berkeley, CA. Recorded by Erik Flannigan using legendary taper Mike \"The Mike\" Millard Method. Flannigan explained the idea behind using The Mike Millard Method in the cassette's liner notes, saying: \"Arguably the most celebrated audience taper of the period, Mike Millard, recorded in and around Southern California beginning in 1974 and continued into the early '90s. Millard's legend is built in part on the cunning and subterfuge he used to get his nearly 15-pound cassette deck and microphones into venues like the The Forum, Santa Monica Civic Auditorium, and The Roxy. For years I have pondered what made Millard's recordings so good, and eventually I had an idea: What if you recorded a concert today with the same equipment Millard used in 1977? Would it sound like his tapes? Would it tap into his Midas touch? The National was kind enough to let us test the Millard Method for two concerts at the Greek Theatre in Berkeley, California last September. These live recordings were made with vintage AKG 451E microphones and a restored Nakamichi 550 cassette deck which are identical to those used by Millard circa 1975-81. The idea was to see if we could recreate what Matt Berninger calls the \"juicy sonic magic\" Millard captured in his 1970s field recordings. Together with my friend and filmmaker David Dubois, we also produced a short documentary about Millard, his recording methods, and our attempt to recreate his work at the National shows in Berkeley, a venue that is utterly unchanged since the '70s. With the advent of smartphones, thousands of people routinely record part of the show when they attend a National concert or any other performance. Forty years ago, when nobody would dare do that, one man made it his life's work to preserve legendary concerts on tape."
    },
    {
    "Artist": "Naughty By Nature",
    "Album": "Poverty's Paradise (25th Anniversary Edition)",
    "Format": "2 x LP",
    "Label": "Tommy Boy Records",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461604940:360",
    "More Info": "2020 marks the 25th anniversary of the release of Poverty's Paradise. This album won the Best Rap Album Grammy at the 1996 Grammys, which was a new category that year. Anniversary edition comes on double 180g colored vinyl, with a bous 7\" single."
    },
    {
    "Artist": "The New Pornographers",
    "Album": "Fade Baby Fade",
    "Format": "7\" Vinyl",
    "Label": "Concord Records",
    "Quantity": 2450,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594584:360",
    "More Info": "Three never-before-released songs from the Canadian indie rock all-star group."
    },
    {
    "Artist": "New Riders of the Purple Sage",
    "Album": "Thanksgiving in New York City (Live)",
    "Format": "3 x LP",
    "Label": "Omnivore Recordings",
    "Quantity": 1800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605043:360",
    "More Info": "A Thanksgiving musical feast, recorded live on 11/23/72 at Academy of Music in New York City."
    },
    {
    "Artist": "Various Artists",
    "Album": "Jim Henson's Emmet Otter's Jug-Band Christmas",
    "Format": "LP",
    "Label": "Varese Sarabande",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594591:360",
    "More Info": "The world premiere release of the much-sought-after soundtrack SOLD OUT when released as part of RSD Black Friday 2018.  For fans that missed out and collectors who want to enjoy the soundtrack in a different way, this picture disc version for RSD BF 2019 features artwork from the beloved TV special.  The show first aired December 17, 1977 on HBO and features songs written by Paul Williams. Williams of course also penned the Academy Award-nominated song \"Rainbow Connection\" from The Muppet Movie, as well as #1 chart-topping song \"Evergreen,\" (for the Barbra Streisand vehicle A Star Is Born, for which he won a Grammy for Song of the Year and an Academy Award for Best Original Song), and numerous top ten and #1 hits for The Carpenters, Anne Murray, Three Dog Night and as a solo artist."
    },
    {
    "Artist": "Overkill",
    "Album": "The Electric Age",
    "Format": "2 x LP",
    "Label": "Metal/Entertainment One",
    "Quantity": 1800,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603552:360",
    "More Info": ""
    },
    {
    "Artist": "Charlie Parker",
    "Album": "The Magnificent Charlie Parker",
    "Format": "LP",
    "Label": "UMe",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594583:360",
    "More Info": "Super-rare early 12\" LP with classic David Stone Martin cover. Yellow Vinyl."
    },
    {
    "Artist": "Katy Perry",
    "Album": "Never Really Over/Small Talk",
    "Format": "LP",
    "Label": "Capitol Records",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594525:360",
    "More Info": "Limited edition double A-side colored vinyl 12\" featuring new music from Katy Perry - the latest hit single \"Never Really Over\" and the new track \"Small Talk\"!"
    },
    {
    "Artist": "Phish",
    "Album": "Story of the Ghost",
    "Format": "2 x LP",
    "Label": "Jemp Records",
    "Quantity": 8000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605182:360",
    "More Info": "Remastered, double 180g vinyl, foil-stamped set for RSD Black Friday."
    },
    {
    "Artist": "Pylon",
    "Album": "Cool/Dub",
    "Format": "7\" Vinyl",
    "Label": "New West Records",
    "Quantity": 900,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605191:360",
    "More Info": "Athens, Georgia has always been a hotbed for creative independent music. There exists a spirit that can be hardly found anywhere else in the world. The band Pylon emerged in the late '70s and early '80s out of art school and combined this spirit with their new wave, post-punk jangle pop and would come to influence the American pop and alternative scenes for decades to come. In celebration of the 40th anniversary of their first release, New West Records is proud to partner with the band for a reissue of their first 7\" single."
    },
    {
    "Artist": "The Record Company",
    "Album": "Early Songs and Rarities",
    "Format": "LP",
    "Label": "Concord Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594585:360",
    "More Info": "An album of material, including rarities and covers, no longer available."
    },
    {
    "Artist": "The Regrettes",
    "Album": "Holiday-ish (featuring Dylan Minnette)",
    "Format": "7\" Vinyl",
    "Label": "Warner Records",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605194:360",
    "More Info": ""
    },
    {
    "Artist": "Rockabye Baby!",
    "Album": "Lullaby Renditions of Snoop Dogg",
    "Format": "LP",
    "Label": "CMH Label Group",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605201:360",
    "More Info": "Lullaby renditions of Snoop Dogg classics in the Rockaby Baby style."
    },
    {
    "Artist": "Rodrigo Y Gabriela",
    "Album": "Mettal EP",
    "Format": "LP",
    "Label": "ATO Records",
    "Quantity": 2500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594586:360",
    "More Info": "Three previously unreleased metal covers, shedding light on some of Rodrigo Y Gabriela’s favorite foundational metal tunes."
    },
    {
    "Artist": "Royal Trux",
    "Album": "Quantum Entanglement",
    "Format": "LP",
    "Label": "Fat Possum Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605204:360",
    "More Info": "Not a greatest hits - but an epic starting point - tracks taken from multiple albums throughout the bands history. On yellow vinyl."
    },
    {
    "Artist": "Saint Motel",
    "Album": "ForPlay EP",
    "Format": "LP",
    "Label": "OnThe Records",
    "Quantity": 500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605209:360",
    "More Info": "A first-time vinyl release celebrating the ten year annivesary of this EP."
    },
    {
    "Artist": "Frank Sinatra",
    "Album": "My Way/My Way (Live)",
    "Format": "LP",
    "Label": "UMe",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594575:360",
    "More Info": "To celebrate the 50th anniversary of the iconic Frank Sinatra song, a special 45 RPM single in a new picture sleeve with a rare image, and a B-side seeing its first vinyl release."
    },
    {
    "Artist": "Sublime",
    "Album": "Roots of Sublime",
    "Format": "2 x LP",
    "Label": "UMe",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594574:360",
    "More Info": "A band of Long Beach rag-tag punks created a revolutionary blend of music that brought together a community of reggae, tattooed-punks, Rastafarians, surfers, Chicanos, hip-hoppers and others to define an entire era and lifestyle that lives on now more than ever. This collection celebrates the musical heroes and influences that inspired Sublime by pairing up their version with the original musical recording. RESPECT YOUR ROOTS!"
    },
    {
    "Artist": "Sugar Ray",
    "Album": "14:59",
    "Format": "LP",
    "Label": "RT Industries",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605223:360",
    "More Info": "20th anniversary reissue of Sugar Ray's triple-platinum selling album featuring Top 10 singles \"Someday\" and \"Every Morning.\" Out of print on vinyl since its original release, this new reissue is pressed on red vinyl. Audio has been remastered from the original tapes."
    },
    {
    "Artist": "Tank and the Bangas",
    "Album": "Live Vibes 2",
    "Format": "LP",
    "Label": "Verve",
    "Quantity": 2000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594527:360",
    "More Info": "A 2018 live performance from the 2017 NPR Tiny Desk Concert winners, at The Parlor Studio in their hometown New Orleans. For Record Store Day Black Friday on purple/yellow splattered vinyl."
    },
    {
    "Artist": "Tenacious D",
    "Album": "Blue Series: Don't Blow It, Kage",
    "Format": "7\" Vinyl",
    "Label": "Third Man Records",
    "Quantity": 0,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605225:360",
    "More Info": "The prophesy has come true! Tenacious D's Kyle Gass and Jack Black team up with Jack White on production to create a brand new one-sided single."
    },
    {
    "Artist": "They Might Be Giants",
    "Album": "Don't Let's Start",
    "Format": "LP",
    "Label": "Idlewild Records",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605230:360",
    "More Info": "They Might Be Giants' Don’t Let's Start EP, along with the unforgettable accompanying video, launched the band into national prominence back in 1987. Like the multiple pressings over that year, the reissue sports a unique colorway — this time an eyeball-melting neon green. The disc was remastered by UE Nastasi at Sterling Sound and was pressed on 180g crystal clear vinyl at United Record Pressing. This hand-numbered, limited edition, RSD Black Friday exclusive release will correspond with the reissue of the Brooklyn alternative legends' eponymous debut album in celebration of that record's 33 1/3 anniversary."
    },
    {
    "Artist": "Richard Thompson",
    "Album": "The Cold Blue: Original Motion Picture Score",
    "Format": "2 x LP",
    "Label": "New West Records",
    "Quantity": 1250,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605196:360",
    "More Info": "The Cold Blue is a 2019 documentary that focuses on footage shot directly from bomber planes during WWII with narration from surviving members of the 8th infantry.  Richard Thompson wrote and arranged the score to the movie, and its released on vinyl for the first time everas a double blue 180g vinyl set, with a worldwide pressing of 1500."
    },
    {
    "Artist": "Various Artists",
    "Album": "Jay & Silent Bob Reboot (Original Soundtrack)",
    "Format": "2 x LP",
    "Label": "Music Soundtrack/eOne",
    "Quantity": 3300,
    "PhotoURL": "https://recordstoreday.com/Photo/418461603554:360",
    "More Info": ""
    },
    {
    "Artist": "Various Artists",
    "Album": "Joni 75 A Joni Mitchell Birthday Celebration",
    "Format": "2 x LP",
    "Label": "Verve",
    "Quantity": 3000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594529:360",
    "More Info": "On Joni's 75th birthday, last November 7, a star-studded roster of musicians gathered to pay tribute to the legendary singer-songwriter. The evening was recorded and this vinyl release features performances by Brandi Carlile, Glen Hansard, Emmylou Harris, Norah Jones, Chaka Khan, Diana Krall, Kris Kristofferson, Los Lobos with La Marisoul, Cesar Castro & Xochi Flores, Graham Nash, James Taylor, Seal, Rufus Wainwright and more."
    },
    {
    "Artist": "Various Artists",
    "Album": "Matrix Reloaded (Music From and Inspired By The Motion Picture)",
    "Format": "3 x LP",
    "Label": "Warner Records",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605035:360",
    "More Info": "The soundtrack to the second film in the Matrix canon, a snapshot of the year in music 2003. Comes to vinyl for the first time in a Matrix-y transparent green triple vinyl set."
    },
    {
    "Artist": "Various Artists",
    "Album": "The Matrix Revolutions Music From the Motion Picture",
    "Format": "2 x LP",
    "Label": "Warner Records",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605038:360",
    "More Info": "The soundtrack to the third episode of the Wachowskis' epic vision comes to vinyl for the first time in an appropriately colored (coke-bottle green) double vinyl package."
    },
    {
    "Artist": "Various Artists",
    "Album": "Motown Rare & Unreleased",
    "Format": "LP",
    "Label": "UMe",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594580:360",
    "More Info": "Special color vinyl and all tracks on vinyl for the first time. Side B, tracks 1-4, are previously unreleased stereo mixes. Side B track 5 is previously unreleased."
    },
    {
    "Artist": "Various Artists",
    "Album": "Saturday Morning Cartoon's Greatest Hits",
    "Format": "2 x LP",
    "Label": "UMe",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594533:360",
    "More Info": ""
    },
    {
    "Artist": "Vinyl Me, Please",
    "Album": "The Best Record Stores in The United States",
    "Format": "Book",
    "Label": "Vinyl Me, Please",
    "Quantity": 1000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605244:360",
    "More Info": "A beautiful, colorful coffeetable book that features an essay on one record store from each of the 50 states, and recommendations for more than 175 record stores. With a foreword by Mark Farina."
    },
    {
    "Artist": "Vitamin String Quartet",
    "Album": "Vitamin String Quartet Performs the Nightmare Before Christmas",
    "Format": "LP",
    "Label": "CMH Label Group",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605246:360",
    "More Info": "The memorably quirky tunes sung by the citizens of Halloween Town are reinterpreted with animated string arrangements by Vitamin String Quartet. Songs like \"This Is Halloween,\" \"What's This?\" and \"Kidnap the Sandy Claws\" are spun into a whirlwind of violin, viola and cello. VSQ's take on the music of The Nightmare Before Christmas is, like the film itself, moody, beautiful and joyous all at once."
    },
    {
    "Artist": "Rufus Wainwright",
    "Album": "Come A Little Bit Closer",
    "Format": "7\" Vinyl",
    "Label": "BMG Rights Management (US) LLC",
    "Quantity": 1500,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605207:360",
    "More Info": "Live cover versions of Neil Young's \"Harvest Moon\" and Arcade Fire's \"Crown of Love\", pressed on 7\" translucent red vinyl."
    },
    {
    "Artist": "Paul Westerberg & Grandpaboy",
    "Album": "Stereo/Mono",
    "Format": "2 x LP",
    "Label": "Vagrant Records",
    "Quantity": 5000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461605179:360",
    "More Info": "The first vinyl release for Paul Westerberg (and Grandpaboy)'s 2002 double CD release."
    },
    {
    "Artist": "Frank Zappa",
    "Album": "Peaches En Regalia",
    "Format": "10\" Picture Disc",
    "Label": "UMe",
    "Quantity": 4000,
    "PhotoURL": "https://recordstoreday.com/Photo/418461594573:360",
    "More Info": "In celebration of HOT RATS' fiftieth anniversary, \"Peaches En Regalia\" and \"Little Umbrellas\" get their first-ever single release."
    }
 ]
