[
    {
      "Artist": "Ryan Adams",
      "Album": "Prisoner",
      "Format": "Cassette",
      "Label": "Blue Note",
      "Quantity": 1200,
      "PhotoURL": "http://recordstoreday.com/Photo/418458553164:284",
      "More Info": "Ryan Adams is an American singer-songwriter, musician, multi-instrumentalist, record producer and poet. He is best known for his solo career, during which he has released sixteen albums, and as a former member of alternative country band Whiskeytown. Adams has sold an impressive 4 millions albums in the US over his 20 year career. Prisoner, Ryan Adams' first original studio album since 2014, features his hit \"Do You Still Love Me?\" and is being released on cassette for RSD Black Friday."
      },
     {
     "Artist": "Tori Amos",
     "Album": "Native Invader Russia",
     "Format": "12\" Vinyl",
     "Label": "Verve",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458579220:360",
     "More Info": "Enigmatic Tori Amos is an accomplished singer-songwriter, pianist and musician. Classically trained, she has been releasing music since the mid 80s. She released Native Invader in 2017, which was inspired by visiting the Great Smoky Mountains, home of her Native American ancestors. For RSD Black Friday, Verve Records is releasing the limited edition Russian EP, featuring 4 songs from Native Invader. This EP comes complete with labels printed in Russian and pressed on orange colored vinyl. Tori's confessional style of writing sees her continuing to push boundaries with her music. Come with her on her most recent journey."
     },
     {
     "Artist": "Anthrax",
     "Album": "Carry On Wayward Son",
     "Format": "12\" Picture Disc",
     "Label": "Megaforce Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552523:360",
     "More Info": "These two outstanding tracks from Anthrax's For All Kings record are pulled and placed on a die-cut 12\" picture disc. Celebrate Record Store Day's Black Friday with amped up, Anthraxed up covers of songs from Kansas and The White Stripes."
     },
     {
     "Artist": "Dan Auerbach/Sonny Smith/Robert Finley",
     "Album": "Good Sound Comes Back Around Vol. 1",
     "Format": "7\" Vinyl",
     "Label": "Easy Eye Sound",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553744:360",
     "More Info": "Songs from upcoming EES releases by Dan Auerbach (\"Cellophane Angel\"), Sonny Smith (\"Pictures of You\") and Robert Finley (\"Medicine Woman\")."
     },
     {
     "Artist": "Albert Ayler & Don Cherry",
     "Album": "Vibrations",
     "Format": "LP",
     "Label": "ORG Music",
     "Quantity": 1100,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552251:360",
     "More Info": "Vibrations is the second album released by American free jazz saxophonist Albert Ayler’s quartet featuring Don Cherry, Gary Peacock and Sonny Murray. The album was recorded in Copenhagen in September of 1964. Originally issued by the Freedom label, it also been released under an alternate title, Ghosts. Previously out of print for decades, the recordings were remastered for an audiophile-grade pressing on 180gram vinyl at Pallas in Germany. This blue and white swirl color vinyl edition is limited to just 1,500 copies worldwide, available exclusively for Black Friday Record Store Day 2017."
     },
     {
     "Artist": "The Baroques",
     "Album": "The Baroques",
     "Format": "LP",
     "Label": "Sundazed Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552571:360",
     "More Info": "First-ever mono reissue of this extremely rare and mind melting 1967 lo-fi psych/garage classic! Originally released on the legendary Chess Records. Pressed on premium RTI vinyl. A must for the garage and psych aficionados. \"If Leonard Cohen barged into an Electric Prunes recording after obliterating his mind in an all-night glue-sniffing binge it might have sounded something like this.\" - RisingStorm.net"
     },
     {
     "Artist": "Chuck Berry",
     "Album": "The London Chuck Berry Sessions",
     "Format": "LP",
     "Label": "Brookvale Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552357:360",
     "More Info": "The London Chuck Berry Sessions is an album of studio recordings and live recordings by Chuck Berry, released by Cess Records in October 1972. Side One consists of studio recordings, engineered by Geoff Calver. Side Two features three live performances recorded by the PYE Mobile Unit, engineered by Alan Perkins, on February 3, 1972 at the Lanchester Arts Festival in Coventry England. The recordings include the sound of festival management trying in vain to get the audience to leave so that the next performers can take the stage: the crowd begins chanting \"We Want Chuck\". \"My Ding-a-ling\" from the live side of the album was edited to approximately four minutes for release as a single. It was Berry's first and only single to reach #1 in the US and the UK."
     },
     {
     "Artist": "Benjamin Booker",
     "Album": "Live For No One (Live From Columbus Theater, Providence, RI)",
     "Format": "10\" Vinyl",
     "Label": "ATO Records",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553204:360",
     "More Info": "Benjamin Booker is a 27 year old American musician, singer, songwriter and guitarist, born in Virginia Beach, VA. He was exposed to all types of music in his youth, and Booker cites artists as varied as The Gun Club, Blind Willie Johnson and T. Rex as influences. His music has been described as \"frenzied guitar-strumming and raw, soulful vocals that are hair-raising in intensity.\" Caroline and ATO Records are releasing Benjamin Booker - Live For No One (Live From Columbus Theatre, Providence, RI) for the first time ever on RSD Black Friday! This is a album of 5 unreleased live tracks from a stellar performance , including live versions of \"Right On You,\" \"Witness,\" \"Believe,\" \"Slow Drag Under,\" and \"Overtime.\" Buy this great live album on Black Friday and prepare to be wowed by a wonderful up-and-coming musician!"
     },
     {
     "Artist": "The Byrds",
     "Album": "You Movin'/Boston",
     "Format": "7\" Vinyl",
     "Label": "Sundazed Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552572:360",
     "More Info": "Gene Clark's upbeat rockers \"You Movin'\" and \"Boston\" fueled the dance floor mayhem there. These stunning songs are heard here in their earliest surviving versions! Limited edition colored vinyl w/gorgeous picture sleeve!"
     },
     {
     "Artist": "Eric Church",
     "Album": "Mistress Named Music",
     "Format": "7\" Vinyl",
     "Label": "Mercury Nashville",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553153:360",
     "More Info": "Eric Church is giving a special gift to fans this Record Store Day. He is releasing a special live 7\" with the FIRST song from his 2017 tour, \"Mistress Named Music,\" and the very LAST song from the same tour, \"Holdin' My Own!\" What a great idea, and one that is surely to keep his fans wanting more!"
     },
     {
     "Artist": "Gary Clark Jr",
     "Album": "Come Together",
     "Format": "12\" Vinyl",
     "Label": "Warner Bros",
     "Quantity": 2600,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552305:360",
     "More Info": "B-Side of this 12\" single is previously unreleased \"Come Together\"/\"Come Together Extended Mix\""
     },
     {
     "Artist": "Clutch",
     "Album": "Pitchfork & Lost Needles",
     "Format": "12\" Picture Disc",
     "Label": "Weathermaker Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552549:360",
     "More Info": "Pitchfork & Lost Needles is the third in a series of three Clutch picture disc releases in 2017. This is an essential piece of the Clutch canon, combining the early EP's \"Pitchfork\" and \"Passive Restraints\" with additional demo tracks from Transnational Speedway League and Robot Hive/Exodus."
     },
     {
     "Artist": "Cold War Kids",
     "Album": "Los Feliz Blvd",
     "Format": "10\" Vinyl",
     "Label": "Capitol Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553172:360",
     "More Info": "Cold War Kids is an American indie rock band from Long Beach, California who got together in 2014. They have released Los Feliz Blvd, a 10\" EP featuring intimate, acoustic recordings of tracks from the band's new album, LA Divine. With elegant, sparse instrumentation, the singles \"Love Is Mystical,\" \"Can We Hang On?\" and \"So Tied Up\" are stripped down to their emotional core. British singer/songwriter Bishop Briggs is featured on two tracks - the sizzling \"So Tied Up\" and a soulful version of Rihanna's \"Love On The Brain.\""
     },
     {
     "Artist": "Papa John Creech",
     "Album": "Papa John Creech",
     "Format": "LP",
     "Label": "Culture Factory USA",
     "Quantity": 1200,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559208:360",
     "More Info": "Papa John Creach (1917-1994) was an American blues violinist, who also played classical, jazz, be-bop, R&B, and acid rock. Early in his career, he performed with such luminaries as Louis Armstrong, Fats Waller, and Nat King Cole. Creach released his first solo album in 1971, titled simply Papa John Creach. Members of Jefferson Airplane made appearances on the album along with members of the Grateful Dead, Quicksilver Messenger Service, Santana, and Tower of Power. It was indeed a special album and also a special time in musical history. Culture Factory is proud to re-issue Papa John Creach's debut album on beautiful translucent blue vinyl with orginal label, a printed inner sleeve, cardboard jacket and LP spine folder."
     },
     {
     "Artist": "Danger Mouse Feat. Run The Jewels & Big Boi",
     "Album": "Chase Me",
     "Format": "12\" Vinyl",
     "Label": "Columbia Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552992:360",
     "More Info": "Six time Grammy winner and super producer Danger Mouse teams up with hip hop sensations Run the Jewels and rapper/songwriter Big Boi for \"Chase Me\", an exciting RSD Black Friday 12\" from the 2017 hit movie Baby Driver. All four musicians appear in car chase scenes in the video, along with stars from the movie. Spin this 12\" with the explicit version and the clean version on the A side and the instrumental and acapella versions on the B side! Only 2000 made in the US, so if you want this record, you're gonna have to \"chase me!\""
     },
     {
     "Artist": "Death From Above 1979",
     "Album": "Freeze Me/Keep It Real Dumb",
     "Format": "7\" Vinyl",
     "Label": "Warner Bros",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552303:360",
     "More Info": "Clear vinyl 7\" single with an unreleased B-side"
     },
     {
     "Artist": "DMC",
     "Album": "Back From The Dead: The Legend Lives",
     "Format": "12\" Vinyl",
     "Label": "Brookvale Records",
     "Quantity": 4000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552360:360",
     "More Info": ""
     },
     {
     "Artist": "Steve Earle",
     "Album": "El Corazon",
     "Format": "LP",
     "Label": "Warner Bros",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552298:360",
     "More Info": "This 1997 Steve Earle album is released on vinyl for the frst time, and comes with a lithograph exclusive to this Record Store Day Black Friday edition."
     },
     {
     "Artist": "The Flesh Tones",
     "Album": "Budget Buster",
     "Format": "LP",
     "Label": "Yep Roc Records",
     "Quantity": 1300,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552966:360",
     "More Info": "Whether you know them as the \"The Kings of Garage Rock\" or \"America's Garage Rock Band\", there's no debate that the Fleshtones are one of the hardest working (and rocking) bands of all time. They've stayed particularly busy in the past decade, releasing loads of new music that rivals the efforts of their forty-year career. To honor the Fleshtones, we're proud to present Budget Buster, a compilation of all their b-sides and rarities they've put out over the last ten years, many of which are out-of-print and difficult to find, plus two tracks that have never seen the light of day! Not to mention, Budget Buster arrives on explosive red and yellow splatter vinyl!"
     },
     {
     "Artist": "Game of Thrones",
     "Album": "Game of Thrones (Music From The HBO Series)",
     "Format": "LP Picture Disc",
     "Label": "WaterTower Music",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552966:360",
     "More Info": "Side A:ICE White Walker/Night King image from HBO 1) Wall of Ice 2) White Walkers 3) Hardhome Part 2 4) The Army of The Dead 5) Winter is Here Side B: FIRE Dragon image from HBO 1) Dracarys 2) Blood of the Dragon 3) Dragonstone 4)Spoils of War, Part 1 5) Gorgeous Beasts"
     },
     {
     "Artist": "Jerry Garcia & Howard Wales",
     "Album": "Side Trips, Volume One",
     "Format": "2 x LP",
     "Label": "ATO/Round Records",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553213:360",
     "More Info": "Legendary Grateful Dead leader Jerry Garcia and keyboardist collaborator Howard Wales recorded the Jazz/Rock Fusion album Side Trips, Volume One live at The Matrix in San Francisco in 1970! It was first released on CD in 1998, and is being issued by Caroline on Black Friday for the first time on vinyl in a 2LP gatefold package. Side Trips, Volume One contains four amazingly accessible jazz-rock improvisational performances, and will be something the whole family can enjoy."
     },
     {
     "Artist": "Gorillaz",
     "Album": "Humanz",
     "Format": "2 x LP Picture Disc",
     "Label": "Warner Bros",
     "Quantity": 4900,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552290:360",
     "More Info": "The latest album from Gorillaz, for the first time on picture disc format."
     },
     {
     "Artist": "Isaac Hayes",
     "Album": "The Spirit of Memphis",
     "Format": "2 x LP",
     "Label": "Craft Recordings",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553141:360",
     "More Info": "World famous soul singer Issac Hayes influenced thousands of musician over his multi-decade career, working for Stax Records and writing such classics as \"Soul Man\" and \"Shaft.\" To honor this legend who passed away in 2008, RSD Black Friday is releasing a 2LP set on colored vinyl, The Spirit of Memphis, featuring many songs from Hayes' career, and several songs previously unreleased on vinyl. This collection highlights Isaac's role as musician, songwriter, and producer and includes songs from not only his catalog, but from The Soul Children, David Porter, The Emotions and more. This release commemorates the great Isaac Hayes, who would have celebrated his 75th birthday this year, along with the 60th Anniversary of Stax Records, where Issac got his start in the early 1960s."
     },
     {
     "Artist": "Panduranga Henderson",
     "Album": "Ocean of Love",
     "Format": "LP",
     "Label": "Luaka Bop",
     "Quantity": 1250,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552565:360",
     "More Info": "In the early 1980s, Alice Coltrane Turiyasangitananda formed an ashram in Agora Hills, California. There a beautiful, multi-ethnic and multi generational religious community grew up around her. The highpoint of living in this very special and loving environment took shape on Sundays when Alice would lead the community in a musical ceremony, mixing both gospel and Indian chant, to create a music she wholly invented - it was something extraordinarily powerful. The Ashram is still there today. There are still some who live there and there is still a weekly Sunday service that is open for everyone. The folks who populated the Ashram world of Alice Coltrane Turiyasangitananda were a very special group of people. Many of the adult members were musicians before having moved there, and many of the younger followers have become musicians and film makers as they grew older. One these amazing artists is John Panduranga Henderson. Panduranga played organ, piano and sang with Ray Charles in the 1970's where he was a star performer in Ray's band. When he joined the Ashram, he became in essence a star performer there as well, though of course there were no 'stars'. Alice sitting at the organ would say, \"Panduranga\" and John would come to the front and let loose one of his amazing gospel-esque solos praising Rama or Vishnu or Jesus, Muhammad, Moses and more. He made one record under his own name - a record so obscure it's not listed on Discogs, nor found on the interweb? what?! Today, for you dear listener, we would like to present Panduranga Henderson's \"Ocean of Love.\" Om Shanti."
     },
     {
     "Artist": "Janis Joplin",
     "Album": "Janis Joplin's Greatest Hits",
     "Format": "LP",
     "Label": "Legacy Records",
     "Quantity": 3500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552987:360",
     "More Info": "In 1967, audiences at the Monterey Pop Festival experienced the powerful voice and stage presence of Janis Joplin, many for the very first time. Her work with Big Brother & The Holding Company and as a solo artist was a defining force in the changing soundscape of rock music in the 1960s. Her passionate vocals on \"Piece of My Heart,\" \"Cry Baby\" and the posthumous chart-topper \"Me and Bobby McGee\" inspired generations of female singers to pour their hearts out. Being released for the first time on vinyl in 27 years, Janis Joplin's Greatest Hits (originally released in 1973), will be repressed on green smoke colored vinyl in the U.S. for Record Store Day Black Friday 2017."
     },
     {
     "Artist": "Greg Lake",
     "Album": "\"I Believe In Father Christmas\"",
     "Format": "10\" Vinyl",
     "Label": "BMG Rights Management (UK) Ltd.",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552198:360",
     "More Info": "Special tribute release for the late Mr. Greg Lake of Emerson, Lake & Palmer and King Crimson. Side A features the orignal 1975 global holiday smash hit that launched his solo career, Side B features a rare out-of-print 2002 version. The cover art replicates the original 1975 release."
     },
     {
     "Artist": "Los Straitjackets",
     "Album": "Sing Along With Los Straitjackets",
     "Format": "LP",
     "Label": "Yep Roc Records",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552961:360",
     "More Info": "2001's Sing Along with Los Straitjackets was the first time the masked instrumental musicians let vocals appear on their tracks, an endeavor they would embark on again later with Deke Dickerson. Sing Along with Los Straitjackets features a party of musicians spanning all across the musical sphere, from Nick Lowe playing bass on his own \"Shake That Rat,\" to collaborations with Exene Cervenka, Mark Lindsay, The Trashmen, Tom Petty and the Heartbreakers' Mike Campbell, and even more. Being reissued on LP for the first time ever for Record Store Day Black Friday 2017, every Record Store Day Black Friday issue of the LP also comes with a bonus 45 single featuring two never before heard collaborations from the Sing Along with? sessions featuring Dave Alvin and Reverend Horton Heat (who also make an appearance on the album!)."
     },
     {
     "Artist": "Paul McCartney/Holidays Rule/The Decemberists",
     "Album": "\"Wonderful Christmastime\"/\"Jesus Christ\" (GREEN)",
     "Format": "7\" Vinyl",
     "Label": "Capitol Records",
     "Quantity": 3500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458579218:360",
     "More Info": "Paul McCartney has always been very supportive of RSD, and this year is no exception. Macca spreads some holiday cheer with two 7\" releases, one on red and one on green vinyl, featuring his classic \"Wonderful Christmastime.\" McCartney is backed up by The Roots on this track, and the B-side of the red vinyl release features Norah Jones with a live performance of \"Peace.\" If you saw him on his recent concert tour, you know Paul always gives 100%. This exclusive, limited edition RSD Black Friday release is no exception."
     },
     {
     "Artist": "Paul McCartney/Holidays Rule/Norah Jones",
     "Album": "\"Wonderful Christmastime\"/\"Peace\" (RED)",
     "Format": "7\" Vinyl",
     "Label": "Capitol Records",
     "Quantity": 3500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553197:360",
     "More Info": "Paul McCartney has always been very supportive of RSD, and this year is no exception. Macca spreads some holiday cheer with two 7\" releases, one on red and one on green vinyl, featuring his classic \"Wonderful Christmastime.\" McCartney is backed up by The Roots on this track, and the B-side of the red vinyl release features Norah Jones with a live performance of \"Peace.\" If you saw him on his recent concert tour, you know Paul always gives 100%. This exclusive, limited edition RSD Black Friday release is no exception."
     },
     {
     "Artist": "Wes Montgomery",
     "Album": "In Paris: The Definitive O.R.T.F.",
     "Format": "2 x LP",
     "Label": "Resonance Records",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552336:360",
     "More Info": "The Definitive O.R.T.F. recording captures the jazz guitar legend on his only tour of Europe, at the Theatre des Champs Elysees in Paris, France, on 3/27/65"
     },
     {
     "Artist": "Willie Nelson",
     "Album": "Spirit",
     "Format": "LP",
     "Label": "Modern Classic Recordings",
     "Quantity": 2200,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553086:360",
     "More Info": "Few country artists have had a bigger influence on the musical landscape than Wille Nelson. Born in 1933 in Abbott, TX, Ol' Willie is still going strong at the young age of 84! For RSD Black Friday, Modern Classics is re-releasing Spirit, Willie Nelson's forty-ninth studio album, originally released in 1996. The album differs from Nelson's other work because his band used fewer instruments on the recording (two guitars, piano, fiddle) and it has a more classical/Spanish influence. Spirit reached the US Country top 20 when it was released, and David Fricke from Rolling Stone describes it as \"low-key, acoustic, stripped to the rugged fundamentals of a good song and a superior voice.\" Spirit is an emotional concept album illustrating the forlorn tale of a man abandoned by the great love of his life. We follow him down the path of loss as he confronts grief, gets back on his feet, and eventually finds solace in acceptance. Beloved by those familiar with Nelson's deep catalog, Spirit remains highly revered amongst critics and fans alike. Likened to Bob Dylan's Time Out Of Mind or Waylon Jennings' Right For the Time, Spirit sees Nelson maturing most gracefully. Originally released in 1996, Spirit is issued here for the first time on colored vinyl as a special Record Store Day Black Friday release. It comes newly remastered with a deluxe, gatefold, 'tip-on' uncoated jacket, this is a chance to own this unique album in its most beautifully presented form."
     },
     {
     "Artist": "Willie Nelson",
     "Album": "Yesterdays Wine",
     "Format": "LP",
     "Label": "Friday Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552370:360",
     "More Info": "In 1973's Yesterday's Wine LP, Willie Nelson crafted one of the most artistically acclaimed albums in his huge catalog of recorded music. The LP is an insightful look into the the wrtiing and musicianship of this legendary artist at a time when he and friends like Waylon Jennings were considered too hip and outlaw for the confines of Nashville radio acceptance. It contains songs like the autobiographical \"Me & Paul\", the stellar title track and an incredible trove of balladry including \"December Day,\" \"It's Not For Me To Understand,\" and the gospel hits \"In God's Eyes\" and \"Family Bible.\" Yesterday's Wine has been long out of print on vinyl and is coming to record stores as part of the Friday Music 180g Audiophile Vinyl Series on burgundy vinyl, in a gatefold sleeve and with a poster depicting the cover art included."
     },
     {
     "Artist": "Leonard Nimoy",
     "Album": "Mr. Spock's Music From Outer Space",
     "Format": "12\" Vinyl",
     "Label": "Varese Sarabande",
     "Quantity": 1800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553156:360",
     "More Info": "Leonard Nimoy's Mr. Spock was unquestionably the most popular character on the original Star Trek series. His first record album, Leonard Nimoy Presents Mr. Spock's Music from Outer Space, was originally released in June 1967 on Dot Records. This entertaining and campy album has long been out of print on vinyl, and is a cult classic favorite for all Star Trek aficionados and lovers of Space in general. Varere Sarabande is re-releasing this amazing piece of mondo bizarro for RSD Black Friday. Pick up this great release on Black Friday and May The Force...wait, that's not right...Live Long and Prosper!"
     },
     {
     "Artist": "Gram Parsons & The Fallen Angels",
     "Album": "Live 1973 Featuring Emmylou Harris",
     "Format": "LP",
     "Label": "Sierra High Fidelity",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559270:360",
     "More Info": "Gram Parsons, an extremely revered and influential American singer, songwriter, guitarist, and pianist, famously passed away on September 19, 1973, in Joshua Tree, CA of a drug overdose. Live 1973 Featuring Emmylou Harris is a live album by Gram Parsons and the Fallen Angels, recorded at Sonic Studios in Hempstead, New York during a live radio broadcast from WLIR-FM. The recording came between Parsons' only two solo studio albums, GP, and Grievous Angel, but it was not released until 1982. This re-issue of Live 1973 Featuring Emmylou Harris is pressed on audiophile 180gram vinyl, utilizing Sierra Records 1982 original half-speed metal master, and was processed by the late Richard \"Slim\" Doss at the legendary Sheffield Lab Matrix. This beautiful deluxe edition comes with the original LP artwork, in an enhanced presentation silver foil, limited numbered jacket. It is a must have for any fan of the talented and troubled musician."
     },
     {
     "Artist": "Lee 'Scratch' Perry & The Full Experience",
     "Album": "Disco Devil",
     "Format": "12\" Vinyl",
     "Label": "Get On Down",
     "Quantity": 1800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552560:360",
     "More Info": "For Record Store Day Black Friday 2017, your friends at Get On Down bring you a beautiful package of roots reggae weirdness from the almighty Upsetter: Lee \"Scratch\" Perry. This red vinyl 12\" with a stamped outer sleeve features the song \"Disco Devil,\" recorded by the legendary Jamaican mad genius with the group The Full Experience, as a version of Max Romeo's \"Chase the Devil.\" But don't jump to conclusions based on the song title - musically this is as far as you can get from Saturday Night Fever. Thick, reverb-drenched dub/roots reggae laced with Perry's dusted vocals and brilliant work behind the boards are on the menu throughout. This cut is undeniably underrated in Perry's catalog and fans will eat this up, since it has always been hard to find on 7\" and 12\" for many years now."
     },
     {
     "Artist": "Iggy Pop",
     "Album": "New Values",
     "Format": "LP",
     "Label": "Friday Music",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552363:360",
     "More Info": "Iggy Pop is one of the original pioneers of punk rock and underground rock and roll. In 1979 he delivered his hard-hitting alternative classic New Values debut LP for Arista Records. Featuring the punk anthem \"Five Foot One\" and his rockin' collaboration with The Stooge's James Williamson, \"Don't Look Down\", New Values was a solid effort and continues to be one of the most revered albums today. Friday Music continues its 180g Audiophile Vinyl Series with this Black Friday release, complete with blue/black swirl vinyl, gatefold cover and 24 x 24 poster."
     },
     {
     "Artist": "Preservation Hall Jazz Band",
     "Album": "Run Stop & Drop!!",
     "Format": "12\" Vinyl",
     "Label": "Legacy Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552982:360",
     "More Info": "When it comes to New Orleans Jazz one name stands out, The Preservation Hall Jazz Band. The band gets it's name from the historic Preservation Hall venue located in New Orleans' French Quarter, where fans can hear them perform their own special style of New Orleans-style Jazz nightly on the classic stage. In August 2017, Record Store Day gathered record store folks from around the world for a week long conference and \"Summer Camp\". The Preservation Hall Jazz Band performed exclusively for RSD Summer Camp on August 21st, 2017, and the concert was recorded for posterity. It is being released to fans as Run Stop & Drop!! with a colorful jacket and custom inner sleeve for Black Friday 2017! The performance was powerful, animated and legendary. It was a very special night...pick up your copy on RSD Black Friday and come be a part of it!"
     },
     {
     "Artist": "Queen",
     "Album": "We Are The Champions/We Will Rock You",
     "Format": "12\" Vinyl",
     "Label": "Hollywood Records",
     "Quantity": 7500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553132:360",
     "More Info": "Celebrating the 40th anniversary of News of the World, this limited edition 12\" single features two of Queen's most iconic tracks, \"We Are The Champions,\" and \"We Will Rock You.\" Created exclusively for RSD Black Friday 2017, this 180-gram vinyl release features and exclusive cover and tracks remastered by Bob Ludwig in 2011."
     },
     {
     "Artist": "Nathaniel Rateliff & The Night Sweats",
     "Album": "Baby It's Cold Outside",
     "Format": "7\" Vinyl",
     "Label": "Stax",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553146:360",
     "More Info": "Nathaniel Rateliff & The Night Sweats, a unique Americian folk and rhythm and blues band, led by Denver, CO's adopted son Rateliff, are determined to make your holiday a little more cheerful this year. They are releasing the holiday 7\" \"Baby It's Cold Outside\"/\"Santa Baby\" on Stax Records on black vinyl. Limited to 3500 copies, this Record Store Day exclusive should make you and even Santa Claus dance and stomp his feet."
     },
     {
     "Artist": "Sonny Rollins",
     "Album": "Sonny Rollins On Impulse!",
     "Format": "LP",
     "Label": "Elemental Music",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552355:360",
     "More Info": "Reissue of the saxophone colossus' debut on Impulse! Records featuring pianist Ray Bryant (whose \"graceful, complex solos deserve considerable praise and attention\" says Harvey Pekar in JazzTimes), bassist Walter Booker and drummer Mickey Roker. Pressed on 180g black vinyl at United Pressing, and mastered from the original tapes recorded at Rudy Van Gelder studio, On Impulse! is being faithfully reissued with all the original artwork and liner note content, including an essay by legendary jazz writer Nat Hentoff. Thom Jurek writes in AllMusic.com review that the album \"feels as if it were a recording Rollins had to get out of his system. But thank goodness for us because it's a winner through and through.\" This album is also significant in that marks the only time Rollins and the soulful pianist Ray Byrant recorded together. Here the sparks fly on these five tasty jazz standards!"
     },
     {
     "Artist": "Ravi Shankar",
     "Album": "Portrait of Genius",
     "Format": "LP",
     "Label": "Culture Factory USA",
     "Quantity": 1200,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559239:360",
     "More Info": "Ravi Shankar, a very influential Indian musician and composer, was born in India in 1920. He was one of the best-known exponents of the sitar in the second half of the 20th century and influenced many other musicians throughout the world. Portrait of Genius was originally released in 1964, and is an essential album for any fan of Shankar or Indian music in general. For RSD Black Friday, Culture Factory is proud to re-issue Shankar's classic Portrait of Genius on mixed opaque purple vinyl with the orginal label, a printed inner sleeve, and cardboard jacket and LP spine folder."
     },
     {
     "Artist": "Sonny Clark Trio",
     "Album": "My Conception: The 1960 Sessions with George Duvivier and Max Roach",
     "Format": "2 x LP",
     "Label": "Tompkins Square",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552348:360",
     "More Info": "Newly remastered reissue of Sonny Clark Trio's LP on Time Records, 1960. Plus a second LP of outakes. Original liner notes by Nat Hentoff. New liner notes by Ben Ratliff. Includes previosuly unseen photographs from the session."
     },
     {
     "Artist": "Southside Johnny",
     "Album": "Southside Johnny: Detour Ahead - The Music of Billie Holiday",
     "Format": "LP",
     "Label": "Leroy Records",
     "Quantity": 1400,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552308:360",
     "More Info": "Recorded over two days in early January of 2017, Detour Ahead: The Music of Billie Holiday is John's tribute to the great Lady Day. Arranged, produced and mixed by Asbury Jukes saxophonist John Isley, the album is a ten-song offering of all original arrangements and interpretations of some of Billie's most classic songs as well as a few hidden gems."
     },
     {
     "Artist": "Steel Panther",
     "Album": "Lover The Bar (Bitchin' Picture Disc Edition)",
     "Format": "LP Picture Disk",
     "Label": "Kobalt/Steel Panther",
     "Quantity": 1400,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553010:360",
     "More Info": "Steel Panther is an American comedic glam metal band from Los Angeles, CA, formed in the early 2000s, and best known for their profane and humorous lyrics. They are also infamous for their exaggerated on-stage personae that parody the stereotypical 1980s \"glam metal\" lifestyle. They actually started their career at The Viper Room in LA, doing 80s hair metal covers and impersonating they bands they were covering. Lower The Bar is Steel Panther's fourth release, and for RSD Black Friday, they are gracing us with a picture disc version of the album. Titled the Bitchin' Edition Picture Disc, it features all the songs that are on Lower The Bar, including the Cheap Trick cover \"She's Tight,\" featuring Robin Zander on guest vocals. Steel Panther's Bitchin' Edition Picture Disc also includes one bonus track, and a download card which includes an additional bonus track."
     },
     {
     "Artist": "Yusuf/Cat Stevens",
     "Album": "The Laughing Apple",
     "Format": "LP Picture Disk",
     "Label": "Verve",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559183:360",
     "More Info": "One of the most influential singer-songwriters of all time releases his latest studio album, The Laughing Apple on a limited edition picture disc. The Laughing Apple features original songs and covers, though the covers on this album are Yusufs own. He celebrates some of his earliest material, with new presentations of the songs. Conceptually, The Laughing Apple returns to the journey of the Tillerman, as he recalls his travels and life lessons to a younger generation."
     },
     {
     "Artist": "The Sundays",
     "Album": "Static & Silence",
     "Format": "LP",
     "Label": "Fugitive",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552375:360",
     "More Info": "Acclaimed UK band The Sundays will release their third and final album Static & Silence, including the top ten hit \"Summertime\" for the first time on vinyl in the US market. Released excluslvely for Record Store Day's Black Friday, this 20th anniversary clear vinyl pressing is limited to 2000 copies."
     },
     {
     "Artist": "Tangerine Dream",
     "Album": "Electronic Meditation",
     "Format": "LP",
     "Label": "Varese Sarabande",
     "Quantity": 1800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553158:360",
     "More Info": "Tangerine Dream, a German electronic music group, released their debut album Electronic Meditation in June 1970. It is the only Tangerine Dream album to feature the line-up of Edgar Froese, Klaus Schulze and Conrad Schnitzler. Their mid-70s work has been profoundly influential in the development of electronic music styles such as new age and electronic dance music. For RSD Black Friday, Varese Sarabande is re-releasing Electronic Meditation in a special gatefold jacket. Pick up your own copy on Black Friday and start meditating!"
     },
     {
     "Artist": "Toto",
     "Album": "Hold The Line/Alone",
     "Format": "10\" Picture Disc",
     "Label": "Legacy Records",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552979:360",
     "More Info": "Sony Music is celebrating the 40th anniversary of the band Toto with the RSD Black Friday release of a special 10\" Picture disc. One side features the Toto classic \"Hold The Line,\" with artwork from the group's self-titled debut. The other side debuts a brand new song, \"Alone,\" with an exciting preview of the cover art for 40 Trips Around The Sun, a career-spanning Toto greatest hits album to be released February 2018."
     },
     {
     "Artist": "Twiztid",
     "Album": "Ain't Been Right",
     "Format": "7\" Vinyl",
     "Label": "Majik Ninja",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552322:360",
     "More Info": "A brand new Twiztid trak and a vintage holiday track on hand-numbered green vinyl."
     },
     {
     "Artist": "U2",
     "Album": "The Blackout",
     "Format": "12\" Vinyl",
     "Label": "Third Man Records",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458610006:360",
     "More Info": "The first physical music from the anticipated new U2 release, SONGS OF EXPERIENCE, due everywhere December 1. The 12” includes the original album version backed by an exclusive remix by the band’s longtime collaborator, Jacknife Lee. TMR’s “The Blackout” 12” will be extremely limited, with just one single pressing at Third Man Pressing, the label’s state-of-the-art vinyl production facility in Detroit. Black vinyl editions will be available at all participating Record Store Day shops, with 750 colored vinyl editions on offer exclusively at Third Man Records’ Nashville Storefront (623 7th Avenue South, Nashville, TN 37203) and Detroit Storefront (441 West Canfield Street. Detroit, MI 48201) as well as one Irish and one British record store to be announced."
     },
     {
     "Artist": "The United States Of America",
     "Album": "The United States Of America",
     "Format": "LP",
     "Label": "Sundazed Music",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552574:360",
     "More Info": "Limited edition reissue of the unfathomably rare MONO edition of legendary, touchstone Columbia Records 1968 psych masterpiece!"
     },
     {
     "Artist": "Big Star's Third Live",
     "Album": "Big Star's Third Live Stroke It Noel: Big Star's Third Live in Concert",
     "Format": "2 x LP",
     "Label": "Craft Recordings",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553139:360",
     "More Info": "The incredibly influential power pop band Big Star (1971-1974) was formed in Memphis, TN by Alex Chilton, Chris Bell, Jody Stephens and Andy Hummel. They continue to inspire fans and musicians alike to this day. Big Star's Third Live is the vinyl companion of the recently released THANK YOU FRIENDS BIG STAR'S THIRD LIVE AND MORE, featuring such musical luminaries as Jeff Tweedy, Chris Stamey, Mitch Easter, Mike Mills and Robyn Hitchcock, performing Big Star songs. This vinyl release will feature the third portion of the live concert including \"Femme Fatale\" which was not included on the CD and DVD/Blu Ray release. As an added bonus, five additional songs recorded during the concert but not included on the CD + DVD/BR release are here, including versions of \"Till the End of the Day\" and \"The Letter.\" This is the first time on vinyl for any of these recordings with a total of six previously unreleased songs. Get yourself a little Big Star this Christmas!"
     },
     {
     "Artist": "Various Artists",
     "Album": "Early LA",
     "Format": "LP",
     "Label": "Sierra High Fidelity",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559292:360",
     "More Info": "Early LA is an audiophile 180g vinyl pressing based on the 1969 Together Records album of the same name. It includes tracks from some famous Los Angeles artists of the time, including The Byrds, David Crosby, Gosdin Brothers, Dillards, and Dino Valenti, among others. The tracks were produced by legendary LA producer Jim Dickson, with additional bonus tracks never before released on vinyl. Utilizing Sierra Records' 1984 original half-speed master, processed by the late Richard \"Slim\" Doss at the legendary Sheffield Lab Matrix, Early LA is packaged in a silver foil album jacket and numbered."
     },
     {
     "Artist": "Various Artists",
     "Album": "Garage Daze: American Garage Rock from the 1960's",
     "Format": "LP",
     "Label": "ORG Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552236:360",
     "More Info": "It's clear that garage music has had an international resurgence in the underground music community over the last decade. It's easy to find bands young and old paying tribute to the fuzzy, high-energy sound that originated in American garages of the 1960's. Sadly, some of the recordings that helped start it all have long been lost to obscurity in the digital age. Garage Daze compiles some of the best tracks of that time, pulled together from 45RPM singles on labels like Roulette, Atco, and Jubilee. The tracks on this limited edition compilation LP have been remastered and pressed on color vinyl at Pallas in Germany."
     },
     {
     "Artist": "Various Artists",
     "Album": "High Times Presents: Smoke Signals Songs From The Mother Plant",
     "Format": "LP",
     "Label": "Palm Oaks Entertainment/High Tim",
     "Quantity": 1200,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553015:360",
     "More Info": "Record Store Day + High Times: A New Strain Emerges High Times is bringing cannabis culture to vinyl with High Times Presents, a release for the masses who participate in or appreciate this fast-growing lifestyle. This RSD Black Friday release features mainly unreleased and rare tracks from artists such as Snopp Dogg, Ziggy Marley, Tosh 1, Pell, Belly and Mac Lucci. All participants are musicians who mean something to the culture and who back the end of prohibition. Additionally, most of the tracks are unreleased, rare, remixes or were only previously available digitally."
     },
     {
     "Artist": "Various Artists",
     "Album": "Jazz Dispensary MOON ROCKS: Extraplanetary Funk, Space Disco and Galactic Boogie",
     "Format": "12\" Vinyl",
     "Label": "Craft Recordings",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553137:360",
     "More Info": "Take a trip to the outer limits of groove with the newest compilation from Jazz Dispensary, Moon Rocks: Extraplanetary Funk, Space Disco, and Galactic Boogie, featuring nine tracks of the most far out funk this side of the Mother Ship. Pressed on 180-gram cosmic-clear vinyl and housed in a gatefold jacket featuring artwork by acclaimed video artist Travis Flournoy, Moon Rocks collects some of the strongest and rarest space-themed jams ever put to tape on two exceedingly danceable sides, including \"Messages from the Stars\" by RAH Band, Slick’s \"Space Bass,\" and \"Do It 4 U\" by Starship Connection, which makes its debut on 12” wax and comes courtesy of the red hot Austin Boogie Crew Records."
     },
     {
     "Artist": "Various Artists",
     "Album": "Silver Linings Playbook Original Mostion Picture Soundtrack",
     "Format": "LP",
     "Label": "Megaforce Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552388:360",
     "More Info": "Mindful Vinyl, a new music-based initiative designed to further the conversation and awareness about mental health reissues, releases a limited edition green/silver vinyl edition of the Silver Linings Playbook soundtrack featuring music from Stevie Wonder, Alabama Shakes, Eagles of Death Metal, Bob Dylan with Johnny Cash and more. The organization's releases, done with socially responsible label partners, will raise money for charitable organizations and provide fans with limited edition vinyl pieces from new and classic artists. This release for Record Store Day's Black Friday benefits The Jed Foundation, a nonprofit that exists to protect emotional health and prevent suicide for our nation's teens and young adults."
     },
     {
     "Artist": "Jeremy Soule/Mark Lampert",
     "Album": "OST The Elder Scrolls V: Skyrim - Atmospheres",
     "Format": "LP",
     "Label": "SPACELAB9",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552539:360",
     "More Info": "Forty minutes of music from one of the most successful and enduring role playing games of all time."
     },
     {
     "Artist": "Thy Art Is Murder/The Acacia Strain/Fit For An Autopsy",
     "Album": "The Depression Sessions",
     "Format": "CD",
     "Label": "Nuclear Blast",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552533:360",
     "More Info": "Featuring six tracks total from Thy Art is Murder, Fit For An Autopsy and The Acacia Strain, The Depression Sessions is made up of one new original track (never released before this project) and a cover song performed by each band (never released before this project). Previously physically released only on vinyl, The Depression Sessions sold out almost immediately. This is the first CD release."
     },
     {
     "Artist": "Venom",
     "Album": "Eine Kleine Nachtmusik",
     "Format": "2 x LP",
     "Label": "Sanctuary Records",
     "Quantity": 1750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552208:360",
     "More Info": "Featuring brand new exclusive \"Blood\" picture discs designed by Venom vocalist/bassist Cronos, this reissue of the classic 1986 live album featuring the original Venom line-up: Cronos (bass/vocals), Mantas (guitar), Abaddon (drums). LP one was recorded live in 1985 at the Hammersmith Odeon in London, LP two was recorded live at the Ritz in New York City in 1986. Gatefold art and sleeves replicated from the original 1986 release. (2500 pressed worldwide)"
     },
     {
     "Artist": "Muddy Waters",
     "Album": "The Best of Muddy Waters",
     "Format": "LP",
     "Label": "Sundazed Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552568:360",
     "More Info": "An exact reproduction of the original 1958 album from the original Chess Records mono reels!!! Finally with the correct mastering and legally licensed! On limited edition colored vinyl."
     },
     {
     "Artist": "Mike Watt",
     "Album": "Contemplating The Engine Room",
     "Format": "2 x LP",
     "Label": "ORG Music",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552261:360",
     "More Info": "Mike Watt’s second album features Nels Cline on guitar and Stephen Hodges on drums. The album is finally receiving its first ever vinyl pressing with this double LP, a full 20 years after the album’s release. Pressed on two 180gram vinyl LPs, featuring three full sides of music, and a custom vinyl etching on the 4th side. This pressing, which comes a full 20 years after the album’s release, is the first time these recordings have made it to vinyl. The release includes a bonus download card featuring an entire unreleased live show, Contemplating the Engine Room: Live in Long Beach ‘98 – Five Man Opera."
     },
     {
     "Artist": "Bernie Worrel",
     "Album": "All The Woo In The World",
     "Format": "LP",
     "Label": "Tidal Waves Music",
     "Quantity": 1400,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553054:360",
     "More Info": "Bernie Worrell's 1978 solo debut All The Woo In The World, could easily pass as a lost Parliament/Fundadelic release. Mr. Worrell, the man himself, who passed away in 2016, needs little introduction. He was an American keyboardist, arranger & composer best known as a founding member of Parliament/Funkadelic and for his work with Talking Heads. All The Woo In The World was Bernie Worrell's solo debut album, originally released in 1978, and featuring P-Funk alumni George Clinton, Bootsy Collins, Maceo Parker, Fred Wesley and Eddie Hazel. When you hear All The Woo In The World it's no wonder David Byrne wanted Worrell to record with Talking Heads. In only seven tracks, Worrell shows how important he was to the P-Funk sound. It has everything: layered sounds, a toe-tapping midtempo beat, and incredible horns. It proved to be a classic platter of cosmic slop: funky and loose R&B. Heavily sought after by collectors, All The Woo In The World is an essential funk album by an artist who leaves a legacy as big as his career. Available for the first time on limited edition colored vinyl, All The Woo In The World is being released exclusively for RSD Black Friday 2017 and is only available in participating record stores starting on 11/24/17."
     },
     {
     "Artist": "Chet Atkins",
     "Album": "Guitar Blues / Brown Eyes A Cryin' In The Rain",
     "Format": "7\" Vinyl",
     "Label": "Modern Harmonic",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553430:360",
     "More Info": "Originally released on 78 in 1946 on Nashville's Bullet Records, this is the first ever vinyl reissue of Chet's very first release! Packaged in an envelope style picture sleeve with liner notes by Chet historian Pat Kirtley. Limited edition blue vinyl!"
     },
     {
     "Artist": "The Autumn Defense",
     "Album": "Circles",
     "Format": "LP",
     "Label": "Be With Records",
     "Quantity": 600,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553464:360",
     "More Info": "For RSD Black Friday 2017, Light In The Attic and Be With Records are delighted to announce the hugely anticipated reissue of Circles, the much-loved 2003 second album from indie rock Wilco spin-off The Autumn Defense. Recut and remastered specially for this edition, it's presented on black vinyl in a gatefold sleeve with the full original artwork."
     },
     {
     "Artist": "Black Label Society",
     "Album": "Room of Nightmares",
     "Format": "7\" Vinyl",
     "Label": "Metal/eOne",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553283:360",
     "More Info": "New unreleased song from forthcoming album in January 2018"
     },
     {
     "Artist": "The Black Lips",
     "Album": "This Sick Beat!",
     "Format": "10\" Vinyl",
     "Label": "Chimera Music",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553329:360",
     "More Info": "A limited edition 10\", produced by Sean Lennon, with two new songs and two new mixes from the band Pitchfork describes as \"Like a group of road-tripping teenagers who've scored a Groupon for the five-star hotel and opt to take a dump in the bidet.\""
     },
     {
     "Artist": "Blue Oyster Cult",
     "Album": "Rarities Vol. 1 (1969-1976)",
     "Format": "2 x LP",
     "Label": "Real Gone Music",
     "Quantity": 750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553300:360",
     "More Info": "17 BOC rarities never before on LP"
     },
     {
     "Artist": "Tommy Bolin",
     "Album": "Energy",
     "Format": "LP",
     "Label": "Friday Music",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553338:360",
     "More Info": "Guitar legend Tommy Bolin played his unique style of rock, jazz, raga, blues and heavy metal in such bands as Zephyr, James Gang and Deep Purple. His short lived band Energy, despite a few LPs worth of studio recordings on the shelf, never saw a legitimate release until now. Energy's early sessions brought on soome great music, like the hard rockin' \"Red Skies,\" featuring Jeff Cook on vocals and a powerful Tommy Bolin guitar throughout. Fusion works like \"Heartlight\" and \"Hoka Hey\", along with the classic rocker \"Got No Time For Trouble\" have all been deep fan favorites for years and this Friday Music Black Friday special release rounds things out with the epic \"Naked Edge\", truly showing what the Energy album always shoud have been. Released for the first time on 180g Audiophile Translucent Red Vinyl and only in record stores starting Black Friday."
     },
     {
     "Artist": "The Charlatans",
     "Album": "Plastic Machinery (Remixes)",
     "Format": "7\" Vinyl",
     "Label": "BMG Rights Management (UK) Ltd.",
     "Quantity": 850,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553250:360",
     "More Info": "A - Plastic Machinery (Sleaford Mods Remix) AA - Plastic Machinery (Juan Maclean Remix)"
     },
     {
     "Artist": "Petula Clark",
     "Album": "Four From The Top Five",
     "Format": "10\" Vinyl",
     "Label": "BMG Rights Management (US) LLC.",
     "Quantity": 850,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553239:360",
     "More Info": "This 10\" release features four great songs that all charted top 5 in the US charts!  In an incredible career spanning over seven decades, Petula Clark has become a true International Superstar. She cut her first record in 1949 and has subsequently become one of the best selling British female artists in recording history, selling over 68 million records worldwide."
     },
     {
     "Artist": "Tav Falco",
     "Album": "A Tav Falco Christmas",
     "Format": "LP",
     "Label": "ORG Music",
     "Quantity": 750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553291:360",
     "More Info": "Arkansas-reared, avant-roots/RnR raconteur Tav Falco is set to make the holidays merry with his first collection of Christmas standards, A Tav Falco Christmas. A fixture on the international music scene since 1981, Falco has been described by The New York Times as “A singer, guitarist and researcher of musical arcana who hasn’t let his increasingly technical expertise and idiomatic mastery compromise the clarity of his vision.” At the start of a scorching hot July in Memphis this year, Falco and his distinguished group of American/Euro vagabonds ensconced themselves at Sam Phillips Recording Service studios in Memphis. The lineup includes bassist Mike Watt (Minutemen, the Stooges), guitarist Mario Monterosso, and drummer Toby Dammit (currently the touring keyboardist in Nick Cave & the Bad Seeds). The album comes on a holiday red color LP, exclusively for Black Friday."
     },
     {
     "Artist": "The Free Design",
     "Album": "Kites Are Fun",
     "Format": "LP",
     "Label": "Light In The Attic",
     "Quantity": 900,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553460:360",
     "More Info": "Highly respected record label Light In The Attic is celebrating the 50th anniversary of 1960s sunshine-pop band The Free Design's debut album, Kites Are Fun, on limited edition colored vinyl. Kites Are Fun is a sunshine-bubblegum-daisy-puppy pop masterpiece that stands the test of time. Fans of the Beach Boys will wonder how they ever overlooked this 1967 gem, long admired by the likes of Beck, Madlib, and Belle & Sebastian. The Free Design was born out of the the Greenwich Village scene of 1966, and before disbanding in 1972, they had released six albums with tightly-knit vocal arrangements and intricately beautiful melodies. Nine of the songs on their debut Kites Are Fun are originals, notably the title track, which became an instant soft-pop classic. Well-chosen covers, including the Beatles' \"Michelle\" and Simon & Garfunkels' \"The 59th Street Bridge Song,\" complete the collection. For Record Store Day Black Friday 2017, Light In The Attic is proud to introduce The Free Design to a whole new generation of listeners."
     },
     {
     "Artist": "Gone Is Gone",
     "Album": "Phantom Limb 7\"",
     "Format": "7\" Vinyl",
     "Label": "Rise Records",
     "Quantity": 850,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553229:360",
     "More Info": "Gone is Gone may be a new name in the rock world but its members are anything but familiar. This rock \"supergroup\" includes members of Mastodon, Queens of the Stone Age and At The Drive In. This blood red 7\" hits only months after the band's explosive full length, Echolocation, follows seamlessly in its footsteps. Side A - \"Phantom Limb\" / Side B: \"Starlight\" (Acoustic) (recorded live) on blood red 7\" vinyl"
     },
     {
     "Artist": "Wynonie Harris Feat. Sun Ra",
     "Album": "Dig This Boogie / Lightnin' Struck The Poor House",
     "Format": "7\" Vinyl",
     "Label": "Modern Harmonic",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553448:360",
     "More Info": "Originally released on 78 in 1946 on Nashville's Bullet Records, this is the first ever vinyl reissue of Sun Ra's very first release! Packaged in a space-age envelope style picture sleeve with cover art by Cal Schenkel (Zappa, Beefheart). Limited edition red vinyl!"
     },
     {
     "Artist": "The Kills",
     "Album": "Black Rooster",
     "Format": "10\" Vinyl",
     "Label": "Domino Recording Co.",
     "Quantity": 750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553258:360",
     "More Info": "Black Rooster, the EP that started it all! Originally released on Dim Mak in 2002, Black Rooster was the start of what's been an incredible career for Alison Mosshart and Jamie Hince of The Kills. Now in their 15th year as a band, The Kills have been looking back and celebrating with a string of anniversary shows, retrospective features, and now this special Black Friday 2017 re-issue of their very first release. Steve Aoki, owner of Dim Mak and another artist who has proven a career with similar staying power, had some words to share on the release of Black Rooster: \"Many moons ago, back in 2002, I had to make a decision whether to pursue a Ph.D. Program or continue with my label Dim Mak & after hearing a demo from The Kills and becoming the first American label to release their EP Black Rooster, I knew what path I was going to choose. They took me under their wing and I hit the road with them as their tour manager, merch guy, driver (we all took turns) and label. I'll never forget that and love Jamie and Alison forever. Thank you for believing in lil me when not many people gave two shits about Dim Mak and what we were doing. Ride or Die.\" Back in press in North America for the first time since it's limited 2002 release, get your hands on The Kills first ever statement to the world, and the beginning of many wild things to come."
     },
     {
     "Artist": "Latyrx",
     "Album": "The Album: 20th Anniversary DLX",
     "Format": "2 x LP",
     "Label": "Real People",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553384:360",
     "More Info": "2-LP gatefold on swirled red/white and blue/white vinyl, with two bonus songs and an exclusive Black Friday RSD 7\" of \"Lady Don't Tek No\" (produced by DJ Shadow) 20 years after its initial release, the Bay Area uber-classic Latyrx: The Album - lyricists Lyrics Born and Lateef The Truthspeaker, with production from DJ Shadow, Chief Xcel and Lyrics Born - still stands as a seminal recording. It has gone on to resonate with successive generations of listeners, and influence countless artists. Recorded over a two-year period, it was the first full-length release from the legendary Solesides collective, and encapsulates a highly creative and influential time in hip-hop, frequently dubbed The Golden Age. Over the course of the original release's 42 minutes, not only can you hear Lyrics Born and Lateef literally growing into themselves as artists, but you can also hear the germination of the Solesides sound, first given birth at California's UC Davis in the early '90s, driven by brothers-in- beats-and rhymes Blackalicious and DJ Shadow. Partially by design, and partially out of necessity, Latyrx-and the Solesides crew as a whole-became trailblazers. Lyrics Born remembers (in this set's lengthy liner notes), \"We really wanted to explore. New styles, new subject matter, new textures, new vocabulary. It came down to even wanting to do words in the English language that you had never heard in a rap song before. It was all about pushing.\" And push they did, with game-changing lyrical exercises like \"Say That,\" \"Balcony Beach,\" \"The Wreckoning\" and \"The Muzappers Mix.\" Beyond cuts that back-in- the-day fans know from the original sequence, the two bonus tracks included in this edition are: \"Looking Over A City\" [produced by El-P], originally released on the Quannum compilation Spectrum. And \"The Last Trumpet,\" which closes this new deluxe edition. Originally appearing on the 2003 Lyrics Born solo album Later That Day, it's one of Latyrx's most-realized collaborations, and one of their most overtly-politically-themed songs. This deluxe, 2-LP issue of Latyrx: The Album is a must for longtime fans and newly-initiated listeners alike, with in-depth liner notes by veteran Bay Area journalist Eric Arnold (including input from Lyrics Born and Lateef The Truthspeaker) and packaged in a gatefold format. And for Black Friday Record Store Day only, 1,000 lucky buyers will have the addition of a first-time-ever 7-Inch of the group's 1997 single \"Lady Don't Tek No,\" produced by DJ Shadow."
     },
     {
     "Artist": "Sondre Lerche",
     "Album": "Solo Pleasure",
     "Format": "LP",
     "Label": "PLZ",
     "Quantity": 750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553466:360",
     "More Info": "Norwegian musician Sondre Lerche releases his latest album Pleasure this November. His music has been compared to artists as varied as Fleetwood Mac, Prefab Sprout and Scritti Politti. For RSD Black Friday Lerche is releasing Solo Pleasure, an intimate acoustic solo performance of songs from Pleasure."
     },
     {
     "Artist": "Lure, Burke, Stinson & Kramer",
     "Album": "L.A.M.F. live at the Bowery",
     "Format": "LP",
     "Label": "Jungle Records",
     "Quantity": 950,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553318:360",
     "More Info": "Revisiting JohnnyThunders and the Heartbreakers's 'L.A.M.F.' Live at Bowery Electric. Members of Blondie, Guns 'N Roses, MC5, and The Replacements gathered to pay tribute to Johnny Thunders and the Heartbreakers's most iconic moments. Walter Lure, the sole surviving Heartbreaker, Clem Burke of Blondie, Tommy Stinson of The Relacements and Guns & Roses, and Wayne Kramer of MC5, played the entire legendary 'L.A.M.F.' album to an ecstatic crowd. Released for Record Store Day Black Friday on transparent blue vinyl."
     },
     {
     "Artist": "Ingrid Michaelson",
     "Album": "Alter Egos",
     "Format": "12\" Picture Disc",
     "Label": "Cabin 24 Records",
     "Quantity": 500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559181:360",
     "More Info": "Platinum-selling indie pop artist Ingrid Michaelsen will release an exclusive Black Friday vinyl piece via her own Cabin 24 Records. Alter Egos is Ingrid's recent collaboration with some of her favorite artists, and consists of re-imagned versions of select songs from her latest full-length album, It Doesn't Have To Make Sense. This special double-sided picture disc is the first physical release of Alter Egos."
     },
     {
     "Artist": "Lou Reed & Kris Kristofferson",
     "Album": "The Bottom Line Archive Series: In Their Own Words: With Vin Scelsa",
     "Format": "LP Picture Disc",
     "Label": "The Bottom Line Record Company",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553374:360",
     "More Info": "An exclusive, limited 1000 quantity picture disc LP of select' tracks from Lou Reed and Kris Kristofferson's 'In Their Own words with Vin Scelsa' set from 1994 at the famed Bottom Line in NYC."
     },
     {
     "Artist": "Sparks",
     "Album": "Check Out Time 11AM",
     "Format": "7\" Vinyl",
     "Label": "BMG Rights Management (UK) Ltd.",
     "Quantity": 850,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553246:360",
     "More Info": "A. Check Out Time 11AM B. Edith Piaf (Said It Better Than Me)"
     },
     {
     "Artist": "Sun Ra",
     "Album": "Exotica",
     "Format": "3 x LP",
     "Label": "Modern Harmonic",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553437:360",
     "More Info": "Three colorful inter-stellar saucers of \"Exotic-Ra\" bringing you to a lush cocktail party where space is the place. A rhapsodic pandemonium of Afro-centric rhythms, Latin beats, ostinato grooves, and unissued tunes! Limited edition colored vinyl, gatefold packaging, Bonestell cover, & two sets of liners!"
     },
     {
     "Artist": "Sun Ra",
     "Album": "Exotica",
     "Format": "2 x CD",
     "Label": "Modern Harmonic",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553437:360",
     "More Info": "Two compact saucers of \"Exotic-Ra\" bringing you to a lush cocktail party where space is the place. A rhapsodic pandemonium of Afro-centric rhythms, Latin beats, ostinato grooves, and unissued tunes! Limited edition Bonestell cover, & two sets of liners!"
     },
     {
     "Artist": "Sunny & The Sunliners",
     "Album": "Smile Now, Cry Later",
     "Format": "LP",
     "Label": "Big Crown",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553399:360",
     "More Info": "$2 from each copy of Smile Now, Cry Later sold on Black Friday Record Store Day 2017 will go to The Greater Houston Community Foundation to help with relief for areas of Texas that were affected by Hurricane Harvey When it comes to living legends in the Texas and Latin Music pantheon, few have been at it longer and are more revered by their fans and peers than vocalist, songwriter and bandleader Sunny Ozuna. Born and raised in San Antonio, where he still resides, Sunny became a star right out of high school in the late '50s and hasn't looked back in the six decades since. After releasing dozens of albums since the mid-1960s (in Spanish and English), Sunny still keeps a busy schedule and loves performing as much as he did as a teenager. His classic 45s regularly change hands for hundreds of dollars among collectors around the world, affirming his timeless appeal. As a logical next step after Big Crown's excellent (and Sunny-approved) Mr. Brown Eyed Soul compilation from September, the label has started digging into the vaults of Sunny's Key-Loc Records label to unearth some legit soul classics - which are hard to find even in San Antonio, and clean originals will cost you a pretty penny if you ever luck into one - and have not been on vinyl since the late '60s. Each has been remastered and includes original album art. First up is Smile Now, Cry Later, a 12-song platter which first hit in 1966. As with most Sunny LPs, this is a mix of soulful originals - most notably, \"Smile Now, Cry Later\" and \"Put Me In Jail\" - and provocative, wide-ranging covers. Cases in point on the tributes side of this great album include the Sam & Dave shouter \"Hold On I'm Comin'\"; \"Forever,\" made famous by both the Marvelettes and Marvin Gaye, and a song that Sunny performs to this day; and the '60s Louis Prima crooner special \"Just A Gigolo.\" The band is tight, the sound is honest, the vocals are dusky and deep, and the album is an undeniable soul and Texas music classic, ready to be discovered by a whole new generation of music fans. Dive in and be ready for a permasmile, thanks to that patented Sunny sound."
     },
     {
     "Artist": "Sunny & The Sunliners",
     "Album": "Exotica",
     "Format": "LP",
     "Label": "Big Crown",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553408:360",
     "More Info": "$2 from each copy of The Missing Link sold on Black Friday Record Store Day 2017 will go to The Greater Houston Community Foundation to help with relief for areas of Texas that were affected by Hurricane Harvey When it comes to living legends in the Texas and Latin Music pantheon, few have been at it longer and are more revered by their fans and peers than vocalist, songwriter and bandleader Sunny Ozuna. Born and raised in San Antonio, where he still resides, Sunny became a star right out of high school in the late '50s and hasn't looked back in the six decades since. After releasing dozens of albums since the mid-1960s (in Spanish and English), Sunny still keeps a busy schedule and loves performing as much as he did as a teenager. His classic 45s regularly change hands for hundreds of dollars among collectors around the world, affirming his timeless appeal. As a logical next step after Big Crown's excellent (and Sunny-approved) Mr. Brown Eyed Soul compilation from September, the label has started digging into the vaults of Sunny's Key-Loc Records label to unearth some legit soul classics - which are hard to find even in San Antonio, and clean originals will cost you a pretty penny if you ever luck into one - and have not been on vinyl since the late '60s. Each has been remastered and includes original album art. Second in the reissue series is The Missing Link, a 10-cut, all instrumental album, and the tracklist is a wild ride indeed. Ranging from hip soul - James Brown's \"Soul Pride,\" The Inclines' Muscle Shoals groover \"Pressure Cooker,\" and the Meters classic \"Cissy Strut\" - to a wide swath of '60s Texas Latin party essentials (\"Uno,\" \"Rosita Bonita\" and \"La Pecosita\"), the Sunliners are in top form all throughout. It won't take much to envision a San Antonio backyard BBQ in the early '70s with this long player spinning in the background, on repeat. Instrumental party albums were all the rage back when this hit in the late '60s, and Sunny Ozuna and crew show here that they could groove with the best of them. Throw it on, break out the back deck smoker, and let the good tunes roll."
     },
     {
     "Artist": "The Reverend Peyton's Big Damn Band",
     "Album": "Sixteen Tons",
     "Format": "7\" Vinyl",
     "Label": "Family Owned/Thiry Tigers",
     "Quantity": 500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553333:360",
     "More Info": "Limited edition 7\" vinyl single featuring the Tennessee Ernie Ford classic \"Sixteen Tons\" b/w the Smokey Robinson & The Miracles classic \"You Really Got A Hold On Me.\""
     },
     {
     "Artist": "Three 6 Mafia",
     "Album": "Chpt 2: World Domination",
     "Format": "2 x LP",
     "Label": "Get On Down",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553392:360",
     "More Info": "Years before their groundbreaking Oscar for \"It's Hard Out Here For A Pimp,\" Memphis' Three 6 Mafia were making a splash throughout the South with self-released, hard albums for a growing legion of street-rap fans. To anyone listening to their earlier work today, it will come as no surprise that they started out as a straight-up \"horrorcore\" group. Chpt. 2: World Domination is the group's third album overall and their first on Relativity. In many ways, this was the country's first introduction to the crew, centered around producers / MCs DJ Paul and Juicy J. The horrorcore aesthetic is never far from the surface with the crew, heard clearly on the rolling, menacing and downright catchy \"Are U Ready 4 Us\" (with Michigan's The Dayton Family), \"Spill My Blood\" and \"Bodyparts 2\" (with guests including Memphis affiliate Project Pat). \"Tear Da Club Up '97\" was one of the album's singles, and it resonates in Southern clubs to this day. \"Late Nite Tip,\" another single, has similar resonance among fans, showing a more serious side to the group's lyricism. \"Who Got Dem 9s\" (with Project Pat) and the sex-fueled chatter on \"Watcha Do\" and \"Neighborhood Hoe\" show that they have range, even if it's not what their neighborhood preacher might want to hear (or at least cop to it in public). The group was still on the rise in 1997 when this southern classic hit, and had even bigger things ahead of them. But 20 years ago they also had the template in place to create a sound that would still rock fans and shake car rims to this day."
     },
     {
     "Artist": "Turtles",
     "Album": "Turtles '66",
     "Format": "LP",
     "Label": "Manifesto",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559357:360",
     "More Info": "The Turtles were an American rock band led by vocalists Howard Kaylan and Mark Volman. They had several Top 40 hits beginning with their cover version of Bob Dylan's \"It Ain't Me Babe\" in 1965, and they scored their biggest and best-known hit in 1967 with the classic \"Happy Together\". The Turtles released a string of singles and albums before hitting the big time with \"Happy Together.\" For those Turtles lovers in the world, RSD Black Friday presents Turtles '66, the \"lost\" Turtles album featuring all the original 1966 mono mixes. Three of the 12 songs on Turtles '66 were released as singles, but the other nine have never been released before in MONO. Put on your headphones, go into your shell, and listen to The Turtles!"
     },
     {
     "Artist": "Umphrey's McGee",
     "Album": "The Silent Type",
     "Format": "12\" Picture Disc",
     "Label": "MRI",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553342:360",
     "More Info": "This 12\" custom die-cut record, designed exclusively for Record Store Day Black Friday, features two brand new tracks from the band's January 2018 20 Year Anniversary album. The first single, \"The Silent Type\", is classic UM: it's infections riff rock, the musical equivalent of the record's unique shape, sawing through your turntable. Side B features \"Looks\", an uptempo driving composition penned by virtuoso guitarist Jake Cinninger."
     },
     {
     "Artist": "Various Artists",
     "Album": "Gentle Giants: The Songs of Don Williams",
     "Format": "LP",
     "Label": "Slatecreek Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559184:360",
     "More Info": "Country Music Hall of Famer Don Williams announced his retirement from performing last year, concluding an impressive five-decade career that includes two CMA Awards, two ACM Awards and 17 No. 1 hits. Williams unfortunately passed away in September 2017. In honor of his legendary career, Williams' longtime producer and friend Garth Fundis have produced a tribute album, Gentle Giants: The Songs of Don Williams, featuring an all-star lineup of artists. Some of the artists on Gentle Giant include Jason Isbell, Lady Antebellum, Dierks Bentley, Alison Krauss, John Prime and Garth Brooks. The 11-track album is being released on Slate Creek Records exclusively for RSD Black Friday 2017, and will serve as both a tribute and a memorial to a great man."
     },
     {
     "Artist": "Various Artists",
     "Album": "From The Vaults (Obscure Singles Compilation)",
     "Format": "2 x LP",
     "Label": "Studio One",
     "Quantity": 600,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553453:360",
     "More Info": "From the vaults of Studio One comes an 18 track bonanza of rare sides featuring both the label’s top hit makers as well as some of its more obscure artists, featured on LP for the first time.  Two tracks are previously unreleased. From Alton Ellis, Johnny Osbourne, and the Gaylads to Roy Tomlinson, the Soulites, and the Officials, the collection spans the label’s output from the late sixties to the early 1980s. These recordings might be rare, but they are some of the best “forgotten” songs released by Studio One. Where once only found in the collections of Reggae aficionados and fetching tidy sums on the internet, From the Vaults, Vol. 1 showcases some of the greatest “lost” music by Jamaica’s legendary label. The LP also comes with a bonus 45 single, featuring a unreleased track from Glen and Dave, exclusive for Record Store Day Black Friday."
     },
     {
     "Artist": "The Winery Dogs",
     "Album": "Dog Years, Live in Santiago",
     "Format": "3 x LP",
     "Label": "Loud & Proud Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553277:360",
     "More Info": "DOG YEARS, LIVE IN SANTIAGO & BEYOND is a live concert recorded at Teatro Cariola in Santiago, Chile on May 27th, 2016. The full 100-minute show includes songs from both albums, HOT STREAK and THE WINERY DOGS, and the Dog Years EP (side six) features five previously unreleased studio tracks."
     },
     {
     "Artist": "At The Drive In",
     "Album": "Diamante 10\"",
     "Format": "10\" Vinyl",
     "Label": "Rise Records",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553474:360",
     "More Info": "This year marked the return of At The Drive, with their full length in*ter al*i*a and Black Friday gives them a chance to show their longstanding support for record stores with the release of brand new music on the Diamante 10\", three new tracks on coke bottle green w/ bone splatter vinyl. BONUS: 100 copies will be pressed on black/doublemint vinyl and randomly inserted into distribution."
     },
     {
     "Artist": "Chris Bell",
     "Album": "Complete Chris Bell [Boxed Set]",
     "Format": "Vinyl Box Set",
     "Label": "Omnivore Recordings",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553494:360",
     "More Info": "After co-founding and subsequently leaving Big Star, Chris Bell only issued two tracks of new music during his short lifetime. For RSD Black Friday 2017, Omnivore Recordings, with the help of the Estate of Chris Bell, are releasing his complete recordings, titled The Complete Chris Bell! This magnificent six LP set of Chris Bell's recorded output contains everything he ever recorded, including Looking Forward: The Roots Of Big Star Featuring Chris Bell, Rock City's See Seven States, I Am The Cosmos (Expanded), and two LPs of Outtakes and Alternate versions. Rounding out the box set is an exclusive unissued London interview from 1975 conducted by Barry Ballard, and a 20 page color booklet with previously unseen photos. This release should serve as the definitive collection of the massively influential Chris Bell, and would make a wonderful gift for any Big Star fan!"
     },
     {
     "Artist": "The Brian Setzer Orchestra",
     "Album": "25 Live!",
     "Format": "12\" Vinyl",
     "Label": "Surfdog Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553508:360",
     "More Info": "2017 marks the milestone 25th anniversary of The Brian Setzer Orchestra (BSO), and what better way to celebrate than with a neon blue 12\"! 25 Live! is an exclusive Black Friday Record Store Day release featuring two never-before-released live tracks by the BSO: \"Let There Be Rock\" and \"Gene & Eddie\", this is a must-have for any Setzer or BSO fan!!"
     },
     {
     "Artist": "Cheap Trick",
     "Album": "Christmas Christmas",
     "Format": "LP",
     "Label": "BMLG",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553668:360",
     "More Info": "Cheap Trick has had a storied career, beginning with their first LP in 1977, their breakthrough \"Live at Budokan\" in 1979, their first #1 hit with 1988's \"The Flame,\" and a 2016 induction into the Rock and Roll Hall of Fame. So, why not release a Christmas album, and pack it chock full of great classics, including covering The Kinks and The Ramones! 12 great Christmas tracks make up \"Christmas Christmas,\" Cheap Trick's Christmas album, and a wonderful release for RSD Black Friday!"
     },
     {
     "Artist": "Daedelus",
     "Album": "Invention & The Quiet Party (15th Anniversary Edition)",
     "Format": "2 x LP",
     "Label": "Magical Properties",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553579:360",
     "More Info": "Like his mythological namesake, Daedelus - otherwise known as Alfred Darlington - is an inventor, a creator of sonic labyrinths combining sounds from an eclectic palette into an innovative genre all his own. To celebrate its 15th anniversary, Daedelus is repackaging his seminal debut Invention in a 2LP package with the complimentary EP The Quiet Party (including appearances from Madlib, Yesterday's New Quintet and Busdriver) in a color vinyl masterpiece. Containing the track \"Experience\", known in part as a sample in Madvillain's accordion, Invention is a genre-spanning opus that marks the start of what has become an illustrious career."
     },
     {
     "Artist": "Dimebag Darrell",
     "Album": "The Hitz",
     "Format": "12\" Vinyl",
     "Label": "Rhino/Elektra",
     "Quantity": 4000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553519:360",
     "More Info": "EP featuring five tracks previously unreleased on vinyl from the late Dimebag Darrell of Pantera. Snippets of all tracks are included in the soundtrack of the film Dimevision, but are available here as complete songs. Lyric sheet included."
     },
     {
     "Artist": "The Doors",
     "Album": "Absolutely Live",
     "Format": "2 x LP",
     "Label": "Rhino/Elektra",
     "Quantity": 4800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553524:360",
     "More Info": "Originally released in 1970, Absolutely Live was the first live album released by The Doors and featured concerts recorded in 1969 and 1970. This 2LP midnight blue vinyl edition was remastered by Bruce Botnick."
     },
     {
     "Artist": "Danny Elfman & The Knights Of Oingo Boingo",
     "Album": "The Forbidden Zone Original Motion Picture Soundtrack",
     "Format": "LP",
     "Label": "Varese/Sarabande",
     "Quantity": 1350,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553673:360",
     "More Info": "The cult classic film The Forbidden Zone was the first to be scored by legendary composer Danny Elfman. It was also the first major recording for the 80s new wave sensations Oingo Boingo, (Then known as The Knights of the Oingo Boingo). The soundtrack for The Forbidden Zone was originally released in 1980, and perfectly captures the band's transition from a Cabaret-style group of performers to the influential new wave band they would become. The original soundtrack is long out of print, but is being re-released for RSD Black Friday on translucent lime green vinyl! Put on your best 80s dance party outfit and enter the Forbidden Zone!"
     },
     {
     "Artist": "Fleet Foxes",
     "Album": "The Electric Lady Session",
     "Format": "10\" Vinyl",
     "Label": "Nonesuch",
     "Quantity": 3600,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553516:360",
     "More Info": "Live recording from Electric Lady studios"
     },
     {
     "Artist": "Aretha Franklin With The Royal Philharmonic Orchestra",
     "Album": "Respect / Until You Come Back To Me (That's What I'm Gonna Do)",
     "Format": "7\" Vinyl",
     "Label": "Rhino/Atlantic",
     "Quantity": 3700,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553518:360",
     "More Info": "2017 marks the 50th anniversary of Aretha Franklin's hit single RESPECT. This 50th anniversary version features Franklin's instantly recognizable voice woven together with new orchestral arrangements from The Royal Philharmonic Orchestra recorded at Abbey Road Studios in London, with brand new backing vocals led by Grammy®-winning singer Patti Austin."
     },
     {
     "Artist": "The Grateful Dead",
     "Album": "Grateful Dead Records Collection",
     "Format": "5 x LP",
     "Label": "Grateful Dead/Rhino",
     "Quantity": 5800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553520:360",
     "More Info": "5LP Box Set containing: Wake Of The Flood, From The Mars Hotel, Blues For Allah, Steal Your Face (2 LPs). Each album will be faithfully replicated, housed in a rigid slipcase, with a book containing liner notes and iconic photos of the band."
     },
     {
     "Artist": "Richard Hell & The Voidoids",
     "Album": "Blank Generation (40th Anniversary Deluxe Edition)",
     "Format": "2 x CD",
     "Label": "Rhino/WB",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553527:360",
     "More Info": "Richard Hell and the Voidoids’ Blank Generation is an iconic album that has influenced countless rock bands with its image, its attitude, and its blistering performances. Released in 1977 on Sire Records, the album was received ecstatically by critics such as Lester Bangs and the New York Times’ Robert Palmer (who called it one of the ten best albums of the decade), but as was the case with most original “punk” albums, it wouldn’t get mainstream recognition for decades. Now its place in music history is secure as one of punk’s most significant records. Recently, Rolling Stone magazine lauded Blank Generation as one of the “40 Greatest Punk Albums of All Time,” giving the innovative and literate band its well deserved credit on the cusp of its 40th anniversary."
     },
     {
     "Artist": "Richard Hell & The Voidoids",
     "Album": "Blank Generation (40th Anniversary Deluxe Edition)",
     "Format": "2 x LP",
     "Label": "Rhino/WB",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553527:360",
     "More Info": "Richard Hell and the Voidoids’ Blank Generation is an iconic album that has influenced countless rock bands with its image, its attitude, and its blistering performances. Released in 1977 on Sire Records, the album was received ecstatically by critics such as Lester Bangs and the New York Times’ Robert Palmer (who called it one of the ten best albums of the decade), but as was the case with most original “punk” albums, it wouldn’t get mainstream recognition for decades. Now its place in music history is secure as one of punk’s most significant records. Recently, Rolling Stone magazine lauded Blank Generation as one of the “40 Greatest Punk Albums of All Time,” giving the innovative and literate band its well deserved credit on the cusp of its 40th anniversary."
     },
     {
     "Artist": "Bill Hicks",
     "Album": "Revelations: Live in London",
     "Format": "2 x LP",
     "Label": "Comedy Dynamics",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559180:360",
     "More Info": "Recorded at The Dominion Theatre in London in November 1992 at the height of his genius, Bill Hicks: Revelations: Live in London contains never-before-heard, unreleased audio from the last special he ever taped. Bill Hicks opens our eyes and minds to the hypocrisy and ludicrousness of the world around us. This year marks the 25th anniversary of the performance."
     },
     {
     "Artist": "John Lee Hooker",
     "Album": "Black Night Is Falling",
     "Format": "LP",
     "Label": "Justin Time Records",
     "Quantity": 800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553484:360",
     "More Info": "Recorded at the Rising Sun Celebrity Jazz Club in Montreal, Quebec, on May 5, 1977, Black Night Is Falling finds John Lee Hooker in fine voice and backed by a driving band composed of John Garciaon guitar, Steve Jones on bass, and Larry \"Wild Man\" Martin on drums, with the end result being an excellent example of live Hooker at his best. Highlights include impressive romps through two of Hooker's signature tunes, \"Boom Boom,\" which simply blazes with raw energy here, and \"One Bourbon, One Scotch, One Beer,\" which is delivered as a wonderfully paced barroom cautionary tale. This is what the live Hooker sounded like with a sympathetic band behind him, a band that luckily wasn't afraid to push him a little."
     },
     {
     "Artist": "Insane Clown Posse",
     "Album": "The Great Milenko: 20th Anniversary Edition",
     "Format": "2 x LP",
     "Label": "Psychopathic Records",
     "Quantity": 2700,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553534:360",
     "More Info": "Two decades after it was pulled from stores by Disney-owned Hollywood Records, pop culture icons Insane Clown Posse's notorious \"The Great Milenko\" is back...and still casting its horrorcore spell over millions of fans worldwide. Featuring underground hits such as \"Halls of Illusions\" (featuring Slash on guitar) and \"Hokus Pokus\" with Steve Jones of Sex Pistols' fame, \"The Great Milenko\" makes its vinyl appearance on the occasion of its 20th birthday. Still shocking, uncompromising, and unforgettable, \"The Great Milenko\" brings the magic of the Dark Carnival to Record Store Day's Black Friday!"
     },
     {
     "Artist": "J Dilla",
     "Album": "J Dilla's Delights V. 2",
     "Format": "LP",
     "Label": "Yancey Media Group",
     "Quantity": 1350,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553536:360",
     "More Info": "After releasing Motor City, The King of Beats Vol 1 & 2, the Ma Duke's Collection, and the Jay Dee aka King Dilla beat compilations all over the last year or so, the world is graced with yet another stellar posthumous release, a two volume beat tape from J Dilla, 'Dilla's Delights Vol. 1 and Vol. 2. It seems the powers that be are heeding the call for more joints from the vault. And we're not mad. Not even a little. Real hip hop fans can rejoice, in a time of watered down trap rap and shiny suits. Will the wellspring ever run dry? Are we soon to arrive at the end of this 11 year grace period with the GOAT? Time will tell, but so long as the heat keeps coming, we'll be quietly sitting in the corner blessing the air and pouring one out for the late Dilla Dawg. And the best part about Dilla's Delights Vol 1 & Vol. 2? Each one is on its own limited color vinyl (Vol 1 on green and Vol 2 on purple), and a portion of the proceeds will directly benefit each of Dilla's two daughters, whose profiles grace the album covers."
     },
     {
     "Artist": "J Dilla",
     "Album": "J Dilla's Delights V. 1",
     "Format": "LP",
     "Label": "Yancey Media Group",
     "Quantity": 1350,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553535:360",
     "More Info": "After releasing Motor City, The King of Beats Vol 1 & 2, the Ma Duke's Collection, and the Jay Dee aka King Dilla beat compilations all over the last year or so, the world is graced with yet another stellar posthumous release, a two volume beat tape from J Dilla, 'Dilla's Delights Vol. 1 and Vol. 2. It seems the powers that be are heeding the call for more joints from the vault. And we're not mad. Not even a little. Real hip hop fans can rejoice, in a time of watered down trap rap and shiny suits. Will the wellspring ever run dry? Are we soon to arrive at the end of this 11 year grace period with the GOAT? Time will tell, but so long as the heat keeps coming, we'll be quietly sitting in the corner blessing the air and pouring one out for the late Dilla Dawg. And the best part about Dilla's Delights Vol 1 & Vol. 2? Each one is on its own limited color vinyl (Vol 1 on green and Vol 2 on purple), and a portion of the proceeds will directly benefit each of Dilla's two daughters, whose profiles grace the album covers."
     },
     {
     "Artist": "Waylon Jennings",
     "Album": "New Stuff",
     "Format": "LP",
     "Label": "Black Country Rock",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553697:360",
     "More Info": "In the late 90's, Waylon Jennings was working on a batch of new material for a potential new album to be recorded. Unfortunately, that Jennings passed away before that album could be realized. While going through some of his fathers things, Shooter Jennings ran across a cassette tape labeled \"New Stuff\". What was on that tape was a collection of new songs performed by just Waylon and his guitar. Shooter restored the tape and the result was an earnest collection of songs Waylon felt passionate and proud of. Black Country Rock proudly presents \"New Stuff\" on beautiful limited colored 12\" vinyl, a collection of songs that are a must-have for any die-hard Waylon fan."
     },
     {
     "Artist": "Kid Cudi",
     "Album": "Passion, Pain, & Demon Slayin'",
     "Format": "2 x LP",
     "Label": "Republic",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553679:360",
     "More Info": "Grammy Award-winning multiplatinum KID CUDI returns with his 6th album, PASSION, PAIN & DEMON SLAYIN featuring singles \"Baptized In Fire\", \"Frequency,\" and \"Surfin'\". He is about to embark on the 28 date PASSION, PAIN & DEMON SLAYIN North American tour. The album includes 18 new tracks from CUDI, including the legendary André Benjamin of OutKast on \"By Design\" and \"The Guide,\" Willow Smith on \"Rose Golden,\" and Pharrell Williams again during \"Flight At First Sight/Advanced.\""
     },
     {
     "Artist": "Kill Verona",
     "Album": "There's Hope Behind the Ghost: Vol 1.",
     "Format": "7\" Vinyl",
     "Label": "Sky Valley Records",
     "Quantity": 750,
     "PhotoURL": "http://recordstoreday.com/Photo/418458579217:360",
     "More Info": "Kill Verona was formed in December of 1999 under the name Little League, by Vocalist Wes Lieberher and Guitarist Paul Butterly. Rafael Henin joined in 2001 to play Bass and shortly after the band changed their name to Kill Verona after being served a Cease and Desist order from Little League Baseball. Kill Verona have played with the likes of Brand New, Taking Back Sunday, Thrice, The Movie Life, Thursday, Coheed and Cambria, Good Charlotte, Samiam, Grade, Strike Anywhere, Glassjaw, Recover, the list goes on. Kill Verona were a precursor for Philly area bands such as Title Fight. Kill Verona most recently played The This Is Hardcore 2017 festival. This RSD Black Friday single is pressed on randomly distributed baby blue, green, blue and red vinyl."
     },
     {
     "Artist": "Kreator",
     "Album": "Hail To The Hordes",
     "Format": "12\" Picture Disc",
     "Label": "Nuclear Blast",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553361:360",
     "More Info": "Hail To The Hordes features the single \"Hail To The Hordes\" and two previously unreleased tracks, \"Earth Under The Sword\" and \"Warrior Heart\" on a picture disc."
     },
     {
     "Artist": "Shawn Lee's Ping Pong Orchestra",
     "Album": "Techstar: Original Score",
     "Format": "LP",
     "Label": "Silver Fox Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553113:360",
     "More Info": "Shawn Lee, born in Kansas in 1963, is one of the most prolific musicians of his generation. A multi-instrumentalist, producer, singer songwriter, composer and Radio DJ, he has released 35 albums to date. He has played, produced and written songs for hundreds of records, and has worked with a diverse range of artists including Jeff Buckley, Saint Etienne, and the late Amy Winehouse. Lee's music has been used extensively in both film & TV - including Monuments Men, House of Cards, Orange is the New Black, and many others. After a 5 year hiatus, Shawn makes a welcomed return to his Ping Pong Orchestra moniker with the Spacey concept album Techstar. This imaginary soundtrack album is filled with Cosmic Funk, Boogie, and disco. Based around the characters & happenings on a space station called Techstar, Mr. Lee blasts off into the outer regions on his latest Sci-Fi opus, proving that Space IS indeed the place...."
     },
     {
     "Artist": "Lil Jon & The East Side Boyz",
     "Album": "Kings of Crunk (15th Anniversary Double Platinum Vinyl Edition)",
     "Format": "2 x LP",
     "Label": "TVT Records",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559182:360",
     "More Info": "Finally, the album that put crunk on the map retuns to vinyl. Kings of Crunk helped establlish Lil Jon & The East Side Boyz as larger than life stars in the rap music scene. King of Crunk's overabundance of club anthems helped garner heavy radio rotation all across the country, leading to its double platinum certification. In honor of the 15 year anniversary of the record, it will be pressed on one-of-a-kind platinum vinyl. Now casual and die-hard rap fans alike can enjoy this classic the way it was meant to be; in a unique blinged out format."
     },
     {
     "Artist": "Lydia Loveless",
     "Album": "LIVE from the documentary Who Is Lydia Loveless?",
     "Format": "12\" Vinyl",
     "Label": "What Were We Thinking Films",
     "Quantity": 1400,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553531:360",
     "More Info": "A six-song vinyl-only Black Friday release of Lydia Loveless and her band performing a hometown show at Skully's in Columbus, Ohio. Recorded by her longtime producer Joe Viers, the show was filmed for Gorman Bechard's documentary Who Is Lydia Loveless' which is included as a DVD in this package."
     },
     {
     "Artist": "Ziggy Marley",
     "Album": "Love Is My Religion",
     "Format": "LP",
     "Label": "Tuff Gong Worldwide",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559375:360",
     "More Info": "Ziggy Marley is a Jamacian born musician and leader of the reggae band Ziggy Marley & The Melody Makers. He is also the son of Bob Marley, one of the few men in history who actually changed the world for the better. Love Is My Religion was Marley's second solo record, released in 2006. It won a 2007 Grammy for Best Reggae Album of the Year. For RSD Black Friday 2017 it is available in North America on vinyl for the first time. Love Is My Religion features Ziggy's iconic songs \"Love Is My Religion\" and \"Beach in Hawaii\". This special release will include a digital download card with album instrumentals and live audio from the Love Is My Religion concert -- over 2 hours of bonus digital audio in total! What a great gift for the world this Black Friday!"
     },
     {
     "Artist": "Dave Matthews & Tim Reynolds",
     "Album": "Live at Luther College",
     "Format": "4 x LP",
     "Label": "Legacy",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553552:360",
     "More Info": ""
     },
     {
     "Artist": "Timothy McNealy",
     "Album": "Funky Movement",
     "Format": "LP",
     "Label": "Now-Again Records",
     "Quantity": 1800,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553544:360",
     "More Info": "Texas funk music is amongst the highest regarded styles in the genre, a unique mixture of jazz, blues, R&B and James Brown's syncopation that evolved in metropolises like Houston (Kashmere Stage Band), San Antonio (Mickey and the Soul Generation), Austin (James Polk and the Brothers) and Dallas. Dallas birthed a variety of independent labels, Soultex and Doin Our Thing amongst them. But no one in Dallas, Texas or America, created a run of 7\" singles like Timothy McNealy did on his Shawn imprint. When it comes to heavy, funk music, in Dallas - in Texas - Timothy McNealy is king. This means that when it comes to funk music, in general, McNealy is hallowed. Yet McNealy's music has never been collected as an album, nor reappraised in its totality. A series of 7\" single reissues have come out in the past 15 years, including his masterpiece \"Sagittarius Black,\" a psychedelic funk instrumental that has been a cornerstone in every fan's rediscovery of the genre for the past 20 years. But this is the first time that his music is presented in its totality, giving the enlightened fan an opportunity to hear the breadth and depth of his Funky Movement."
     },
     {
     "Artist": "The Minus 5",
     "Album": "Dear December",
     "Format": "LP",
     "Label": "Yep Roc Records",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553549:360",
     "More Info": "Dear December is a collection of 12 seasonal songs written by Scott McCaughey with a little help from his friends. Guests include Ben Gibbard (Death Cab for Cutie), M. Ward and Chuck Prophet. The Record Store Day Black Friday package is a gatefold jacket with 12 cut-outs on front cover, like an Advent Calendar (!), and white vinyl."
     },
     {
     "Artist": "Murs",
     "Album": "3:16 The 9th Edition",
     "Format": "LP",
     "Label": "Empire/Murs 316",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559189:360",
     "More Info": "California Rapper Murs released 3:16: The 9th Edition in 2004. The semianl album was his first collaboration with North Carolina producer 9th Wonder. It is being re-released by Empire/Murs 316 for RSD Black Friday, and the vinyl has been out of print for some time."
     },
     {
     "Artist": "The Notorious B.I.G.",
     "Album": "Hypnotize",
     "Format": "12\" Vinyl",
     "Label": "Bad Boy Records",
     "Quantity": 6000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553526:360",
     "More Info": "20th anniversary edition of Notorious B.I.G's single \"Hypnotize\" on orange/black 12\" vinyl. Originally released on March 1, 1997 as the first single from the album Life After Death, it would be the last song he released in his lifetime, as he was killed only one week later. It became the fifth song by a credited artist to hit #1 posthumously, and is ranked at #30 on Rolling Stone's 50 Greatest Rap Songs Of All-Time."
     },
     {
     "Artist": "Poncier",
     "Album": "Poncier",
     "Format": "12\" Vinyl",
     "Label": "A&M",
     "Quantity": 4000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553616:360",
     "More Info": "In the movie SINGLES, Cliff Poncier is one of the main characters who was recently kicked out of his band and decides to record a solo album. During the filming of the movie SINGLES, Chris Cornell took a film prop cassette from the movie set that was Cliff Poncier's demo and seen in the film, wrote and recorded songs to the fake song titles written on the prop cassette \"Seasons,\" \"Nowhere But You,\" \"Spoon Man,\" \"Flutter Girl\" and \"Missing\".  We will be officially for the first time releasing the Poncier demos on vinyl and cassette with custom art designed by Jeff Ament, in three colorways, randomly distributed."
     },
     {
     "Artist": "Poncier",
     "Album": "Poncier",
     "Format": "Cassette",
     "Label": "A&M",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553616:360",
     "More Info": "In the movie SINGLES, Cliff Poncier is one of the main characters who was recently kicked out of his band and decides to record a solo album. During the filming of the movie SINGLES, Chris Cornell took a film prop cassette from the movie set that was Cliff Poncier's demo and seen in the film, wrote and recorded songs to the fake song titles written on the prop cassette \"Seasons,\" \"Nowhere But You,\" \"Spoon Man,\" \"Flutter Girl\" and \"Missing\".  We will be officially for the first time releasing the Poncier demos on vinyl and cassette with custom art designed by Jeff Ament, in three colorways, randomly distributed."
     },
     {
     "Artist": "Sean Price",
     "Album": "Refrigerator P",
     "Format": "10\" Vinyl",
     "Label": "Coalmine Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553122:360",
     "More Info": "Coalmine Records is honored to release for RSD Black Friday, a limited-edition 10\" maxi-single of \"Refrigerator P,\" a bruiser of a track from the late, legendary rapper Sean Price. This 10\" maxi-single comes loaded with the instrumental version and a special bonus beat selection called \"P's Theme.\" Rounding out the release is the smoothed out \"Peaky Blinders\" remix of \"Refrigerator P,\" featuring emcee Rob Kelly. Listeners will no doubt attest that he holds his weight alongside P, closing out this wonderful release."
     },
     {
     "Artist": "Procol Harum",
     "Album": "The One & Only One",
     "Format": "10\" Vinyl",
     "Label": "Eagle Records",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458579219:360",
     "More Info": "Exclusive for RSD is this limited edition 10\" from British prog rockers Procol Harum, \"The One and Only One.\" This coke-bottle colored 10\" features 4 tracks recorded during Procol Harum's 2017 UK tour for the 50th anniversary. Side A features two classic live Procol Harum tracks \"Conquistador\" and \"Cerdes (Outside the Gates of)\" and Side B offers up two live tracks from Procol Harum's latest acclaimed album Novum, \"Last Chance Motel\" and \"The Only One.\""
     },
     {
     "Artist": "Prodigy",
     "Album": "H.N.I.C.",
     "Format": "2 x LP",
     "Label": "Get on Down",
     "Quantity": 1350,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553533:360",
     "More Info": "When it comes to authentic, ride-or-die hip-hop, few crews have as much resonance as Mobb Deep. Featuring two double-threat MCs who also produced - Havoc and the sadly-departed Prodigy - the crew changed the hardcore rap game in 1995 with their sophomore classic The Infamous, and went on to rule the dark corners of hip-hop for the second half of the 90s and well into the 2000s. After multiple Mobb Deep platters in the '90s, Prodigy entered the 2000s as a solo artist with force, rolling over a stomping, piano-freaked backdrop laced by producer The Alchemist, with \"Keep It Thoro.\" It has held up over time, proving itself as an anthemic classic that the streets and clubs still respect. Flaunting a smooth-but-menacing flow, Prodigy's no-nonsense lyricism on \"Keep It Thoro\" is prototypical modern age brag rap. Countless MCs have followed his flow, from Fabolous to Joey Bada$$. The song is short and sweet, clocking in at just over 3 minutes. There are no wasted verses, just hardcore rhymes that stay with you. But \"Thoro\" was the tip of the iceberg on what proved to be one of the more coveted rap full-lengths of the era. The album boasted other charting singles, including \"Rock Dat Shit\" and \"Y.B.E.\" (featuring B.G.), but it can be argued that the album's real gems are buried deeper. \"Genesis,\" \"What U Rep\" (featuring Noreaga) and \"Three\" are all sinister yet pensive. \"Wanna Be Thugs\" and \"Delt With The Bullshit\" are strong and evocative Mobb Deep cuts, featuring production and vocals by Havoc. And alongside other standouts, perhaps the deepest cut of all - especially in light of Prodigy's recent and way-too-soon passing due to complications from Sickle Cell Anemia - is \"You Can Never Feel My Pain,\" which details the health issues and challenges this talented MC and producer had been facing his whole life. H.N.I.C. was Prodigy's first solo album, but it is perhaps his best. Among fans he will never be forgotten, for his skills, his storytelling and his no-B.S. approach to the art of MCing."
     },
     {
     "Artist": "Raspberries",
     "Album": "Pop Art Live",
     "Format": "3 x LP",
     "Label": "Omnivore Recordings",
     "Quantity": 0,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553501:360",
     "More Info": "The Raspberries are one of rock's most treasured bands, influencing everyone from John Lennon to Bruce Springsteen to Paul Westerberg! Pop Art Live is a dynamic recording of the Raspberries first live show in 30 years, with comprehensive liner notes from Academy Award®-winner and music scribe Cameron Crowe. With memorabilia & ephemera from Raspberries aficionado Bernir Hogya, this 3 LP set on red, yellow and blue vinyl includes perfect renditions of all the hits plus covers of classic songs by the The Beatles, The Who & The Choir. This Rasperries live release includes two bonus songs not on the CD version, and also a download card. The two bonus songs are \"Drivin' Around/Crusin' Music\" and \"I Don't Know What I Want\" both recorded at the Raspberries' 2004 New Year's Eve show at the House of Blues in Cleveland, OH."
     },
     {
     "Artist": "Otis Redding",
     "Album": "Live in Europe (50th Anniversary Edition)",
     "Format": "LP",
     "Label": "Rhino/Atlantic",
     "Quantity": 3250,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553521:360",
     "More Info": "50th Anniversary edition of Live In Europe, Redding's first live album (as well as the only live album released during his lifetime), issued exactly five months before his death on December 10, 1967. The album was recorded during the Stax/Volt tour of Europe and Redding is backed by Booker T. & the MG's. Recorded at the Olympia Theatre, Paris; March 21, 1967. This will be a MONO release on 140g red vinyl."
     },
     {
     "Artist": "Rush",
     "Album": "Closer To The Heart",
     "Format": "7\" Vinyl",
     "Label": "Island",
     "Quantity": 5000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553651:360",
     "More Info": "Canadian rock legends Rush have been making music for more than five decades. The songs on this RSD 7\" are \"Closer to the Heart\" and \"Madrigal,\" both released in 1977 on A Farewell to Kings. This single is being re-released for RSD Black Friday to celebrate the 40th anniversary of the LP. This 7\" has a large center hole, and new art by longtime Rush album designer Hugh Syme. It also comes with a custom 7\" adapter and is to be timed with the 40th anniversary of A Farewell to Kings box set re-issue."
     },
     {
     "Artist": "Scream",
     "Album": "NMC 17",
     "Format": "LP",
     "Label": "Southern Lord",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553532:360",
     "More Info": "Scream was formed in 1981 by vocalist Peter Stahl, his brother Franz Stahl on guitar, Skeeter Thompson on bass, and Kent Stax on drums. The next few years would see the addition of second guitarist Robert Lee Davidson and keyboard player Bobby Madden. Following three LPs on Dischord Records, Scream's No More Censorship was released by reggae label Ras Records in August 1988. A seminal album of the DC punk scene, the album was the first to feature Dave Grohl, who replaced Stax for the album and stayed with the band until they disbanded in 1990. This was the first Scream album the now world famous musician ever played on.  Since disbanding, several incarnations of Scream have reunited/resurfaced for random tours and recordings since. Members of the band went on to form countless other influential actis, including Nirvana, Wool, Foo Fighters, Queens of the Stone Age, Goatsnake, The Suspects and others.  Southern Lord is proud to be chosen to reissue Scream's everlasting No More Censorship album. The band found the original multi-track tapes and Southern Lord had them prepped for a remix at Grohl's 606 studio. The new mix sounds vital and intense: the entire packaging, layout and design is completely different from the original, with the inclusion of photos, lyrics, poetry and other personal writingfr from the band during that era. Pressed on randomly distributed colored vinyl with unreleased tracks and an extensive 32 page lyric book."
     },
     {
     "Artist": "Snoop Dogg",
     "Album": "Neva Left",
     "Format": "2 x LP",
     "Label": "EMPIRE/Doggystyle Records",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559310:360",
     "More Info": "Ever since Snoop Dogg busted out of Long Beach, CA on Dre's masterpiece \"Chronic,\" he has been a force to be reckoned with musically, lyrically, socially, heck, he even coaches Pee-Wee football. Snoop has sold more than 35 million albums worldwide, and he's back with Never Left, available on green vinyl for the first time for RSD Black Friday. Snoop's latest record features collaborations with many artists, including Too Short, Nef the Pharoah, Devin the Dude, Wiz Khalifa, BadBadNotGood, Kaytranada, B-Real, Method Man, and Redman. Be one of Snoop's many fans who are lucky enough to pick up the first vinyl pressing of Neva Left on Black Friday 2017."
     },
     {
     "Artist": "Son Volt",
     "Album": "Straightaways",
     "Format": "LP",
     "Label": "Rhino/WB",
     "Quantity": 2500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553522:360",
     "More Info": "20th Anniversary repressing of Son Volt's second album"
     },
     {
     "Artist": "Son Volt",
     "Album": "Ballymena EP",
     "Format": "10\" Vinyl",
     "Label": "Transmit Sound/Thirty Tigers",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553523:360",
     "More Info": "This wonderful 10\" vinyl 45 rpm RSD Black Friday offering from Son Volt features 3 unreleased tracks that were left off of 2017's Notes Of Blue, and 1 re-recording of a Son Volt classic \"Sultana\" from American Central Dust. These amazing songs are of stripped down acoustic in nature with some percussion elements and electric guitar."
     },
     {
     "Artist": "Sublime",
     "Album": "40oz to Freedom",
     "Format": "2 x LP Picture Disc",
     "Label": "Gasoline Alley",
     "Quantity": 3000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553646:360",
     "More Info": "American ska punk band Sublime formed in Long Beach, CA in 1988, and achieved massive fame right after lead singer Brad Nowell's untimely death in 1996. It's hard to believe it's been 25 years since Sublime burst into the mainstream with their 1992 release 40oz to Freedom. To commemorate the occasion, Geffen Records is re-releasing Sublime's debut on 2LP picture discs with the 40oz sun logo made famous by the band on one disc and pictures from the original release on the second disc. With the #1 single \"What I Got,\" Sublime went on to sell more than 17 million albums worldwide. Crack open a 40oz this RSD Black Friday and enjoy Sublime before their prime."
     },
     {
     "Artist": "Roger Taylor",
     "Album": "Journey's End",
     "Format": "10\" Vinyl",
     "Label": "Omnivore Recordings",
     "Quantity": 2400,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553503:360",
     "More Info": "10\" EP on Colored Vinyl, includes previously unreleased tracks"
     },
     {
     "Artist": "Twisted Sister",
     "Album": "A Twisted Christmas",
     "Format": "LP",
     "Label": "Rhino",
     "Quantity": 2000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553525:360",
     "More Info": "The 2006 metal Christmas classic was also the last studio album released by Twisted Sister. This Record Store Day Black Friday edition comes on seasonally appropriate green vinyl."
     },
     {
     "Artist": "Tyga",
     "Album": "The Gold Album: 18th Dynasty",
     "Format": "LP",
     "Label": "EMPIRE/Last Kings Music",
     "Quantity": 500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458559366:360",
     "More Info": "Compton born rap mega-star, Tyga, released The Gold Album: 18th Dynasty in 2015, the first release for Last Kings Records. It's coming on vinyl for the first time for RSD Black Friday 2017, and features Boosie Badazz and Lil Wayne with art done by Kanye West and his creative agency, Donda."
     },
     {
     "Artist": "Utopia",
     "Album": "A Different P.O.V.",
     "Format": "12\" Vinyl",
     "Label": "Real Gone Music",
     "Quantity": 1200,
     "PhotoURL": "http://recordstoreday.com/Photo/418458552266:360",
     "More Info": "Three unreleased Utopia demos from 1985"
     },
     {
     "Artist": "Christmas On Death Row",
     "Album": "Christmas On Death Row",
     "Format": "LP",
     "Label": "Death Row Records",
     "Quantity": 1000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553478:360",
     "More Info": "First time on vinyl. Features Snoop Dogg, Dogg Pound, Nate Dogg, and more on colored vinyl!"
     },
     {
     "Artist": "Guardians Of The Galaxy",
     "Album": "Baby Groot Picture Disc",
     "Format": "12\" Picture Disc",
     "Label": "Hollywood Records",
     "Quantity": 3500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553588:360",
     "More Info": "Everyone's favorite dancing twig is back! This dual sided die-cut picture disc features and image of Baby Groot and includes the tracks \"Guardians Inferno\" performed by the Sneepers featuring David Hasselhoff, and Tyler Bates' score track \"Dad\" on the reverse."
     },
     {
     "Artist": "Various Artists",
     "Album": "Here's To The Champion",
     "Format": "12\" Vinyl",
     "Label": "Black Country Rock",
     "Quantity": 1500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553709:360",
     "More Info": "In the late 90's, Waylon Jennings was working on a batch of new material for a potential new album to be recorded. One of those songs was a touching tribute to his hero, Muhammad Ali. The song, Here's To The Champion (Muhammad Ali) was recorded but never released. In this very special collection, Black Country Rock presents five versions of the song, on colored 12\" vinyl, performed by some of country music's most profound legends and some young blood as well, including the original Waylon version, remixed by Dave Cobb and the original demo sung by Waylon as well. Includes performances from Waylon Jennings, Willie Nelson, Amy Nelson, Jessi Colter, Kris Kristofferson, Shooter Jennings, Jaime Wyatt."
     },
     {
     "Artist": "Vitamin String Quartet",
     "Album": "Vitamin String Quartet: The World of Studio Ghibli",
     "Format": "LP",
     "Label": "Vitamin Records",
     "Quantity": 950,
     "PhotoURL": "http://recordstoreday.com/Photo/418458579221:360",
     "More Info": "The World of Studio Ghibli is Vitamin String Quartet's refined interpretation of the wonderfully emotional music found in the films of Japanese animation giant, Studio Ghibli. This collection delivers an unlikely twist on the studio's most iconic works, producing an album that brings the child out in all of us, while highlighting Ghibli's ability to shine detail and beauty on the simplest themes. With tracks from the entire history of Ghibli animations, including a supernatural version of \"On a Clear Day\" from 1988's Kiki's Delivery Service, to a poignant rendition of \"Fine on the Outside\" from 2014's When Marnie Was There, VSQ are honored to tribute such deeply nostalgic and masterful pieces."
     },
     {
     "Artist": "Y Kant Tori Read",
     "Album": "Y Kant Tori Read",
     "Format": "LP",
     "Label": "Rhino/Atlantic",
     "Quantity": 4000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553529:360",
     "More Info": "After many years of effectively disowning this record, Tori Amos is ready to bring it back into the fold. Released in January of 1988, Y Kant Tori Read was her first official recorded output for Atlantic. It wasn't a chart success and it isn't the Tori that we know today; but for many Tori Amos fans, it is the holy grail of coveted out-of-print records. Tracks are newly remastered with the track list returned to it's original release order."
     },
     {
     "Artist": "Y Kant Tori Read",
     "Album": "Y Kant Tori Read",
     "Format": "CD",
     "Label": "Rhino/Atlantic",
     "Quantity": 3500,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553529:360",
     "More Info": "After many years of effectively disowning this record, Tori Amos is ready to bring it back into the fold. Released in January of 1988, Y Kant Tori Read was her first official recorded output for Atlantic. It wasn't a chart success and it isn't the Tori that we know today; but for many Tori Amos fans, it is the holy grail of coveted out-of-print records. Tracks are newly remastered with the track list returned to it's original release order."
     },
     {
     "Artist": "Neil Young",
     "Album": "Harvest Moon",
     "Format": "2 x LP",
     "Label": "Warner Bros.",
     "Quantity": 5000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553517:360",
     "More Info": "This 25th Anniversary Edition of the Neil Young classic is newly remastered and presented for the first time on vinyl in North America, in case-wrapped gatefold jacket."
     },
     {
     "Artist": "Frank Zappa",
     "Album": "Lumpy Gravy: Primordial",
     "Format": "12\" Vinyl",
     "Label": "Zappa/Barking Pumpkin Studios",
     "Quantity": 4000,
     "PhotoURL": "http://recordstoreday.com/Photo/418458553602:360",
     "More Info": "Lumpy Gravy: Primordial contains Frank Zappa’s first orchestral-only edit of the music sessions recorded at Capitol Studios during 1967. This self-described “ballet” was never officially issued until 2008 on the posthumous collection Lumpy Money.  Here it makes it’s debut on limited edition colored vinyl with FZ’s original album design."
     }
]
